Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/contributing.po
Languages: uk, zh_hans

source: Contributing to Fedora Silverblue
uk: Участь у розробці Fedora Silverblue

source: Help us improve Fedora Silverblue by contributing to the project!
uk: Допоможіть нам поліпшити Fedora Silverblue своєю участю у проєкті!

source: Developing Silverblue
uk: Розробка Silverblue

source: If you are a developer, you can contribute to one of the several projects which make Fedora Silverblue possible. Submit your pull requests to:
uk: Якщо ви є розробником, ви можете взяти участь у одному з проєктів, на основі яких створюють Fedora Silverblue. Надсилайте свої латки до таких проєктів:

source: Your contributions towards the main https://fedoraproject.org/wiki/Join[Fedora] project are also very welcome.
uk: Також будемо раді вашим внескам до основного проєкту https://fedoraproject.org/wiki/Join[Fedora].
zh_hans: 我们也非常欢迎你为 https://fedoraproject.org/wiki/Join[Fedora] 主项目做出贡献。

source: Creating Flatpaks
uk: Створення пакунків Flatpak
zh_hans: 创建 Flatpak 软件包

source: Your favourite application is not in the default repository and won't probably be added? You can do it yourself! Go through our tutorial for creating flatpaks from rpm packages:
uk: Вашої улюбленої програми немає у типовому сховищі пакунків і, ймовірно, її там ніколи не буде? Ви можете усунути проблему власноруч! Скористайтеся нашими покроковими настановами щодо створення пакунків flatpak з пакунків rpm:
zh_hans: 发现你最喜欢的应用程序不在默认软件源里面？尝试自己打包吧！下面的资源将帮助你利用 RPM 创建 Flatpak 软件包：

source: https://docs.fedoraproject.org/en-US/flatpak/tutorial/[RPM to Flatpak tutorial]
uk: https://docs.fedoraproject.org/en-US/flatpak/tutorial/[Підручник з перетворення RPM на Flatpak]
zh_hans: https://docs.fedoraproject.org/en-US/flatpak/tutorial/[RPM 至 Flatpak 转换指南]

source: To become an official packager you need to go through several steps to gain all required permissions to use the Fedora infrastructure (Pagure, Koji, Bodhi). There is a detailed https://fedoraproject.org/wiki/Join_the_package_collection_maintainers[wiki page] about becoming a packager.
uk: Щоб стати офіційним пакувальником, вам слід виконати декілька кроків для отримання усіх потрібних прав доступу для користування інфраструктурою Fedora (Pagure, Koji, Bodhi). Ми створили докладну https://fedoraproject.org/wiki/Join_the_package_collection_maintainers[сторінку вікі] щодо набуття прав пакувальника.

source: Other useful links:
uk: Інші корисні посилання:
zh_hans: 其它实用链接：

source: https://src.fedoraproject.org[Package Sources]
uk: https://src.fedoraproject.org[Початкові коди пакунків]
zh_hans: https://src.fedoraproject.org[软件包源码]

source: Writing Documentation
uk: Написання документації
zh_hans: 撰写文档

source: Creating or modifying documentation is easy. Head over to our https://github.com/fedora-silverblue/silverblue-docs[documentation] GitHub repository, fork it and create a pull request.
uk: Створення і внесення змін до документації є простою справою. Прямуйте до сторінки https://github.com/fedora-silverblue/silverblue-docs[нашого сховища документації] на GitHub, створіть його відгалуження, внесіть зміни і надішліть запит щодо об'єднання.

source: If you are not comfortable with using git, create a new topic in our https://discussion.fedoraproject.org/c/desktop/silverblue[community] or log an https://github.com/fedora-silverblue/silverblue-docs/issues[issue] describing what need to be changed.
uk: Якщо ви не маєте наміру користуватися git, створіть нову тему у нашій https://discussion.fedoraproject.org/c/desktop/silverblue[спільноті] або повідомте про https://github.com/fedora-silverblue/silverblue-docs/issues[ваду], описавши бажані для вас зміни.

source: Writing Conventions
uk: Настанови щодо написання документації
zh_hans: 写作规约

source: When creating documentation, please follow these writing conventions:
uk: При створенні документації, будь ласка, дотримуйтеся таких умов:
zh_hans: 在创建文档时，请遵守下面的写作规约：

source: Code blocks for commands that require `root` privileges must show the `#` prompt symbol. Example:
uk: У блоках коду для команд, які потребують прав доступу `root`, має бути символ запиту `#`. Приклад:

source: # dnf install <package>
uk: # dnf install <пакунок>

source: The `$` user prompt symbol can also be used but you must prefix the command with `sudo`. Example:
uk: Можна використовувати символ запиту на команду користувача `$`, але до команди слід додавати префікс `sudo`. Приклад:

source: $ sudo dnf install <package>
uk: $ sudo dnf install <пакунок>

source: Reporting Issues
uk: Створення повідомлень про вади
zh_hans: 问题报告

source: You can report bugs and suggest features or improvements on the https://github.com/fedora-silverblue/issue-tracker/issues[issue tracker.]
uk: Ви можете повідомляти про вади та надсилати запити щодо поліпшень за допомогою https://github.com/fedora-silverblue/issue-tracker/issues[системи стеження за вадами].

source: Contributing to Fedora {variant-name}
zh_hans: 为 Fedora {variant-name} 做出贡献

source: Help us improve Fedora {variant-name} by contributing to the project!
zh_hans: 帮助我们改进 Fedora {variant-name}！

source: Developing {variant-name}
zh_hans: 参与 {variant-name} 开发

source: If you are a developer, you can contribute to one of the several projects which make Fedora {variant-name} possible. Submit your pull requests to:
zh_hans: 如果你是一名开发者，你可以为下面的任一项目做出贡献，是这些项目使得 Fedora {variant-name} 成为可能。发送你的合并请求到：

source: Creating or modifying documentation is easy. Head over to our {docs-src}[documentation] GitHub repository, fork it and create a pull request.
zh_hans: 创建或编辑文档是非常简单的。你可以前往托管于 GitHub 的 {docs-src}[文档] 仓库，创建一份拷贝然后发起合并请求。

source: If you are not comfortable with using git, create a new topic in our {discussion-forum}[community] or log an {docs-issue}[issue] describing what need to be changed.
zh_hans: 如果你不太了解 Git 的使用，你也可以在 {discussion-forum}[社区] 创建一个帖子或在 https://github.com/fedora-silverblue/silverblue-docs/issues[问题反馈] 页告诉我们何处需要改动。

source: Code blocks for commands that require `root` privileges must show the `#` prompt symbol. Example:
zh_hans: 需要 `root` 权限执行的命令块必须要以 `#` 作为前缀，举个例子：

source: The `$` user prompt symbol can also be used but you must prefix the command with `sudo`. Example:
zh_hans: 你也可以使用 `$` 作为前缀，但与此同时你需要在命令前再加上 `sudo` ，举个例子：

source: You can report bugs and suggest features or improvements on the {issue-tracker}[issue tracker].
zh_hans: 你可以在 {issue-tracker}[问题追踪系统] 报告问题或请求新功能。

source: To become an official packager you need to go through several steps to gain all required permissions to use the Fedora infrastructure (Pagure, Koji, Bodhi). There is a detailed https://docs.fedoraproject.org/en-US/package-maintainers/Joining_the_Package_Maintainers/[page] about becoming a packager.
zh_hans: 要成为一名官方打包者你需要完成若干步骤以获得所有 Fedora 核心设施（Pagure、Koji 和 Bodhi）的访问权限。你可以阅读 https://docs.fedoraproject.org/en-US/package-maintainers/Joining_the_Package_Maintainers/[文档的相关页面] 以了解如何成为一名打包者。
