Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/faq.po
Languages: pt_br, uk

source: Frequently Asked Questions (FAQ)
pt_br: Perguntas frequentes (FAQ)
uk: Поширені питання та відповіді на них

source: About the project
pt_br: Sobre o projeto
uk: Про проєкт

source: Is it Team Silverblue, Silverblue, or Fedora Silverblue?
pt_br: É Equipe Silverblue, Silverblue ou Fedora Silverblue?
uk: Це Команда Silverblue, Silverblue чи Fedora Silverblue?

source: We chose the name Team Silverblue to refer to the overall project. Fedora Silverblue will be used for the OS that we are producing, but calling it Silverblue in its short version is fine as well.
uk: Для усього проєкту ми вибрали назву «Team Silverblue». Назву «Fedora Silverblue» буде використано для операційної системи, яку ми створюємо, але її можна називати і короткою назвою — «Silverblue».

source: Why does the Silverblue logo look like a leaf?
pt_br: Por que o logotipo do Silverblue parece uma folha?
uk: Чому логотип Silverblue виглядає як листок?

source: Our favorite choice for a project name was Silverleaf, but that sadly did not work out. We just couldn't quite let go of the leaf. You could also say that Silverblue is a new new leaf on Fedora's OSTree. 😀
uk: Ми хотіли назвати проєкт «Silverleaf» («срібний листок»), але, на жаль, не вийшло. Але ми не могли просто так забути наш «листок». «Silverblue», можна так сказати», — новий листок на дереві OSTree Fedora. 😀

source: Is Silverblue another GNOME OS?
pt_br: Silverblue é outro GNOME OS?
uk: Silverblue — ще одна версія GNOME OS?

source: GNOME OS was a codename that was used by the upstream GNOME project for a while to refer to the idea of designing the entire desktop user experience. By contrast, Silverblue is an effort inside the Fedora project, and will be built with existing Fedora technologies. However, the two efforts do share a desire to deliver a user experience that is polished and coherent.
uk: GNOME OS — кодова назва, яку певний час використовували основні учасники проєкту GNOME для позначення ідеї створення операційної системи, побудованої навколо графічного середовища. Silverblue ж є результатом зусиль учасників проєкту Fedora. Операційну систему буде побудовано на основі наявних технологій Fedora. Втім, у обох проєктах метою є створення якісного і узгодженого робочого середовища.

source: What is Silverblue's relationship with Project Atomic?
uk: Як Silverblue пов'язано із проєктом Atomic?

source: Fedora Silverblue uses the same core technology as Fedora Atomic Host (as well as its successor, Fedora CoreOS). However, Silverblue is specifically focused on workstation/desktop use cases.
uk: У Fedora Silverblue використано ту саму основну технологію, що у базовій системі Fedora Atomic (а також у її наступниці — Fedora CoreOS). Втім, акцент у Silverblue зроблено на задоволенні потреби у якісній робочій станції.

source: About using Silverblue
uk: Про використання Silverblue

source: How can I install Eclipse on Silverblue?
uk: Як встановити Eclipse у Silverblue?

source: Instructions to setup the Nightly flatpak remote for Eclipse are available http://eclipse.matbooth.co.uk/flatpak[here].
pt_br: Instruções para configurar o Nightly flatpak remoto para Eclipse estão disponíveis http://eclipse.matbooth.co.uk/flatpak[aqui].
uk: Настанови для налаштовування віддаленого сховища щоденних flatpak для Eclipse можна знайти http://eclipse.matbooth.co.uk/flatpak[тут].

source: How do I create a VPN connection?
pt_br: Como eu crio uma conexão VPN?
uk: Як створити з'єднання VPN?

source: `/etc` is not part of the immutable OS image, so you can just copy files into `/etc/NetworkManager/system-connections` (or let NetworkManager store them there when you recreate your connections). Certificates in `/etc/pki` need to be handled similarly.
uk: `/etc` не є частиною незмінного образу операційної системи, тому ви можете просто скопіювати файли до `/etc/NetworkManager/system-connections` (або надати змогу NetworkManager зберегти ці файли там, коли ви повторно створюватимете ваші з'єднання). З сертифікатами у `/etc/pki` можна працювати у той самий спосіб.

source: How can I play more videos in Firefox, like YouTube?
pt_br: Como posso reproduzir mais vídeos no Firefox, como o YouTube?
uk: Як можна відтворювати ширший спектр відео у Firefox, зокрема YouTube?

source: Firefox is included in the OS image for now. Until that changes, getting it to play videos works the same way as it does for the regular Fedora Workstation: find a package with the needed codecs, and install it. The one difference is that you use `rpm-ostree install` instead of `dnf install`. An alternative solution is to install the nightly Firefox, which is available as a https://firefox-flatpak.mojefedora.cz/org.mozilla.FirefoxNightly.flatpakref[Flatpak].
uk: У поточних версіях до складу образу операційної системи включено Firefox. До того, як можуть відбутися якісь зміни, для відтворення відео у браузері слід виконати ті самі дії, що і у звичайній Fedora Workstation: знайти пакунок із відповідними кодеками і встановити його. Єдиною відмінністю є те, що слід скористатися `rpm-ostree install`, а не `dnf install`. Альтернативним варіантом вирішення проблеми є встановлення щоденної збіркиy Firefox, яка доступна у форматі пакунка https://firefox-flatpak.mojefedora.cz/org.mozilla.FirefoxNightly.flatpakref[Flatpak].

source: How can I use Adobe Flash on the Firefox version pre installed on my system?
uk: Як скористатися Adobe Flash у версії Firefox, яку попередньо встановлено у моїй системі?

source: You can follow this https://docs.fedoraproject.org/en-US/quick-docs/using-adobe-flash/[Fedora quickdoc] with the following changes:
uk: Ви можете стежити за цим https://docs.fedoraproject.org/en-US/quick-docs/using-adobe-flash/[Fedora quickdoc] з такими змінами:

source: where needed, substitute the `dnf install` command with the `rpm-ostree install` command
uk: де потрібно, замініть команду `dnf install` на команду `rpm-ostree install`

source: reboot the system after the installation of the Adobe DNF repository
uk: перезавантажте систему після встановлення сховища DNF Adobe

source: install only `flash-plugin` as `libcurl` and `alsa-plugins-pulseaudio` are installed by default on Fedora Silverblue
uk: встановіть лише `flash-plugin`, оскільки `libcurl` і `alsa-plugins-pulseaudio` типово встановлено у Fedora Silverblue

source: reboot the system after having installed `flash-plugin`
uk: перезавантажте систему після встановлення `flash-plugin`

source: How can I see what packages were updated between two commits?
pt_br: Como posso ver quais pacotes foram atualizados entre dois commits?
uk: Як переглянути список пакунків, які було оновлено, між двома внесками?

source: If you want to compare the booted deployment with the pending deployment (or rollback deployment), simply issue:
pt_br: Se você quiser comparar a implantação inicializada com a implantação pendente (ou reverter implantação), basta executar:
uk: Якщо ви хочете порівняти завантажену розгорнуту систему із системою, яка очікує на розгортання (або нарощувальне розгортання), просто віддайте таку команду:

source: You can also see the RPM changelog by adding the `-c` option like so: `rpm-ostree db diff -c`
pt_br: Você também pode ver o changelog do RPM adicionando a opção `-c` assim: `rpm-ostree db diff -c`
uk: Ви також можете переглянути журнал змін RPM, додавши до команди параметр `-c`. Ось так: `rpm-ostree db diff -c`

source: If you want to see which packages were updated between two specific commits:
pt_br: Se você quiser ver quais pacotes foram atualizados entre dois commits específicos:
uk: Якщо ви хочете переглянути список пакунків, які було оновлено між двома певним внесками, зробіть так:

source: find out which two commits you want to compare by issuing:
pt_br: descubra quais dois commits você deseja comparar executando:
uk: визначте два внески, які ви хочете порівняти, можна за допомогою такої команди:

source: $ ostree log <ref>
uk: $ ostree log <посилання>

source: you can now compare the two commits by issuing:
pt_br: agora você pode comparar os dois commits executando:
uk: далі, порівняйте два внески за допомогою такої команди:

source: $ rpm-ostree db diff <commit x> <commit y>
uk: $ rpm-ostree db diff <внесок x> <внесок y>

source: How can I check the version number of an installed package?
pt_br: Como posso verificar o número da versão de um pacote instalado?
uk: Як можна визначити номер версії встановленого пакунка?

source: You can simply use:
pt_br: Você pode simplesmente usar:
uk: Можете просто скористатися такою командою:

source: $ rpm -q <package>
pt_br: $ rpm -q <pacote>
uk: $ rpm -q <пакунок>

source: How can I check if an `rpm` software package is available in the repository?
pt_br: Como posso verificar se um pacote de software `rpm` está disponível no repositório?
uk: Як перевірити, чи є пакунок програмного забезпечення `rpm` у сховищі пакунків?

source: At this point in time, there is no `rpm` package search function built into `rpm-ostree`. However, you can use `toolbox` with the following command:
uk: На цьому етапі розвитку системи функціональної можливості пошуку пакунків `rpm`, яку було б вбудовано до `rpm-ostree`, не передбачено. Втім, ви можете скористатися `toolbox` і такою командою:

source: $ toolbox run dnf search <package>
pt_br: $ toolbox run dnf search <pacote>
uk: $ toolbox run dnf search <пакунок>

source: The assumption is that you have already created a toolbox matching the version of your Fedora Silverblue installation.
uk: Тут ми припускаємо, що у вас вже створено toolbox, який відповідає встановленій у вас версії Fedora Silverblue.

source: How can I downgrade my system's kernel?
pt_br: Como posso fazer o downgrade do kernel do meu sistema?
uk: Як знизити версію ядра системи?

source: If, for whatever reason, you need to downgrade the kernel, you can do so by following these steps:
pt_br: Se, por qualquer motivo, você precisar fazer o downgrade do kernel, pode fazer isso seguindo estas etapas:
uk: Якщо з будь-якої причини у вас виникла потреба у зниженні версії ядра системи, ви можете виконати його за допомогою таких кроків:

source: For the version you need to downgrade, download `<kernel>`, `<kernel-core>`, `<kernel-modules>` and `<kernel-modules-extra>` from https://koji.fedoraproject.org/koji/packageinfo?packageID=8[Koji].
pt_br: Para a versão que você precisa fazer o downgrade, faça o download de `<kernel>`, `<kernel-core>`, `<kernel-modules>` e `<kernel-modules-extra>` do https://koji.fedoraproject.org/koji/packageinfo?packageID=8[Koji].
uk: Для версії, до якої ви хочете знизити версію ядра, отримайте пакунки `<kernel>`, `<kernel-core>`, `<kernel-modules>` і `<kernel-modules-extra>` з https://koji.fedoraproject.org/koji/packageinfo?packageID=8[Koji].

source: Install the packages downloaded on the previous step by issuing:
pt_br: Instale os pacotes baixados na etapa anterior executando:
uk: Встановіть отримані на попередньому кроці пакунки за допомогою такої команди:

source: Reboot the system to apply the changes.
pt_br: Reinicialize o sistema para aplicar as alterações.
uk: Перезавантажте систему для застосування змін.

source: How can I upgrade my system to the next major version (for instance: rawhide or an upcoming Fedora release branch), while keeping my current deployment?
pt_br: Como posso atualizar meu sistema para a próxima versão principal (por exemplo: rawhide ou um próximo ramo lançamento do Fedora), mantendo minha implantação atual?
uk: Як оновити систему до наступної основної версії (наприклад rawhide або гілки майбутнього випуску Fedora), не вилучаючи поточної розгорнутої системи?

source: OSTree allows you to pin deployments (pinning ensures that your deployment of choice is kept and not discarded).
pt_br: OSTree permite que você fixe implantações (a fixação garante que a implantação de sua escolha seja mantida e não descartada).
uk: В OSTree передбачено можливість пришпилювання розгорнутих систем (пришпилювання призводить до того, що пришпилена система лишається встановленою і не вилучається).

source: Assuming that you want to keep your default deployment, issue the following command:
pt_br: Supondo que você deseja manter sua implantação padrão, emita o seguinte comando:
uk: Припустімо, вам потрібно зберегти вашу типову розгорнуту систему. Тоді, слід віддати таку команду:

source: `0` here refers to the first deployment listed by `rpm-ostree status`
pt_br: `0`aqui se refere à primeira implantação listada por `rpm-ostree status`
uk: `0` тут посилається на першу розгорнуту систему зі списку `rpm-ostree status`

source: Verify that you have pinned your deployment of choice by issuing:
pt_br: Verifique se você fixou sua implantação preferida, executando:
uk: Перевірте, чи пришпилено вибрану вами розгорнуту систему за допомогою такої команди:

source: After the deployment is pinned, you can upgrade your system by using the instructions found https://docs.fedoraproject.org/en-US/fedora-silverblue/updates-upgrades-rollbacks/#upgrading[here.]
uk: Після того, як розгорнуту систему пришпилено, ви можете оновити вашу систему за допомогою настанов, які наведено https://docs.fedoraproject.org/uk-UA/fedora-silverblue/updates-upgrades-rollbacks/#upgrading[тут.]

source: When you have completed rebasing, reboot the system. The GRUB menu will now present you with both: the previous deployment major version entry (e.g.: *"Fedora 30.YYYYMMDD.n"*) and the new deployment major version entry (e.g.: *"Fedora 31.YYYYMMDD.n"*).
uk: Після завершення переходу перезавантажте систему. У меню GRUB ви знайдете обидва пункти: запис попередньої розгорнутої основної версії (наприклад *"Fedora 30.YYYYMMDD.n"*) і запис нової розгорнутої основної версії (наприклад *"Fedora 31.YYYYMMDD.n"*).

source: At the moment it is not possible to name (pinned) deployments and their associated GRUB menu entries.
pt_br: No momento, não é possível nomear implantações (fixadas) e suas entradas de menu GRUB associadas.
uk: У поточній версії не передбачено можливості змінювати назви (пришпилених) розгорнутих систем та пов'язаних із ними пунктів меню GRUB.
