Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/first-login.po
Languages: uk

source: First Login
uk: Перший вхід до системи

source: [[filesystem-layout]] Filesystem Layout
uk: [[filesystem-layout]] Компонування файлової системи

source: The root filesystem has the immutable attribute set on OSTree installations, so `/`, `/usr` and everything below it is readonly. `/var` is where all the runtime state is kept. There are some symlinks that put the state-carrying directories in their traditional, expected place:
uk: Для кореневої файлової системи у встановлених екземплярах OSTree визначено атрибути незмінності, тому усі дані у каталогах «/», «/usr» та їхніх підкаталогах придатні лише для читання. Усі змінні дані зберігаються у «/var». Передбачено деякі символічні посилання, які забезпечують зв'язок із традиційними каталогами, у яких зберігається стан системи:

source: and so on. If you have a separate home partition on your system, it should be mounted on `/var/home`.
uk: тощо. Якщо у вашій системі є окремий розділ для домашнього каталогу, його слід змонтувати до `/var/home`.

source: For a more detailed explanation of the system layout, refer to the excellent https://ostree.readthedocs.io/en/latest/manual/adapting-existing/[libostree documentation] on this subject.
uk: Докладніший опис компонування системи можна знайти у чудовій https://ostree.readthedocs.io/en/latest/manual/adapting-existing/[документації з libostree] з цього питання.

source: Packaging: ostree, rpms, flatpaks and containers
uk: Пакування: ostree, rpms, flatpak і контейнери

source: _ostree_ is responsible for deploying and updating the OS image (ie everything below `/` that is not symlinked into `/var`). ostree also contains the necessary logic to update grub.cfg entries to point to the current image.
uk: _ostree_ відповідає за розгортання і оновлення образу операційної системи (тобто усе, що зберігається у `/` і не є символічним посиланням на `/var`). ostree також містить необхідний код для оновлення записів grub.cfg у такий спосіб, щоб вони вказували на поточний образ.

source: _rpm-ostree_ builds on top of ostree, and makes it possible to install rpms as a 'layer' on top of an ostree image. In practice, that means you can install rpms as usual, just use rpm-ostree install instead of dnf install. What happens under the covers is that rpm-ostree will compose a new OS image by adding the rpm payload to the existing OS image, and creating a new, combined image. To see the newly installed rpms, you have to reboot into the new image. _rpm-ostree_ also takes care of recreating the layered image whenever you update the base OS image.
uk: _rpm-ostree_ надбудовується над ostree і уможливлює встановлення пакунків rpm як «шару» над образом ostree. Практично, це означає, що ви можете встановлювати rpm у звичний спосіб — просто скористайтеся встановленням за допомогою rpm-ostree замість встановлення за допомогою dnf. На технічному рівні, rpm-ostree створить новий образ операційної системи шляхом додавання вмісту пакунків rpm до наявного образу операційної системи і створення нового комбінованого образу. Щоб побачити нововстановлені пакунки rpm, вам слід перезавантажитися у новий образ. _rpm-ostree_ також дбає про перезбирання шаруватого образу системи кожного разу, коли ви оновлюєте базовий образ операційної системи.

source: _flatpak_ uses container technologies to deploy and run desktop applications isolated from the underlying OS.
uk: _flatpak_ використовує технології контейнеризації для розгортання і запуску стільничних програм, які ізольовано від базової операційної системи.

source: You can of course use other container tools like _podman_ or _buildah_ to run other containers on a Silverblue system.
uk: Ви, звичайно ж, можете скористатися іншими засобами контейнеризації, зокрема _podman_ та _buildah_, для роботи з контейнерами у системі Silverblue.

source: Using Flatpak
uk: Користування Flatpak

source: If you don't want to use the _flatpak_ commandline tools, GNOME Software has excellent support for installing Flatpaks. There are several repositories that provide Flatpaks.
uk: Якщо ви не хочете користуватися інструментами командного рядка _flatpak_, у програмі «Програмне забезпечення» GNOME передбачено чудові можливості для роботи з пакунками Flatpak. Пакунки Flatpak можна отримати з декількох сховищ.

source: http://flathub.org[Flathub] is a convenient place to find many popular desktop apps
uk: http://flathub.org[Flathub] — зручне місце, де ви знайдете пакунки багатьох популярних стільничних програм

source: https://sdk.gnome.org/gnome-apps-nightly.flatpakrepo[GNOME nightly] provides builds of unstable GNOME apps
uk: https://sdk.gnome.org/gnome-apps-nightly.flatpakrepo[GNOME nightly] — збірки поточних нестабільних програм GNOME

source: Once you have repositories enabled, you can use GNOME Software's excellent support for searching Flatpaks. Or you can use `flatpak search` command.
uk: Щойно потрібні вам сховища буде увімкнено, ви зможете скористатися чудовою підтримкою пошуку пакунків Flatpak у програмі «Програмне забезпечення» GNOME. Крім того, ви можете скористатися командою `flatpak search`.

source: Using Package Layering
uk: Користування нашаровуванням пакунків

source: Package layering works by re-composing the OS image locally, while adding extra rpm packages to it. This is done with the `rpm-ostree install` command. Once a package has been layered, rpm-ostree will keep it up-to-date for you and recreate the layer when you install a newer OS image.
uk: Нашаровування пакунків працює так: образ операційної системи перекомпоновується локально із додаванням до нього нових пакунків rpm. Цю роботу виконує програма `rpm-ostree install`. Після нашаровування пакунка rpm-ostree підтримує його актуальність і перестворює шар пакунка кожного разу, коли ви встановлюєте новіший образ операційної системи.

source: You can also remove a package from OS image. The command to do this is `rpm-ostree override remove`.
uk: Ви також можете вилучати пакунки з образу операційної системи. Для цього слід скористатися командою `rpm-ostree override remove`.

source: rpm-ostree does not currently have an equivalent to the `dnf search` command for finding packages in the configured repositories. As a workaround, you can run _dnf_ in a temporary container like this:
uk: У поточній версії rpm-ostree ще немає еквівалента команди `dnf search` для пошуку пакунка у налаштованих сховищах. Обійти цю проблему можна використанням _dnf_ у межах тимчасового контейнера, ось так:

source: provide your search term
uk: вкажіть ваш критерій для пошуку

source: Enabling third-party RPM Repositories
uk: Вмикання сторонніх сховищ RPM

source: Silverblue installs a number of yum repositories containing useful software that is not part of Fedora proper for various reasons. You can enable these repositories either during the initial setup of an new install, or from the "Software Repositories" dialog in GNOME Software.
uk: Silverblue встановлює дані декількох сховищ yum із корисним програмним забезпеченням, яке з певних причин не є частиною основної Fedora. Ви можете увімкнути ці сховища або під час початкового налаштовування нововстановленої системи, або за допомогою вікна «Сховища програмного забезпечення» програми «Програмне забезпечення» GNOME.
