Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/index.po
Languages: fr, pt_br, uk, zh_hans

source: Fedora Silverblue User Guide
fr: Guide de l'utilisateur de Fedora Silverblue
pt_br: Guia do usuário do Fedora Silverblue

source: Welcome to the Fedora Silverblue user guide!
fr: Bienvenue dans le guide de l'utilisateur de Fedora Silverblue !
pt_br: Bem-vindo ao guia do usuário do Silverblue!

source: Silverblue logo
fr: Logo de Fedora Silverblue
pt_br: Logo do Silverblue

source: _Fedora Silverblue_ is an immutable desktop operating system. It aims to be extremely stable and reliable. It also aims to be an excellent platform for developers and for those using container-focused workflows.
fr: _Fedora Silverblue_ est un système d'exploitation avec interface graphique et immutable. Il a pour but d'être très stable et sûr. Il a aussi pour objectif d'être une plateforme de choix pour les développeurs et pour les usages centrés autour des conteneurs.
pt_br: _Fedora Silverblue_ é um sistema operacional imutável de desktop. Tem como objetivo ser extremamente estável e confiável. Ele também pretende ser uma excelente plataforma para desenvolvedores e para aqueles que usam fluxos de trabalho com foco em contêiner.

source: Introduction to Silverblue
fr: Introduction à Silverblue
pt_br: Introdução ao Silverblue

source: Silverblue is a variant of Fedora Workstation. It looks, feels and behaves like a regular desktop operating system, and the experience is similar to what you find with using a standard Fedora Workstation.
fr: Silverblue est une variante de Fedora Workstation. Le système se comporte de la même façon qu'un système d'exploitation avec interface graphique classique et l'expérience est similaire à celle offerte par un système Fedora Workstation conventionnel.
pt_br: Silverblue é uma variante do Fedora Workstation. Ele se parece e se comporta como um sistema operacional de desktop normal, e a experiência é semelhante à que você encontra ao usar um Fedora Workstation padrão.

source: However, unlike other operating systems, Silverblue is immutable. This means that every installation is identical to every other installation of the same version. The operating system that is on disk is exactly the same from one machine to the next, and it never changes as it is used.
fr: En revanche, à la différence des autres systèmes d'exploitation, Silverblue est immuable. Cela signifie que chaque installation est identique à toutes les autres installations de la même version. Le système installé sur le disque est le même d'une machine à l'autre et il n'est jamais modifié lors de son utilisation.
pt_br: No entanto, ao contrário de outros sistemas operacionais, Silverblue é imutável. Isso significa que cada instalação é idêntica a todas as outras instalações da mesma versão. O sistema operacional que está no disco é exatamente o mesmo de uma máquina para a outra e nunca muda à medida que é usado.

source: Silverblue's immutable design is intended to make it more stable, less prone to bugs, and easier to test and develop. Finally, Silverblue's immutable design also makes it an excellent platform for containerized applications as well as container-based software development. In each case, applications (apps) and containers are kept separate from the host system, improving stability and reliability.
fr: Le design immuable de Silverblue a pour but de le rendre plus stable, moins sujet aux bugs, ainsi que de le rendre plus facile à tester et développer. Enfin, le design immuable de Silverblue en fait une excellente plateforme pour les applications conteneurisées ainsi que pour le développement de logiciels à l'aide de conteneurs. Dans chacun de ces cas, les applications et conteneurs sont gardées séparées du système hôte, améliorant ainsi la stabilité et la résilience.
pt_br: O design imutável do Silverblue se destina a torná-lo mais estável, menos sujeito a bugs e mais fácil de testar e desenvolver. Finalmente, o design imutável do Silverblue também o torna uma excelente plataforma para aplicativos em contêiner, bem como para o desenvolvimento de software baseado em contêiner. Em cada caso, os aplicativos (apps) e contêineres são mantidos separados do sistema host, melhorando a estabilidade e a confiabilidade.

source: Silverblue's core technologies have some other helpful features. OS updates are fast and there's no waiting around for them to install: just reboot as normal to start using the next version. With Silverblue, it is also possible to roll back to the previous version of the operating system, if something goes wrong.
fr: Les technologies au cœur de Silverblue ont aussi d'autres fonctionnalités utiles. Les mises à jour du système sont rapides et il n'est pas nécessaire d'attendre pendant leur installation : il suffit de redémarrer normalement pour obtenir la nouvelle version. Avec Silverblue, il est aussi possible de revenir en arrière à la précédente version du système si un problème venait à être rencontré.
pt_br: As principais tecnologias do Silverblue têm alguns outros recursos úteis. As atualizações do sistema operacional são rápidas e não há espera para serem instaladas: apenas reinicie normalmente para começar a usar a próxima versão. Com o Silverblue, também é possível reverter para a versão anterior do sistema operacional, se algo der errado.

source: About this guide
fr: A propos de ce guide
pt_br: Sobre este guia
uk: Про цей підручник
zh_hans: 关于这份指南

source: In most cases, Silverblue behaves like a standard Fedora Workstation installation, and the https://docs.fedoraproject.org/[standard Fedora documentation] can be used. This guide covers those areas where Silverblue differs from a standard Fedora Workstation, including:
fr: Dans la plupart des cas, Silverblue se comporte comme une installation standard de Fedora Workstation et la https://docs.fedoraproject.org/[documentation standard de Fedora] peut être utilisée. Ce guide se concentre sur les éléments qui diffèrent d'une installation standard de Fedora Workstation, en particulier :
pt_br: Na maioria dos casos, o Silverblue se comporta como uma instalação padrão do Fedora Workstation, e a https://docs.fedoraproject.org/[documentação padrão do Fedora] pode ser usada. Este guia cobre as áreas onde o Silverblue difere de um Fedora Workstation padrão, incluindo:

source: link:installation[OS installation]
fr: link:installation[Installation du système]
pt_br: link:installation[Instalação do sistema operacional]
uk: link:installation[Встановлення операційної системи]
zh_hans: link:installation[系统安装]

source: link:getting-started[Installing apps and software]
fr: link:getting-started[Installation de logiciels et d'applications]
pt_br: link:getting-started[Instalando aplicativos e softwares]
uk: link:getting-started[Встановлення програм і програмного забезпечення]
zh_hans: link:getting-started[安装应用程序]

source: link:updates-upgrades-rollbacks[OS upgrades and rollbacks]
fr: link:updates-upgrades-rollbacks[Mises à jour du système et retour en arrière]
pt_br: link:updates-upgrades-rollbacks[Atualizações e reversões de sistema operacional]
uk: link:updates-upgrades-rollbacks[Встановлення нових версій операційної системи та повернення до старих версій]
zh_hans: link:updates-upgrades-rollbacks[系统更新与回滚]

source: The primary audience for these docs are new users, who aren't expected to have specialist knowledge or technical knowledge about Silverblue's internals. However, some background link:technical-information[technical information] is provided, for those who are interested and want to learn more.
fr: Les nouveaux utilisateurs sont l'audience principale de cette documentation et il n'est pas attendu de posséder des connaissances de spécialiste ni de connaître les détails internes du fonctionnement de Silverblue. En revanche, vous pouvez constater la link:technical-information[documentation technique] si vous êtes intéressé et souhaitez en apprendre plus.
pt_br: O público principal para esses documentos são novos usuários, dos quais não se espera que tenham conhecimento especializado ou conhecimento técnico sobre os componentes internos do Silverblue. No entanto, algumas link:technical-information[informações técnicas] são fornecidas, para aqueles que estão interessados e querem saber mais.

source: {variant-name} User Guide
uk: Підручник користувача {variant-name}

source: Welcome to the {variant-name} user guide!
uk: Вітаємо у підручнику користувача {variant-name}!

source: {variant-name} logo
uk: Логотип {variant-name}

source: _{variant-name}_ is an immutable desktop operating system. It aims to be extremely stable and reliable. It also aims to be an excellent platform for developers and for those using container-focused workflows.
uk: _{variant-name}_ — незмінна операційна система для робочих станцій. Робота системи має бути надзвичайно стабільною і надійною. Система має бути чудовою платформою для розробників і тих, хто користується робочими процесами, заснованими на контейнеризації.

source: Introduction to {variant-name}
uk: Вступ до {variant-name}
zh_hans: {variant-name} 简介

source: {variant-name} is a variant of Fedora Workstation. It looks, feels and behaves like a regular desktop operating system, and the experience is similar to what you find with using a standard Fedora Workstation.
uk: {variant-name} є варіантом Fedora Workstation. Система виглядає, працює і поводиться як звичайна операційна система для робочих станцій — робота у ній повністю подібна до роботи у стандартній системі Fedora Workstation.
zh_hans: {variant-name} 是 Fedora Workstation 的变种版本。{variant-name} 也致力于提供高度贴近 Fedora Workstation 的桌面使用体验。

source: However, unlike other operating systems, {variant-name} is immutable. This means that every installation is identical to every other installation of the same version. The operating system that is on disk is exactly the same from one machine to the next, and it never changes as it is used.
uk: Втім, на відміну від інших операційних систем, {variant-name} є незмінною. Це означає, що кожен встановлений екземпляр системи є ідентичним до усіх екземплярів системи тієї самої версії. Операційна система на диску є абсолютно однаковою на усіх комп'ютерах, де її встановлено, — вона ніколи не змінюється протягом терміну користування нею.
zh_hans: 然而和其它操作系统不同的是，{variant-name} 是不可变的。这意味着同一版本下每一份安装都会是完全相同的，而且在使用过程中也不会发生任何改变。

source: {variant-name}'s immutable design is intended to make it more stable, less prone to bugs, and easier to test and develop. Finally, {variant-name}'s immutable design also makes it an excellent platform for containerized applications as well as container-based software development. In each case, applications (apps) and containers are kept separate from the host system, improving stability and reliability.
uk: Незмінність {variant-name} має зробити її стабільнішою, невразливою до вад та простішою у тестуванні та розробці. Нарешті, незмінність {variant-name} також робить її чудовою платформою для контейнеризованих програм, а також розробки заснованого на технологіях контейнеризації програмного забезпечення. Програми і контейнери за будь-яких умов є відокремленими від основної системи, що поліпшує стабільність і надійність роботи системи.
zh_hans: {variant-name} 的不可变设计使得它更加稳定，更不容易出现错误，更易于测试和开发。{variant-name} 的不可变设计也使其与容器化应用程序、容器应用开发成为绝配。应用程序和容器与主机系统的分隔也使得系统更加可靠。

source: {variant-name}'s core technologies have some other helpful features. OS updates are fast and there's no waiting around for them to install: just reboot as normal to start using the next version. With {variant-name}, it is also possible to roll back to the previous version of the operating system, if something goes wrong.
uk: У базових технологіях {variant-name} закладено і деякі інші корисні можливості. Оновлення операційної системи є швидким — вам не доведеться чекати на встановлення нових пакунків: просто перезавантажте систему для того, щоб почати користуватися новою версією. Крім того, у {variant-name} можна повернутися до попередньої версії операційної системи, якщо виникнуть якісь негаразди.
zh_hans: {variant-name} 使用的核心技术也带来了其它的特性。系统更新从此变得方便快捷：只需要重启系统就可以使用新版本，而出现任何问题时还可以随时回滚。

source: In most cases, {variant-name} behaves like a standard Fedora Workstation installation, and the https://docs.fedoraproject.org/[standard Fedora documentation] can be used. This guide covers those areas where {variant-name} differs from a standard Fedora Workstation, including:
uk: Здебільшого, {variant-name} поводиться як стандартна система Fedora Workstation, тому можна скористатися https://docs.fedoraproject.org/[документацією до стандартної Fedora]. У цьому підручнику висвітлено ті речі, якими {variant-name} відрізняється від стандартної Fedora Workstation, зокрема:
zh_hans: 在大部分情况下，{variant-name} 和普通的 Fedora Workstation 是一样的，这时候只需要参考 https://docs.fedoraproject.org/[常规 Fedora 文档] 就好了。这份文档则覆盖了 {variant-name} 与普通 Fedora Workstation 体验不一致的场景，包括：

source: The primary audience for these docs are new users, who aren't expected to have specialist knowledge or technical knowledge about {variant-name}'s internals. However, some background link:technical-information[technical information] is provided, for those who are interested and want to learn more.
uk: Основним контингентом читачів цієї документації мають бути нові користувачі, від яких ми не очікуємо глибоких спеціальних або технічних знань щодо {variant-name}. Втім, тут наведено деякі link:technical-information[технічні відомості] для тих, кому це цікаво, і для тих, хто хоче дізнатися більше.
zh_hans: 这份文档主要面向新用户，我们也不需要你掌握任何与 {variant-name} 内部实现有关的细节。然而，如果你希望深入研究 {variant-name}，你可以阅读 link:technical-information[这篇文章] 。
