Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/installation.po
Languages: pt_br, uk, zh_hans

source: Installing {variant-name}
uk: Встановлення {variant-name}
zh_hans: 安装 {variant-name}

source: Fedora {variant-name} can be installed in the same way as Fedora Workstation, and the official Fedora installation guide can be followed for your Fedora version. See the https://docs.fedoraproject.org/en-US/docs/[Fedora documentation site] for more details.
uk: Fedora {variant-name} можна встановити у той самий спосіб, у який можна встановити Fedora Workstation. Ви можете скористатися офіційними настановами щодо встановлення відповідної версії Fedora. Докладніший опис можна знайти на https://docs.fedoraproject.org/en-US/docs/[сайті документації Fedora].

source: Before you begin
pt_br: Antes de você começar
uk: Перш ніж ви почнете
zh_hans: 在你开始之前

source: As with installing any new operating system, it is important to back up any data that you want to save before starting, and have a clear understanding of the consequences of what you are doing.
pt_br: Assim como acontece com a instalação de qualquer novo sistema operacional, é importante fazer backup de todos os dados que deseja salvar antes de iniciar e ter uma compreensão clara das consequências do que está fazendo.
uk: Як і зі встановленням будь-якої нової операційної системи, важливо спочатку створити резервні копії усіх важливих для вас даних і мати точне розуміння наслідків усіх ваших дій.
zh_hans: 就跟安装任何新操作系统一样，在开始之前务必做好数据备份工作，并充分了解你接下来要做的事情。

source: {variant-name} is intended to provide the full range of capabilities that you would expect from an installation of Fedora Workstation. However, there are some differences in terms of which applications can be installed, and how the operating system environment works.
uk: {variant-name} надає повний спектр можливостей, які передбачено у встановленій Fedora Workstation. Втім, існують певні відмінності у тому, які програми може бути встановлено, і тому, як працює середовище операційної системи.
zh_hans: {variant-name} 致力于提供与 Fedora Workstation 相似的用户体验。然而，{variant-name} 缺省提供的软件包和 Workstation 略有不同，系统的工作原理也有所不同。

source: It is therefore recommended that you read this user guide before deciding to install {variant-name}. It is also recommended that you determine whether {variant-name} meets the specific needs or requirements that you might have. If you are uncertain about this, {variant-name} can also be tested in a virtual machine prior to installation or booted from a flash drive using Fedora Media Writer.
uk: Саме тому, ми рекомендуємо вам прочитати цей підручник, перш ніж ви вирішите встановити {variant-name}. Також рекомендуємо вам визначитися, чи задовольняє {variant-name} усі ваші специфічні потреби і вимоги. Якщо ви непевні щодо цього, {variant-name} можна спробувати у віртуальній машині до встановлення або завантажити із флешки, скориставшись Fedora Media Writer.

source: Known limitations
pt_br: Limitações conhecidas
uk: Відомі обмеження
zh_hans: 已知的限制条件

source: *{variant-name} does not provide a fully functional experience for dual booting or manual partitioning.*
uk: *У {variant-name} не передбачено повноцінної можливості паралельного використання різних систем на одному комп'ютері, а також поділу диска вручну.*
zh_hans: *在某种程度上，{variant-name} 并不真正支持双启动或手动分区。*

source: It is possible to make {variant-name} work for both dual boot and manual partitioning, and some guidance is provided on manual partitioning below. However, there are hazards involved in both cases, and you should only attempt to use these features if you have done the necessary research, and are confident that you can overcome any issues that you might encounter.
uk: Можна налаштувати систему так, щоб {variant-name} могла працювати паралельно із іншими системами на розподіленому вручну диску. Деякі поради щодо розподілу диску вручну наведено нижче. Втім, в обох випадках є певні ризики працездатності системи. Вам слід намагатися скористатися цими можливостями, лише якщо ви докладно вивчили питання і впевнені, що можете подолати усі проблеми, з якими ви можете зіткнутися.
zh_hans: 双启动和手动分区确实是可以实现的，下文也提供了手动分区的指引。然而，无论是双启动还是手动分区都可能带来不可预知的后果，特别是在 {variant-name}。只有做足了功课，并且确信自己能够克服可能遇到的一切问题，才应该尝试使用这些功能。

source: Getting {variant-name}
uk: Отримання {variant-name}
zh_hans: 获取 {variant-name}

source: If you are using Fedora Media Writer, {variant-name} should be listed as a download option. However, if it isn't, or if you want to download it manually, an install image can be downloaded from {website}[the main {variant-name} website].
uk: Якщо ви користуєтеся Fedora Media Writer, {variant-name} буде одним із варіантів отримання образів систем. Втім, якщо цього пункту немає або якщо ви хочете отримати образ вручну, ви можете отримати образ системи із {website}[головного сайта {variant-name}].
zh_hans: 如果你在使用 Fedora Media Writer，{variant-name} 应该作为一个下载选项被列出了。如果你没有看到此项，或者你希望手动下载安装介质，你可以前往 {website}[{variant-name} 主站点] 进行下载。

source: Once you have got your copy of {variant-name}, it can be installed in the usual manner. We hope that you love it!
uk: Щойно ви отримаєте вашу копію {variant-name}, систему можна буде встановити у звичний спосіб. Сподіваємося, система вам сподобається!
zh_hans: 当你获取了 {variant-name} 的安装介质，你就可以按照常规的方式安装 {variant-name} 了，我们希望你可以爱上它！

source: Manual Partitioning
pt_br: Particionamento manual
uk: Поділ диска вручну
zh_hans: 手动分区

source: As described above, there are known issues with manual partitioning on {variant-name}, and it should be used with caution. The following notes are intended as hints for those attempting it, and should not be treated as recommended practice. Automatic partitioning is recommended.
uk: Як ми вже писали вище, існують відомі проблеми із розподілом диска вручну для {variant-name}. Тому ділити диск вручну слід із осторогою. Наведені нижче зауваження є підказками щодо того, як слід ділити диск. Не слід їх сприймати як рекомендації до дії. Рекомендуємо скористатися автоматичним поділом на розділи.
zh_hans: 正如上面所说，通过手动分区的方式安装 {variant-name} 有不少的已知问题，建议谨慎使用。如果你执意手动分区，下面是一些小贴士，但不是推荐做法（唯一的推荐做法是自动分区）。

source: With {variant-name}, only certain mounts can be manually specified as partitions. These include:
uk: У {variant-name} як каталоги системи можна вказувати лише певні змонтовані розділи. Це зокрема:
zh_hans: 安装 {variant-name}，只有下面几个挂载点是可用的：

source: Subdirectories under `/var`, including:
pt_br: Subdiretórios sob `/var`, incluindo:
uk: Підкаталоги у каталозі `/var`, зокрема:
zh_hans: `/var` 下的子目录，包括：

source: `/var/home` ({variant-name} has a symlink from `/home` to `/var/home`)
uk: `/var/home` (у {variant-name} `/home` є символічним посиланням на `/var/home`)
zh_hans: `/var/home`（{variant-name} 将 `/home` 链接到了 `/var/home`）

source: The root filesystem: `/`
pt_br: O sistema de arquivos raiz: `/`
uk: Коренева файлова система: `/`
zh_hans: 根目录：`/`

source: The Fedora installer is not aware of these restrictions and will accept custom partitions without error, even if they are incompatible with {variant-name}.
uk: Програма для встановлення Fedora не зважає на ці обмеження — вона не повідомлятиме про помилки за будь-якого нетипового поділу на розділи, навіть якщо він є несумісним із {variant-name}.
zh_hans: Fedora 安装程序并不会理会这些限制，即使你的自定义分区设定和 {variant-name} 不兼容，Fedora 安装程序是不会报错的。

source: Partitioning Complete
pt_br: Particionamento completo
uk: Завершення поділу на розділи
zh_hans: 完成分区时的状态

source: The above screenshot shows a typical configuration with manual partitioning, with partitions for `/boot`, `/`, `swap` and `/var/home`.
pt_br: A imagem acima mostra uma configuração típica com particionamento manual, com partições para`/boot`, `/`, `swap` e `/var/home`.
uk: На наведеному вище знімку показано типову конфігурацію із поділом на диски вручну, де є розділи для `/boot`, `/`, `swap` та `/var/home`.
zh_hans: 以上是手动分区的典型实例，我们单独指定了 `/boot`、`/`、`swap` 和 `/var/home` 分区。

source: Manual partitioning on {variant-name} can be done with `Btrfs`, https://en.wikipedia.org/wiki/Logical_Volume_Manager_%28Linux%29[LVM], as well as standard partitions or an `xfs` filesystem.
uk: Поділ на розділи для {variant-name} можна виконати за допомогою `Btrfs`, https://en.wikipedia.org/wiki/Logical_Volume_Manager_%28Linux%29[LVM]. Також можна скористатися стандартними розділами або файловою системою `xfs`.
zh_hans: 在手动分区模式下，{variant-name} 支持 `Btrfs`、 https://en.wikipedia.org/wiki/Logical_Volume_Manager_%28Linux%29[LVM] 以及常规的 `xfs` 文件系统。

source: It is therefore recommended that you read this user guide before deciding to install {variant-name}. It is also recommended that you determine whether {variant-name} meets the specific needs or requirements that you might have. If you are uncertain about this, {variant-name} can also be tested in a virtual machine prior to installation.
zh_hans: 所以在安装 {variant-name} 前我们希望你可以认真阅读一下这份指南，考虑清楚 {variant-name} 是否与你目前的需求契合。如果你对此并不确定，你可以在虚拟机先对 {variant-name} 进行试用。

source: Installing Silverblue
pt_br: Instalando o Silverblue

source: Fedora Silverblue can be installed in the same way as Fedora Workstation, and the official Fedora installation guide can be followed for your Fedora version. See the https://docs.fedoraproject.org/en-US/docs/[Fedora documentation site] for more details.
pt_br: O Fedora Silverblue pode ser instalado da mesma forma que o Fedora Workstation, e o guia de instalação oficial do Fedora pode ser seguido para a sua versão do Fedora. Veja o https://docs.fedoraproject.org/pt_BR/docs/[site de documentação do Fedora] para mais detalhes.

source: Silverblue is intended to provide the full range of capabilities that you would expect from an installation of Fedora Workstation. However, there are some differences in terms of which applications can be installed, and how the operating system environment works.
pt_br: O Silverblue se destina a fornecer a gama completa de recursos que você esperaria de uma instalação do Fedora Workstation. No entanto, existem algumas diferenças em termos de quais aplicativos podem ser instalados e como funciona o ambiente do sistema operacional.

source: It is therefore recommended that you read this user guide before deciding to install Silverblue. It is also recommended that you determine whether Silverblue meets the specific needs or requirements that you might have. If you are uncertain about this, Silverblue can also be tested in a virtual machine prior to installation or booted from a flash drive using Fedora Media Writer.
pt_br: Portanto, é recomendável que você leia este guia do usuário antes de decidir instalar o Silverblue. Também é recomendável que você determine se o Silverblue atende às necessidades ou requisitos específicos que você possa ter. Se você não tiver certeza sobre isso, Silverblue também pode ser testado em uma máquina virtual antes da instalação ou inicializado a partir de uma unidade flash usando o Fedora Media Writer.

source: It is possible to make Silverblue work for both dual boot and manual partitioning, and some guidance is provided on manual partitioning below. However, there are hazards involved in both cases, and you should only attempt to use these features if you have done the necessary research, and are confident that you can overcome any issues that you might encounter.
pt_br: É possível fazer o Silverblue funcionar para dual boot e particionamento manual, e algumas orientações são fornecidas sobre o particionamento manual abaixo. No entanto, há riscos envolvidos em ambos os casos e você só deve tentar usar esses recursos se tiver feito a pesquisa necessária e estiver confiante de que pode superar quaisquer problemas que possa encontrar.

source: Getting Silverblue
pt_br: Obtendo o Silverblue

source: If you are using Fedora Media Writer, Silverblue should be listed as a download option. However, if it isn't, or if you want to download it manually, an install image can be downloaded from https://silverblue.fedoraproject.org/[the main Silverblue website].
pt_br: Se você estiver usando o Fedora Media Writer, o Silverblue deve estar listado como uma opção de download. No entanto, se não for, ou se você quiser baixá-lo manualmente, uma imagem de instalação pode ser baixada https://silverblue.fedoraproject.org/[no site principal do Silverblue].

source: Once you have got your copy of Silverblue, it can be installed in the usual manner. We hope that you love it!
pt_br: Depois de obter sua cópia do Silverblue, ela pode ser instalada da maneira usual. Esperamos que você ame!

source: As described above, there are known issues with manual partitioning on Silverblue, and it should be used with caution. The following notes are intended as hints for those attempting it, and should not be treated as recommended practice. Automatic partitioning is recommended.
pt_br: Conforme descrito acima, existem problemas conhecidos com o particionamento manual no Silverblue e deve ser usado com cuidado. As notas a seguir destinam-se a ser dicas para quem está tentando fazer isso e não devem ser tratadas como prática recomendada. O particionamento automático é recomendado.

source: `/var/home` (Silverblue has a symlink from `/home` to `/var/home`)
pt_br: `/var/home` (Silverblue tem um link simbólico de `/home` para `/var/home`)

source: The Fedora installer is not aware of these restrictions and will accept custom partitions without error, even if they are incompatible with Silverblue.
pt_br: O instalador do Fedora não está ciente dessas restrições e aceitará partições personalizadas sem erros, mesmo que sejam incompatíveis com o Silverblue.

source: Manual partitioning on Silverblue can be done with `Btrfs`, https://en.wikipedia.org/wiki/Logical_Volume_Manager_%28Linux%29[LVM], as well as standard partitions or an `xfs` filesystem.
pt_br: O particionamento manual no Silverblue pode ser feito com `Btrfs`, https://en.wikipedia.org/wiki/Logical_Volume_Manager_%28Linux%29[LVM], bem como partições padrão ou um sistema de arquivos `xfs`.
