Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/installation-dual-boot.po
Languages: uk

source: Installing Silverblue, side-by-side
uk: Паралельне встановлення Silverblue

source: WARNING: Some users have reported issues when trying to install Silverblue side-by-side. Please report any issues you may encounter on the https://discussion.fedoraproject.org/c/desktop/silverblue[Silverblue Forums].
uk: УВАГА: Деякі користувачі повідомляли про проблеми при спробах встановити Silverblue паралельно із іншими системами. Будь ласка, повідомляйте про проблеми, із якими ви зіткнулися на https://discussion.fedoraproject.org/c/desktop/silverblue[форумі Silverblue].

source: A really neat feature of OSTree is that you can parallel install _inside_ your existing OS' filesystem. Let's try that, we first make sure we have the ostree packages:
uk: Однією з чудових можливостей OSTree є те, що ви можете встановити систему _всередині_ вашої наявної файлової системи операційної системи. Спробуймо це. Спочатку, переконаймося, що у нас є усі пакунки ostree:

source: Before proceeding further, make sure that you have enough space in your root filesystem. The recommended minimum is 10GB (the Silverblue repo we are going to pull takes ~7GB on disk). Note that ostree will refuse to continue if you go below 3% of free space, so there's no risk of actually running out of space.
uk: Перш ніж виконувати інші дії, переконайтеся, що у кореневій файловій системі достатньо місця. Рекомендованим мінімумом є 10 ГБ (сховище пакунків Silverblue, яке ми маємо намір отримати, має розмір ~7 ГБ на диску). Зауважте, що ostree відмовиться продовжувати виконання дій, якщо у системі буде менше 3% вільного місця, щоб усунути ризик вичерпання місця на диску.

source: Next, we add /ostree/repo to the filesystem:
uk: Далі, слід додати /ostree/repo до файлової системи:

source: Add a remote which points to the Silverblue content:
uk: Додайте віддалене сховище, яке вказуватиме на дані Silverblue:

source: If you do not have the Fedora 29 GPG primary key, you can get it from https://getfedora.org/keys/. Alternatively, if you really need to, you can turn off GPG verification using the --no-gpg-verify option.
uk: Якщо у вас немає основного ключа GPG Fedora 29, ви можете отримати його з https://getfedora.org/keys/. Крім того, якщо ви цього справді хочете, ви можете вимкнути перевірку GPG за допомогою параметра --no-gpg-verify.

source: Pull down the content (you can interrupt and restart this):
uk: Отримайте дані (ви можете перервати і повторно запустити процес):

source: Initialize an OS for this, which acts as a state root.
uk: Для цього ініціалізуйте операційну систему, яка працюватиме як тимчасова коренева.

source: *For EFI systems:* currently ostree uses the presence of /boot/grub2/grub.cfg to detect a BIOS system, but that can be present on systems booted with EFI as well. If you boot with EFI (/sys/firmware/efi exists), then you need to move /boot/grub2/grub.cfg aside:
uk: *Для систем EFI:* у поточній версії ostree використано присутність /boot/grub2/grub.cfg для виявлення системи BIOS, але цей файл може існувати і у системах, яка завантажуються за допомогою EFI. Якщо завантаження відбувається за допомогою EFI (існує /sys/firmware/efi), вам слід пересунути /boot/grub2/grub.cfg деінде:

source: Since this file is not used on a EFI system, this won't break the operation of your current system. While you are at it, back up your existing grub config:
uk: Оскільки цей файл не використовується у системах EFI, це не призведе до пошкодження вашої поточної системи. Оскільки вже почали займатися цим, створімо резервну копію наявних налаштувань grub:

source: And now, we can deploy the commit we just pulled down. The --karg-proc-cmdline switch will ensure that the current kernel arguments you used for the current boot will also apply to the OSTree boot.
uk: А тепер, ми можемо розгорнути дані, які ми щойно отримали. Перемикач --karg-proc-cmdline командного рядка забезпечить застосування поточних параметрів ядра, якими ви користуєтеся у поточній системі, до завантаження OSTree.

source: To initialize this root, you'll need to copy over your /etc/fstab, /etc/locale.conf, /etc/default/grub at least, along with the ostree remote that we added:
uk: Щоб ініціалізувати цю кореневу систему, вам слід скопіювати принаймні ваші /etc/fstab, /etc/locale.conf, /etc/default/grub до системи ostree, яку ми додали:

source: where $checksum is whatever the checksum of the deployment is; there should only be a single directory there if this is your first deployment.
uk: де $checksum — контрольна сума системи для розгортання; має бути лише один каталог, якщо це розгортання системи є першим.

source: If you have a separate /home mount point, you'll need to change that fstab copy to refer to /var/home. If you don't have a separate /home mount point, then you need to make sure that a symlink will be created:
uk: Якщо у вас окрема точка монтування /home, вам слід змінити копію fstab так, щоб там було посилання на цю точку монтування як на /var/home. Якщо у вас немає окремої точки монтування /home, вам слід створити відповідне символічне посилання:

source: You'll also need to copy your user entry from /etc/passwd, /etc/group, and /etc/shadow into the new /etc/, and add yourself to the wheel group in /etc/group. Don't copy just copy these files literally, however, since the system users and groups won't be the same.
uk: Вам також слід скопіювати записи вашого користувача з /etc/passwd, /etc/group, та /etc/shadow до нової теки /etc/ і додати вашого користувача до групи wheel у /etc/group. Втім, простого копіювання цих файлів буде недостатньо, оскільки користувачі та групи у новій системі не є тотожними до старих записів.

source: *For BIOS systems:* while ostree regenerated the bootloader configuration, it writes config into /boot/loader/grub.cfg. On a current grubby system, you'll need to copy that version over:
uk: *Для систем з BIOS:* під час повторного створення налаштувань завантажувача в ostree, дані буде записано до /boot/loader/grub.cfg. У поточній версії системи вам доведеться перезаписати цю версію файла налаштувань:

source: Note that you will have to repeat this every time a new tree is created, so it may be more convenient to just create a symlink:
uk: Зауважте, що цю дію доведеться повторювати кожного разу при створенні нової ієрархії, тому, можливо, зручніше просто створити символічне посилання:
