Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/installation-guide.po
Languages: uk

source: Installing Silverblue
uk: Встановлення Silverblue

source: The preferred way to install Silverblue is with the Fedora MediaWriter application. See the https://silverblue.fedoraproject.org/download[Download] page for details on how to create a USB stick to install Silverblue.
uk: Рекомендованим способом встановлення Silverblue є використання програми Fedora MediaWriter. Див. сторінку https://silverblue.fedoraproject.org/download[отримання пакукнів], щоб дізнатися більше про те, як створити флешку USB для встановлення Silverblue.

source: _NOTE: The following instructions are written in detail, assuming that you have never installed Fedora before. If you have experience using or installing Fedora, you may be able to skip much of these instructions._
uk: _ПРИМІТКА: Наступні вказівки написані докладно, припускаючи, що ви ніколи не встановлювали Fedora раніше. Якщо у вас є досвід використання, або встановлення Fedora, можливо ви зможете пропустити більшу частину цих інструкцій._

source: [[before-you-begin]] Before You Begin
uk: [[before-you-begin]] Перш ніж ви почнете

source: Before you start the installation process, you should answer the following questions:
uk: Перш ніж ви розпочнете процедуру встановлення, вам слід відповісти на такі питання:

source: Do you want to retain any existing data on your system?
uk: Чи хочете ви зберегти наявні дані у вашій системі?

source: If yes, you should consider using the link:#manual-partition[manual partitioning] method during the install process.
uk: Якщо так, вам слід спробувати скористатися у процедурі встановлення способом link:#manual-partition[поділу диска на розділи вручну].

source: Alternatively, if your system has an existing Fedora install on it, you could use the xref:installing-silverblue-side-by-side[side-by-side] install method.
uk: Крім того, якщо у вашій системі є наявний екземпляр встановленої Fedora, ви можете скористатися xref:installing-silverblue-side-by-side[паралельним встановленням].

source: Do you want to do a fresh install and do not care about retaining any existing data on your system?
uk: Хочете встановити систему «з нуля» і не переймаєтеся збереженням наявних даних у вашій системі?

source: If yes, you should consider using the link:#automatic-partition[automatic partitioning] method during the install process. This is the easiest way to get Silverblue installed on your system.
uk: Якщо так, вам варто скористатися способом link:#automatic-partition[автоматичного поділу диска на розділи] під час процедури встановлення. Це найпростіший спосіб встановити Silverblue у вашій системі.

source: You may still use the link:#manual-partition[manual partitioning] method during the install process, but it will require some additional steps.
uk: Ви можете скористатися і способом link:#manual-partition[поділу диска на розділи вручну] під час процедури встановлення, але тоді доведеться виконати додаткові кроки.

source: Starting the Install
uk: Починаємо встановлення

source: After you have successfully created your USB stick, you'll need to boot your system from the USB stick. Depending on your system, you might get lucky and it will boot from USB automatically. Otherwise, you'll need to figure out how to access the boot menu of your system's BIOS/UEFI and select the USB stick as the boot device.
uk: Після того, як ви успішно створили USB-накопичувач, вам потрібно буде завантажити систему з USB-накопичувача. Залежно від вашої системи, вам можливо пощастить і вона завантажиться з USB автоматично. В іншому випадку, вам буде потрібно з'ясовувати, як отримати доступ до меню завантаження BIOS/UEFI вашої системи та вибрати USB-накопичувач, як завантажувальний пристрій.

source: You should see a Fedora 28 installation screen that is identical to the Fedora 28 Workstation installer:
uk: Ви повинні побачити екран встановлення Fedora 28, ідентичний встановлювачу Fedora 28 Workstation:

source: Fedora 28 Installer Menu
uk: Меню засобу встановлення Fedora 28

source: From this menu, you can choose to test the media to ensure that the USB stick was created successfully. Or launch right into the installer if you are feeling confident. For the purposes of this guide, we know our USB stick is working properly, so we'll start the installer. You may see some messages fly past your screen that look like this:
uk: З цього меню, ви можете обрати перевірку носія, щоб переконатися, що USB-накопичувач, був створений успішно. Або запускайте встановлювач, якщо відчуваєте себе впевнено. З цього посібника ми знаємо, що USB-накопичувач працює належним чином, тому ми запустимо встановлювач. Можливо, ви побачите, що деякі повідомлення пролітають повз ваш екран, та виглядають приблизно так:

source: Fedora Installer Services Output
uk: Дані, які виведено службами встановлення Fedora

source: Eventually, the graphical installer should start and you'll be presented with the options to select the language you wish to use during the install:
uk: Нарешті, має запуститися графічний засіб встановлення, який покаже вам вікно вибору мови, яку ви хочете використовувати в інтерфейсі програм під час встановлення:

source: Fedora Installer Language Selection
uk: Вибір мови у засобі встановлення Fedora

source: After selecting your language, the next screen of the installer allows us to make additional selections regarding the installer. We can configure the keyboard layout, installed language support, date and time, networking, and partitioning. In this guide we are only going to focus on the partitioning because of certain restrictions in this area when using Silverblue. However, if you have questions about some of the options of this part (or any part) of the installer, you can consult the https://docs.fedoraproject.org/f28/install-guide/install/Installing_Using_Anaconda.html[Fedora Installation Guide].
uk: Після вибору мови у наступному вікні засобу встановлення ви можете вибрати додаткові параметри роботи майбутньої системи. Можна визначитися із розкладкою клавіатури, встановленою підтримкою мов, датою і часом, параметрів роботи мережі та поділу диска на розділи. У цьому підручнику ми зосередимося лише на поділі диска на розділи, оскільки встановлення Silverblue накладає певні обмеження на такий поділ. Втім, якщо у вас є якісь питання щодо параметрів цієї частини процедури встановлення, ви можете звернутися до https://docs.fedoraproject.org/f28/install-guide/install/Installing_Using_Anaconda.html[Підручника зі встановлення Fedora].

source: On this screen, you should notice that there is a warning on the bottom of the screen that says you need to complete the items marked with the warning icon before we can begin the actual install. Additionally, the 'Begin Installation' button is greyed out. The item that needs to be completed is the partitioning and we can start that process by selecting the "Installation Destination" item with the warning icon next to it:
uk: На цій сторінці ви маєте побачити попередження у нижній частині екрана, у якому вам повідомлять, що вам слід визначитися з пунктами, які позначено піктограмою попередження, перш ніж ви зможете продовжити встановлення системи. Крім того, кнопку «Почати встановлення» буде показано сірим кольором. Пунктом, з якими потрібно визначитися, є поділ на розділи, і ми можемо почати процедуру встановлення потрібних параметрів, натиснувши пункт «Призначення встановлення», який позначено піктограмою попередження:

source: Fedora Installtion Summary
uk: Резюме щодо встановлення Fedora

source: After choosing the "Installation Destination", you are brought to a screen where you have to decide if you want to use automatic partitioning or manual partitioning. If you have existing data on your disk and want to preserve it, you'll want to link:#manual-partition[manually partition] your disk(s). However, if you are comfortable with losing any and all existing data on your disk(s), you can choose link:#automatic-partition[automatic partitioning]:
uk: Після вибору «Призначення встановлення» ви перейдете до сторінки, де ви маєте вирішити, слід виконати поділ диска в автоматичному режимі чи диск слід поділити вручну. Якщо на вашому диску вже зберігаються якісь дані, і ви хочете їх зберегти, вам слід вибрати link:#manual-partition[поділ вручну]. Втім, якщо ви не переймаєтеся долею наявних даних на дисках комп'ютера, ви можете вибрати link:#automatic-partition[автоматичний поділ на розділи]:

source: Fedora Installation Destination
uk: Призначення встановлення Fedora

source: Automatic Partitioning
uk: Автоматичний поділ на розділи

source: If you choose automatic partitioning, your job is almost done. Select the disk you want to install onto (in this guide we have only a single disk). Check the radio button that says 'Automatic' and click the big blue button at the top that says 'Done'.
uk: Якщо вами було вибрано автоматичний поділ на розділи, ваше завдання майже виконано. Виберіть диск, на який ви хочете встановити систему (у цьому підручнику ми розглядатимемо випадок одного диска). Позначте варіант «Автоматично» і натисніть велику синю кнопку у верхній частині вікна, на якій написано «Виконано».

source: If your disk already has partitions on it, you'll be presented with a dialog to 'reclaim' space. This means you are going choose which partitions can be deleted, so that the disk can be re-partitioned from scratch.
uk: Якщо на диску вже є розділи, програма покаже вам діалогове вікно із пропозицією перерозподілити диск. Це означає, що ви зможете вказати розділи, які можна вилучити, отже, поділ диска можна буде розпочати спочатку.

source: Reclaim Disks Dialog
uk: Діалогове вікно перерозподілу диска

source: In this guide, we are going to delete all the existing partitions so that we can use the entirety of the disk for the install. This is easily done with the aptly named 'Delete All' button.
uk: У цьому підручнику ми маємо намір вилучити усі наявні розділи, щоб отримати доступ до усього місця на диску для встановлення системи. Досягти потрібного нам результату можна натисканням кнопки «Вилучити все».

source: Delete All Partitions
uk: Вилучення усіх розділів

source: And then confirm that you are going to delete all the partitions by clicking the 'Reclaim space' button:
uk: Далі, слід підтвердити свій намір вилучити усі розділи натисканням кнопки «Отримати місце»:

source: Confirming Delete All Partitions
uk: Підтвердження вилучення усіх розділів

source: With your partitioning choice complete, the installer brings you back to the installation summary screen and the big blue 'Begin Installation' button is beckoning you to click it. Once you click the button, your disk(s) will be altered and all data on the disk(s) will be lost.
uk: Після визначення способу поділу диска засіб встановлення поверне вас до вікна резюме встановлення, де запропонує вам натиснути кнопку «Почати встановлення». Щойно ви натиснете цю кнопку, програма почне вносити зміни до вмісту диска, а усі дані, що зберігаються на поточних його розділах, буде втрачено.

source: Ready to Begin Installation
uk: Усе готово до початку встановлення

source: Once you have started the install process, you can move on to the next phase where you will link:#user-config[configure users].
uk: Далі, у процесі встановлення системи ви перейдете до наступної фази, на якій вам буде запропоновано link:#user-config[налаштувати користувачів].

source: Manual Partitioning
uk: Поділ диска вручну

source: When choosing to manually partition your system, you need to be aware of certain restrictions specific to Silverblue. Due to how the operating system and filesystem are managed via libostree, only certain mount points can be created during the install process. These mount points are limited to `/boot`, `/var`, subdirectories under `/var`, and the root filesystem.
uk: Якщо ви виберете поділ диска на розділи вручну, вам слід мати на увазі певні специфічні для Silverblue обмеження. Через спосіб, у який операційна система та файлова система керуються за допомогою libostree, під час процедури встановлення можна створювати лише певні точки монтування. Перелік цих точок монтування обмежено `/boot`, `/var`, підкаталогами у `/var` та кореневою файловою системою.

source: Unfortunately, the installer (which is shared with vanilla Fedora Workstation) is not aware of these restrictions specific to Silverblue and will happily accept your custom partitions without error. Only when you try to boot your system will you be made aware that you have made a mistake.
uk: На жаль, у засобі встановлення (який є спільним із типовою Fedora Workstation) не передбачено врахування специфічних для Silverblue обмежень, тому він без проблем прийме дані щодо нетипового поділу диска і не повідомлятиме ні про які помилки. Лише після спроби завантажити вашу систему ви дізнаєтеся, що припустилися помилки.

source: With those restrictions in mind, let's try to manually partition our system. The first screen you'll see is the "Installation Destination" screen. From here, you can select which disk(s) to use for the install and choose the partitioning method. For this guide, we only have a single disk, but you might have more than one disk in your system. In order to select the manual parition method, click the radio button labeled "Custom".
uk: Беручи до уваги обмеження, давайте спробуємо поділити диск для нашої системи вручну. Першою сторінкою, яку вам буде показано, є сторінка «Призначення встановлення». На ній ви зможете вибрати, якими дисками слід скористатися для встановлення і визначити метод встановлення. У нашому прикладі маємо лише один диск, але у вашій системи може бути декілька дисків. Щоб вибрати метод поділу вручну, виберіть варіант «Нетиповий».

source: Selecting Custom Partitioning
uk: Вибір нетипового поділу на розділи

source: This will launch you into the "Manual Partioning" screen, which gives you a minimal overview of the existing storage configuration. In order to see all of the partitions on your disk, you should click the arrow next to the "Unknown" disk.
uk: У відповідь буде відкрито вікно «Поділ диска вручну», у якому вам буде показано мінімальний огляд наявної конфігурації пристроїв для зберігання даних. Щоб переглянути усі розділи на вашому диску, вам слід натиснути кнопку зі стрілочкою, розташовану поряд із «Невідомим» диском.

source: Viewing Existing Partitions
uk: Перегляд наявних розділів

source: Now we can see that we have three existing partitions on the disk: two `ext4` partitions and a swap partition. At this point, you should (hopefully!) be able to recognize your existing partitions and make sure they remain intact if you wanted to keep the existing data on your disk. But for this guide, we do not want to preserve any data, so we are going to start deleting all of our existing partitions to start fresh. We start by selecting the first `ext4` partition in the list labeled "fedora-root". Then we click the button that looks like a dash ("-") to mark the partition to be delete. This brings up a prompt asking you to confirm that you want to delete the partition.
uk: Тепер ми бачимо на диску три наявних розділи: два розділи `ext4` і розділ резервної пам'яті. На цьому етапі ви маєте (сподіваємося!) змогу розпізнати ваші наявні розділи і переконатися, що вони залишаться неушкодженими, якщо ви хочете зберегти наявні дані на вашому диску. Втім, у цьому прикладі ми не будемо зберігати дані, тому маємо вилучити усі наявні розділи, щоб розпочати усе на порожньому місці. Ми почнемо із позначення першого розділу `ext4` із міткою «fedora-root». Далі, натиснемо кнопку, яка виглядає як символ мінуса («-»), щоб позначити розділ до вилучення. У відповідь програма покаже контекстне вікно, у якому попросить вас підтвердити вилучення розділу.

source: Confirm Deletion of Partition
uk: Підтвердження вилучення розділу

source: Repeat this process for all the partitions that you want to delete. In this guide, we have removed all the paritions from the system and have a blank disk to work with.
uk: Повторимо цю процедуру для усіх розділів, які слід вилучити. У цьому приклад ми вилучили усі розділи з системи і лишили диск порожнім для подальшої роботи.

source: All Partitions Removed
uk: Усі розділи вилучено

source: We'll create our first partition by clicking on the button that looks like a plus sign ("+"). This first partition will be our `/boot` where critical pieces of software required to boot your system (like the `initramfs` and `vmlinuz` executable). It doesn't need to be very large, so we set the size for 500M.
uk: Ми створимо наш перший розділ натисканням кнопки, яка виглядає як символ плюс («+»). Цей перший розділ буде нашим `/boot`, на ньому зберігатиметься програмне забезпечення, яке потрібне для завантаження системи (зокрема виконувані файли `initramfs` і `vmlinuz`). Розділ не повинен бути аж надто великим, тому встановімо для нього розмір у 500 МБ.

source: Creating the /boot Partition
uk: Створення розділу /boot

source: The only other partition we absolutely need in order for the system to install successfully is the root partition ("/"). But we have the flexibility to create additional partitions that can include `/var` and subdirectories under `/var`. For the purposes of this guide, we'll create a `/var/home` which is where all the user's home directories live. (There is a symlink from `/home` to `/var/home` on Silverblue systems.)
uk: Єдиним іншим розділом, який абсолютно потрібен для успішного встановлення системи є кореневий розділ («/»). Втім, ми маємо змогу створити додаткові розділи, серед яких `/var` та підкаталоги у `/var`. Для цього підручника ми створимо `/var/home` — там зберігатимуться усі домашні каталоги користувачів. (У системах Silverblue передбачено символічне посилання з `/home` на `/var/home`.)

source: Creating /var/home Partition
uk: Створення розділу /var/home

source: You can create additional parititions such as `/var/log` or `/var/lib/containers`, but for this guide, we will move on to creating the root partition. We'll finish this part of the install process by creating the root partition for our system. We can leave the size field blank during this step and the installer will automatically use the remaining free space on the disk for the partition.
uk: Ви можете створити додаткові розділи, зокрема `/var/log` або `/var/lib/containers`, але у цьому підручнику ми одразу перейдемо до створення кореневого розділу. Завершимо цю частину процедури встановлення на створенні кореневого розділу для вашої системи. Ми можемо не заповнювати поле розміру на цьому кроці — засіб встановлення використає усе вільне місце на диску для цього розділу.

source: Creating Root Partition
uk: Створення кореневого розділу

source: With all the partitions created, we can inspect the final configuration before proceeding. It's worth noting here that the default partitioning scheme uses https://en.wikipedia.org/wiki/Logical_Volume_Manager_%28Linux%29[LVM] as the default partitioning scheme with an `ext4` filesystem. You can change this during this partitioning phase to use standard partitions or an `xfs` filesystem, but that is outside the scope of this guide.
uk: Коли буде створено усі розділи, ми можемо ознайомитися із остаточною конфігурацією, перш ніж продовжувати процедуру встановлення. Тут варто зауважити, що у типовій схемі поділу диска використовується https://en.wikipedia.org/wiki/Logical_Volume_Manager_%28Linux%29[LVM] із файловою системою `ext4`. Ви можете змінити це під час кроку поділу на розділи так, щоб використовувалися стандартні розділи або файлова система `xfs`, але у цьому підручнику ми не розглядатимемо питання вибору файлових систем.

source: Partitioning Complete
uk: Завершення поділу на розділи

source: After confirming your partitioning choices by clicking the big, blue "Done" button at the top of the screen, you are brought back to the "Installation Summary" screen. Here you have a chance to inspect your choices one last time before starting the actual installation proper. Once you click the big, blue "Begin Installation" button, your disk(s) will be altered and any data on them may be lost forever.
uk: Після підтвердження вашого варіанта поділу диска на розділи натисканням великої синьої кнопки «Готово» у верхній частині вікна ви повернетеся до вікна «Резюме щодо встановлення». За допомогою цього вікна ви матимете змогу ще раз оцінити вибрані параметри встановлення, перш ніж буде розпочато саму процедуру встановлення. Щойно ви натиснете велику синю кнопку «Почати встановлення», програми почнуть вносити зміни до дисків комп'ютера, і усі дані на них може бути втрачено назавжди.

source: Once you have started the installer, you can move on to the link:#user-config[User Configuration] section of this guide.
uk: Після запуску засобу встановлення ви можете перейти до розділу link:#user-config[Налаштування записів користувачів] цього підручника.

source: User Configuration
uk: Налаштування записів користувачів

source: As the installer churns away, you are presented with a screen where you can configure the root password and create one or more regular users:
uk: Доки засоби встановлення виконує роботу, основна програма встановлення запропонує вам вікно, за допомогою якого ви зможете налаштувати пароль адміністратора (root) і створити один або декілька записів звичайних користувачів:

source: Configuring Users
uk: Налаштовування записів користувачів

source: Firstly, let's configure a root password. Be sure to choose a safe and strong password that contains a mix of upper and lower case characters, numbers, and symbols. The installer has a nice indicator during this root password process that estimates the strength of your password; aim for creating a password that is "Strong":
uk: Спочатку, налаштуймо пароль root. Переконайтеся, що використано безпечний і складний пароль, який складається із суміші літер верхнього і нижнього регістрів, цифр і спеціальних символів. У засобі встановлення передбачено чудовий індикатор, який оцінює складність пароля, за допомогою якого ви можете створити справді складний для зламу пароль:

source: Choosing a Strong Root Password
uk: Вибір складного пароля root

source: Then we can create a normal, unprivileged user which we will use as our day to day login. The same suggestions about creating a password for this user applies. Additionally, we can choose to make the user an administrator on the system, which grants the username the ability to use the `sudo` command to elevate their privileges:
uk: Далі, ми можемо створити запис звичайного, непривілейованого користувача, яким користуватимемося для щоденної роботи. Пароля для облікового запису такого користувача стосуються ті самі поради, які ми давали для пароля користувача root. Крім того, ми можемо зробити нашого користувача адміністратором системи, що надасть йому змогу користуватися командою `sudo` для розширення прав доступу у системі:

source: Creating an Unprivileged User
uk: Створення непривілейованого користувача

source: Once we have the root password configured and an unprivileged user configured, we just sit back and wait for the installer to complete:
uk: Після визначення пароля root і створення облікового запису непривілейованого користувача ми можемо розслабитися і зачекати на завершення роботи засобу встановлення:

source: Waiting for the Installer to Complete
uk: Очікування на завершення роботи засобу встановлення
