Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/installation-guide.po
Languages: uk

source: Eventually, the installer will finish and you will be presented with a big, blue button that says 'Reboot'. This will (obviously) reboot your system and you'll be able to login to your Silverblue installation for the first time!
uk: Нарешті, засіб встановлення завершить свою роботу, і буде показано велику синю кнопку із написом «Перезавантажити». Натискання цієї кнопки (очевидно) призведе до перезавантаження системи у процесі якого ви зможете вперше увійти до вашої нововстановленої системи Silverblue!
