Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/reading-and-resources.po
Languages: pt_br, uk, zh_hans

source: Reading & Resources
pt_br: Leitura & recursos
uk: Відомості і ресурси
zh_hans: 实用文档和资源

source: This page is a list of further reading and resources for Silverblue.
uk: На цій сторінці наведено список текстових ресурсів щодо Silverblue.

source: Technology websites and documentation
pt_br: Sites e documentação de tecnologias
uk: Сайти і документація щодо технології
zh_hans: 技术型站点与文档

source: https://buildah.io/[Buildah] - build OCI container images
pt_br: https://buildah.io/[Buildah] - compila imagens de contêiner OCI
uk: https://buildah.io/[Buildah] — збирання образів контейнерів OCI
zh_hans: https://buildah.io/[Buildah] - 构建 OCI 容器映像

source: http://flatpak.org[Flatpak] - next-generation desktop app framework
pt_br: http://flatpak.org[Flatpak] - framework de última geração para aplicativos de desktop
uk: http://flatpak.org[Flatpak] — комплекс роботи із програмами для робочих станцій наступного покоління
zh_hans: http://flatpak.org[Flatpak] - 下一代的桌面应用程序框架

source: https://ostree.readthedocs.io/en/latest/[ostree] - OS image composition and updates
uk: https://ostree.readthedocs.io/en/latest/[ostree] — компонування та оновлення образів операційних систем

source: https://podman.io/[podman] - daemonless container engine
pt_br: https://podman.io/[podman] - mecanismo de contêiner sem daemon
uk: https://podman.io/[podman] — рушій для роботи із контейнерами без фонових служб
zh_hans: https://podman.io/[podman] - 无守护进程的容器引擎

source: https://rpm-ostree.readthedocs.io/en/latest/[rpm-ostree] - hybrid image/package system
uk: https://rpm-ostree.readthedocs.io/en/latest/[rpm-ostree] — гібридна система образів і пакунків

source: Documents
pt_br: Documentos
uk: Документи
zh_hans: 文档

source: link:{attachmentsdir}/team-silverblue-origins.pdf[Team Silverblue - The Origins] - PDF that explains the motivations, goals, and history behind Silverblue
pt_br: link:{attachmentsdir}/team-silverblue-origins.pdf[Team Silverblue - The Origins] - PDF que explica as motivações, objetivos e história por trás do Silverblue
uk: link:{attachmentsdir}/team-silverblue-origins.pdf[Команда Silverblue — Початок] — PDF із поясненнями щодо причин виникнення, мети та історії проєкту Silverblue
zh_hans: link:{attachmentsdir}/team-silverblue-origins.pdf[Team Silverblue - 起源] - 介绍 Silverblue 初心、目标和历史的 PDF 文档

source: link:{attachmentsdir}/flatpak-print-cheatsheet.pdf[Flatpak Cheat Sheet] - PDF with common flatpak commands
pt_br: link:{attachmentsdir}/flatpak-print-cheatsheet.pdf[Flatpak Cheat Sheet] - PDF com comandos flatpak comuns
uk: link:{attachmentsdir}/flatpak-print-cheatsheet.pdf[Шпаргалка для Flatpak] — PDF із типовими командами flatpak
zh_hans: link:{attachmentsdir}/flatpak-print-cheatsheet.pdf[Flatpak 指令速查表] - 介绍常见 Flatpak 命令的 PDF 文档

source: link:{attachmentsdir}/silverblue-cheatsheet.pdf[rpm-ostree Cheat Sheet] - PDF with common rpm-ostree commands
pt_br: link:{attachmentsdir}/silverblue-cheatsheet.pdf[rpm-ostree Cheat Sheet] - PDF com comandos rpm-ostree comuns
uk: link:{attachmentsdir}/silverblue-cheatsheet.pdf[Шпаргалка для rpm-ostree] — PDF із типовими командами rpm-ostree
zh_hans: link:{attachmentsdir}/silverblue-cheatsheet.pdf[rpm-ostree 指令速查表] - 介绍常见 rpm-ostree 命令的 PDF 文档

source: link:{attachmentsdir}/container-commandos.pdf[Container commandos] - a playful introduction to tools such as podman, cri-o and buildah by Máirín Duffy and Dan Walsh. Print it out, and learn as you color!
pt_br: link:{attachmentsdir}/container-commandos.pdf[Container commandos] - uma introdução lúdica a ferramentas como podman, cri-o e buildah, de Máirín Duffy e Dan Walsh. Imprima e aprenda enquanto você pinta!
uk: link:{attachmentsdir}/container-commandos.pdf[Команди контейнерів] — книжка-розмальовка команд контейнерів є грайливим вступом до вивчення інструментів podman, cri-o та buildah, яку було створено Мареїн Даффі та Деном Волшем. Надрукуйте книжку і навчайтеся, розфарбовуючи її!
zh_hans: link:{attachmentsdir}/container-commandos.pdf[Container commandos] - Máirín Duffy 和 Dan Walsh 编著的 podman、cri-o 和 buildah 涂画书。打印下来，然后愉快地玩耍吧！

source: https://ostreedev.github.io/ostree/[ostree] - OS image composition and updates
pt_br: https://ostreedev.github.io/ostree/[ostree] - composição e atualizações de imagem de sistema operacional
zh_hans: https://ostreedev.github.io/ostree/[ostree] - 系统映像构建与更新

source: https://coreos.github.io/rpm-ostree/[rpm-ostree] - hybrid image/package system
pt_br: https://coreos.github.io/rpm-ostree/[rpm-ostree] - sistema híbrido imagem/pacote
zh_hans: https://coreos.github.io/rpm-ostree/[rpm-ostree] - 混合式映像/软件包系统
