Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/silverblue-guide.po
Languages: uk

source: Silverblue User Guide
uk: Підручник користувача Silverblue

source: This Document is a work in progress. It aims to help with the daily use of Silverblue as a Workstation solution.
uk: Роботу над цим документом ще не завершено. Він має допомогти у рутинному користуванні Silverblue на звичайній робочій станції.

source: Help Wanted!
uk: Нам потрібна ваша допомога!

source: If you would like to help this document become better, and have some ideas on how, please message me at
uk: Якщо ви хочете допомогти із поліпшенням цього документа і маєте якісь ідеї з приводу того, як це зробити, будь ласка, повідомте про це автору документа за адресою

source: Document Conventions
uk: Угоди щодо документування

source: This document will show Notes, Tip's, Information, Cautions, and Warnings as follows
uk: У цьому документі показано нотатки, підказки, інформацію, попередження і зауваження ось так:

source: This is a note to show how this note would be displayed.
uk: Це нотатка для показу того, як має бути показано нотатку.

source: This is a tip, perhaps one you didn't know.
uk: Це підказка — ймовірно, ви цього не знали.

source: This is something important on the topic.
uk: Це щось важливе з поточної теми.

source: Cautionary note!
uk: Попередження!

source: This is a warning as it would appear!
uk: Ось так буде показано зауваження!

source: Whenever a terminal issued command is used it will appear like so `~]$ command`, and any other form of coding listed in the document will take the form of `for config (~/.zsh/*.zsh) source $config` without the leading `~]$`.
uk: Кожного разу, коли використовуватиметься видана у терміналі команда, її буде показано як `~]$ команда`, і усі інші форми коду, які буде використано у цьому документі, буде показано у формі `for config (~/.zsh/*.zsh) source $config` без початкового `~]$`.

source: Introduction
uk: Вступ

source: Daily use of Fedora Silverblue as an acceptable workstation is not so easy as its wonderfully seamless installation process would belie. Independence of the OS and the Apps, with respect to updates/upgrades is a benefit to stability and security. The benefits and pitfalls can come to the forefront when pushing the use case. Which currently doesn't seem to need much of a push. The writing of this document is being done using Atom as a flatpak on Fedora Silverblue 29. Atom comes with a plethora of plugins called packages, that can be of immense use for document creation and editing. Things like linters for various writing foibles. One such is Proselint, for which there is a Package in Atom. Proselint is useful to help with your writing clarity. The Proselint Package installs fine in the Atom flatpak being used on Silverblue, but gives an error about not finding proselint. Of course, proselint needs to be installed, and can be via rpm-ostree with the command `~]$ rpm-ostree install proselint`, followed by the command `~]$ systemctl reboot` to boot into the new image. Once back up and logged in, run proselint in the terminal on the file with the expected results, yet Atom still does not find proselint when the Proselint package tool is run. For now, the Proselint Package in Atom is disabled and the solution is to use the command line `~]$ proselint <filename>` to check the file in a terminal. This does point to a type of issue faced in using Fedora Silverblue as a daily workstation, flatpak app and host apps interaction, specifically there normally is none. Do I submit a bug to Silveblue? Atom? the Proselint Atom Package support? Is it a bug in the first place, and not just that my way of thinking about a workstation is in need of revision? As this example has shown, the immediate solution to the problem was to use a layered application in a terminal to check the file that is saved by the Atom flatpak. That isn't the satisfactory one though, and it doesn't make for the kind of user experience that has come to be expected.
uk: Щоденне використання Fedora Silverblue як основи звичайної робочої станції не є таким простим, як її надзвичайно легкий процес встановлення. Незалежність системи від програм є перевагою, якщо йдеться про стабільність і безпеку. Втім, переваги пов'язано із певними недоліками у реальних випадках використання. У поточному стані довго шукати недоліки не доведеться. Цей документ було написано за допомогою Atom, встановленого з flatpak у Fedora Silverblue 29. Atom має доволі багато додатків, які називають пакунками і які можуть стати у пригоді при створенні і редагуванні документів. Це зокрема засоби перевірки для виявлення різноманітних недоліків. Одним із таких засобів є Proselint, у якого є власний пакунок для Atom. Proselint корисний для збереження ясності викладу. Пакунок Proselint встановлюється без проблем до flatpak Atom, який використовується у Silverblue, але повідомляє про помилку — не вдається знайти proselint. Звичайно ж, має бути встановлено proselint, і це можна зробити за допомогою rpm-ostree і команди`~]$ rpm-ostree install proselint`, з наступною командою `~]$ systemctl reboot` для завантаження нового образу. Після завершення процедури резервного копіювання та входу до системи proselint можна запустити у терміналі для обробки файла із очікуваними результатами, але Atom все одно не може знайти proselint при запуску пакунка Proselint. У поточній версії пакунок Proselint у Atom вимкнено — доводиться користуватися командним рядком `~]$ proselint <назва_файла>` для перевірки файла у терміналі. Усе це є проявом типу проблем, з якими можна зіткнутися при користуванні Fedora Silverblue у щоденній роботі — взаємодія програми flatpak та програм основної системи, якої зазвичай взагалі не існує. Чи слід повідомляти про ваду у Silveblue? Atom? підтримці пакунка Proselint у Atom? Чи це взагалі вада, а не проста невідповідність побажань користувача і способу роботи системи, яка потребує коригування у способі мислення? Як показує цей приклад, простим рішенням є використання нашарованої програми у терміналі для виконання перевірки файла, який було збережено програмою Atom з пакунка flatpak. Втім, це рішення є неоптимальним — це не те, що хотів би робити звичайний користувач.

source: Installing Fedora Silverblue
uk: Встановлення Fedora Silverblue

source: The installation instructions for Silverblue can be found https://docs.fedoraproject.org/en-US/fedora-silverblue/installation-guide/[here] and are thorough, with links there to the Fedora Installation Guide as well as some other sources of reference material for Silverblue. While it is detailed and easy to follow, like many installation documents, doesn't fill in answers a user may have pre-installation.
uk: Настанови щодо встановлення Silverblue можна знайти https://docs.fedoraproject.org/en-US/fedora-silverblue/installation-guide/[тут]. Ці настанови є повними, із посиланнями на «Настанови щодо встановлення Fedora», там наведено інші джерела довідкового матеріалу з Silverblue. Хоча ці настанови є докладними і простими для виконання, подібно до інших документів, у них не дано відповіді на питання, які можуть виникнути у користувачів до встановлення.

source: Layering
uk: Нашаровування

source: In the issue noted in the Introduction, the package Proselint was layered onto the rpm-ostree to solve the lacking proselint executable. If you have a preferred terminal to use, it should be layered too.
uk: У випадку, який було використано у «Вступі», пакунок Proselint було нашаровано на rpm-ostree для вирішення нестачі виконуваного файла proselint. Якщо у вас є бажаний термінал, яким ви хочете користуватися, його також слід нашарувати.

source: Answers to such questions as, Do I want to encrypt my storage media? Am I going to use the standard RXVT terminal or do I want TMUX and Terminator, or just Terminator, and how does it need to be set up? These are only a basic selection of the many potential questions that may plague a user intending on using Fedora Silverblue as their daily workstation, and we haven't even contemplated the immutable OS much yet. Each use case draws its own set of questions needing answers to facilitate a successful installation. Throughout, and integral to these many faceted usage environments, are the individual tasks all of us users do to set up our computing environment to suit our use case needs. These tasks are the procedure we follow, whether recorded for reference or not, each time we go through the process of setting up our workstation's. Some, as indicated https://discussion.fedoraproject.org/t/how-i-automated-my-fedora-workstation-with-modular-ansible-roles/579/4[here] in a discussion at fedoraproject.org have automated their workstation setup, in this case using Ansible Roles. Then there are a couple of examples of using github to have a repo for a convenient way of being able to setup/reset a system to a known state. At a discussion about suggested approaches to correctly setup Silverblue https://discussion.fedoraproject.org/t/what-is-the-suggested-approach-es-to-correctly-set-up-a-silverblue-workstation/432[here] examples of that were offered as potential answers.
uk: Відповіді на такі питання, як «Чи варто шифрувати дані на пристрої для зберігання даних?», «Слід користуватися стандартним терміналом RXVT, чи TMUX і Terminator, чи просто Terminator, і як слід усе налаштувати?» Це лише декілька з багатьох потенційних питань, які можуть турбувати користувача, який має намір використовувати Fedora Silverblue як середовище для щоденної роботи — і це ми ще не заглиблювалися у тонкощі роботи незмінної операційної системи. Кожен підхід до користування пов'язано із власним набором питань, які мають полегшити успішне встановлення. Над цим, об'єднуючи усі ці окремі середовища користування системою, є окремі завдання, які ми всі, як користувачі, виконуємо в обчислювальному середовищі для пристосування його до наших потреб. Ці завдання є процедурою, яку ми виконуємо, записано її з довідковою метою чи ні, кожного разу, коли налаштовуємо нашу робочу станцію. Дехто, як зазначається https://discussion.fedoraproject.org/t/how-i-automated-my-fedora-workstation-with-modular-ansible-roles/579/4[тут] в обговоренні на fedoraproject.org, автоматизують налаштовування своєї робочої станції, наприклад, за допомогою ролей Ansible. Далі, є декілька прикладів використання github для зберігання даних для налаштовування системи або відновлення відомого стану системи. В обговоренні щодо запропонованих підходів до належного налаштовування Silverblue https://discussion.fedoraproject.org/t/what-is-the-suggested-approach-es-to-correctly-set-up-a-silverblue-workstation/432[тут] можна знайти приклади відповідей на потенційні питання.

source: Automatic Partitioning
uk: Автоматичний поділ на розділи

source: Manual Partitioning
uk: Поділ диска вручну

source: Installing Side by Side with an Existing System
uk: Встановлення паралельно із наявною системою

source: First Login
uk: Перший вхід до системи

source: Lay of the Land
uk: Накладання суті

source: Containers vs Flatpak vs Package Layering
uk: Контейнери, Flatpak і нашаровування пакунків

source: Through the course of using Silverblue daily, it has become apparent that an orchestration of all three technologies is what occurs in fact. There are times when a Container will provide the flexibility required that a Flatpak cannot, Layering can sometimes be the only answer to a problem, and Flatpaks in general work fine as they are intended. This is very likely echoed elsewhere throughout any community of users of an OSTree type of OS, whether Silverblue or others that use libostree. To successfully navigate this terrain it's good to be up on all things rpm-ostree, all things flatpak, and a whole lot of things container related.
uk: У процесі щоденного користування Silverblue було з'ясовано, що насправді відбувається поєднання усіх цих трьох технологій. Іноді контейнер надає потрібної гнучкості, яку не може надати Flatpak, іноді нашарування є єдиним можливим рішенням, а пакунки Flatpak, загалом, добре працюють там, де їхнє використання є доцільним. Ймовірно, ця ситуація є характерною для усіх спільнот користувачів операційних систем типу OSTree, зокрема Silverblue та інших типів операційних систем, де використовується libostree. Щоб успішно користуватися усіма способами, слід вивчити усе про rpm-ostree, усе про flatpak і усе, що пов'язано із користуванням контейнерами.

source: Each of the technologies expose varying levels of access to the OS image, with the Layering approach being the most intrusive in the fact it causes a new image tree to be created. The Flatpak application is definitely the least intrusive being sandboxed, with limited indirect access and limited developer capabilities to program in access to system resources. Containers have more access to system processes and devices.
uk: Кожна з технологій пов'язана із різними рівнями доступу до образу операційної системи. Підхід із нашаровуванням є, фактично, найбільш інтрузивним, оскільки буде створено новий образ системи. Спосіб із пакунками Flatpak є найменш інтрузивним, оскільки всі зміни відбуваються у «пісочниці» — програма має обмежений опосередкований доступ та обмежені можливості із розробки для програмування доступу до системних ресурсів. Контейнери мають більше доступу до системних процесів та пристроїв.

source: Need verification and details here about the different roles of each.
uk: Тут потрібна перевірка і подробиці щодо інших ролей.

source: As stated on https://flatpak.org/[flatpak.org] 'Flatpak is a next-generation technology for building and distributing desktop applications on Linux. Flatpak uses libostree to store application data, distinct from the host system management model.' In practice, what this means is that the flatpak deployment of an application does not normally have access to the host OS directly, or any other applications running on the host. The application is running on a runtime contained inside of the flatpak itself. If this sounds a lot like a flatpak is a container, it's because it is a container essentially. An application in flatpak form is running inside of its own environment designed specifically to make it work as intended, irrespective of the host OS, and is quite effectively sandboxed. One of Flatpak’s main goals is to increase the security of desktop systems by isolating applications from one another. This is achieved using sandboxing and means that, by default, applications that are run with Flatpak have extremely limited access to the host environment. For day to day usage in roles that encompass the bulk of things users generally are doing at their PC Silverblue, with its immutable OS and flatpak'd applications proves to function quite well. The updates are rolling along regularly just like the Fedora Workstation I had become used to, and the majority of my applications that are flatpak's work as they are intended to.
uk: Як зазначено на https://flatpak.org/[flatpak.org], «Flatpak — технологія наступного покоління для збирання і розповсюдження програм для робочих станцій на основі Linux. У Flatpak використовується libostree для зберігання даних програм, окремо від моделі керування основною системою.» На практиці, це означає, що розгорнутий пакунок flatpak, зазвичай, не має доступу до основної ОС, або будь-яких програм, які запущено на базовій системі, безпосередньо. Програма працює у середовищі, що міститься у самому пакунку flatpak. Це звучить так, наче flatpak є контейнером, і він насправді є контейнером. Програма у формі flatpak працює у власному середовищі, яке розроблено так, щоб програма працювала як слід, незалежно від основної операційної системи, і була, фактично, обмежена «пісочницею». Одним із основних призначень Flatpak є підвищення захисту робочих станцій ізолюванням програм одна від одної. Досягається це використанням «пісочниць» і означає те, що, типово, програми, які встановлено з Flatpak мають надзвичайно обмежений доступ до середовища основної системи. Для щоденного користування у досить широкому діапазоні завдань, які користувачі зазвичай виконують на своїх робочих станціях Silverblue, незмінна операційна система та програми з пакунків flatpak можуть працювати досить добре. Регулярні оновлення виконуються подібно до звичайної Fedora Workstation, до якої ви звикли, а більшість програм з flatpak працює як слід.

source: Using Flatpaks/Flathub
uk: Використання пакунків Flatpak і Flathub

source: When you first run Silverblue after the initial installation steps, you will likely want to install some applications, and to do that no doubt you first try Gnome Software, only to find nothing. Gnome Software is still there, just not showing software to install since the flatpak repository (flathub) is not configured for the system yet. This is due entirely to the Fedora licensing scheme, since Flathub allows software with non-open source license schemes to be distributed, like for instance rpmfusion-nonfree repo does in the normal Workstation version of Fedora. The user has to configure the rpmfusion-nonfree repo in order to install anything from its repository. In Silverblue, when installing flatpak'd applications, you have to configure the repository for use first. You do this with the `flatpak remote-add` command. This command takes as its first argument, the name you want to give the remote, and the URL it is located at for the second argument. In the case of the flathub repository, I simply named mine `flathub` and its URL is https://dl.flathub.org/repo/. The command becomes `flatpak remote-add flathub "https://dl.flathub.org/repo/"` without the quotes. It is also acceptable, and easier to browse to Flathub.org and select the quick setup option for Fedora, which Installs the repo via Gnome Software. Whichever way you choose to do it, will result in you now having access to all of the flatpak'd applications and extensions available on the Flathub repo. These applications will be displayed as usual in Gnome Software with their origin being dl.flathub.org. There are more applications being offered as flatpak's each day it seems, so check back often if your favourite isn't listed yet. There is more you can do with the repo now that you have it installed. The flatpak command has numerous options that are useful for inspecting what is available at a configured repo. The command `flatpak remotes` will list the installed/configured repositories, and if you use the `-d` switch with the command like so `flatpak remotes -d` you will get a detailed listing of your configured remotes (repo's).
uk: Коли ви вперше запускаєте Silverblue після початкових кроків зі встановлення, у вас, ймовірно, виникає потреба у встановленні додаткових програм, і ви намагаєтеся спочатку скористатися «Програмним забезпеченням» Gnome. І не знаходите там жодної програми. «Програмне забезпечення» Gnome на місці і працює, але не показує програм, оскільки у системі ще не налаштовано сховища пакунків flatpak (flathub). Причина цього полягає лише у схемі ліцензування Fedora. У Flathub можна додавати програмне забезпечення зі схемами ліцензування, відмінними від відкритих. Наприклад, програмне забезпечення зі сховища rpmfusion-nonfree у звичайній версії Fedora Workstation. Користувачеві слід спочатку налаштувати сховище rpmfusion-nonfree, щоб мати змогу щось з нього встановити. У Silverblue для встановлення пакунків flatpak вам слід спочатку налаштувати відповідне сховище. Зробити це можна за допомогою команди `flatpak remote-add`. Ця команда приймає як перший аргумент назву, яку ви хочете надати віддаленому сховищу, і, як другий аргумент, адресу цього сховища. У випадку сховища flathub, можна назвати сховище `flathub` і вказати його адресу https://dl.flathub.org/repo/. Сама команда виглядатиме так: `flatpak remote-add flathub "https://dl.flathub.org/repo/"`. Також можна просто відкрити сторінку Flathub.org і вибрати варіант зі швидким налаштовуванням для Fedora, у результаті використання якого буде встановлено відповідне сховище у «Програмному забезпеченні» Gnome. Який би зі шляхів ви не вибрали, результатом буде доступ до усіх програм та додатків flatpak зі сховища Flathub. Ці програми буде показано як звичайні програми у «Програмному забезпеченні» Gnome із адресою походження dl.flathub.org. Кількість програм у пакунках flatpak поступово збільшується, тому варто час від часу перевіряти, чи не з'явилася у списку потрібна вам програма. Зі встановленим сховищем можна виконувати інші дії. У команди flatpak доволі багато параметрів, якими можна скористатися для вивчення вмісту налаштованого сховища. Команда `flatpak remotes` покаже вам список встановлених і налаштованих сховищ, а якщо ви скористаєтеся перемикачем `-d`, наприклад, так: `flatpak remotes -d`, — ви отримаєте докладний список усіх налаштованих віддалених сховищ.

source: Flatpak refers to repositories as remotes, even if the repo exists on your own system.
uk: Flatpak вважає сховища віддаленими, навіть якщо сховище зберігається у вашій власній системі.

source: Also, it is worth noting that there are other remotes available to be configured on your system if you would like to explore some more. If you want to have Firefox as a flatpak, instead of using the version shipped as part of the Ostree of Silverblue, you could configure the firefox nighly remote (https://dl.flathub.org/repo/) with the following command `flatpak remote-add firefox-nightly <https://dl.flathub.org/repo/>` then install the FireFox nightly build with the command `flatpak install firefox-nightly org.mozilla.FirefoxNightly` and flatpak will install the Firefox nightly build for you. You may have already come to the conclusion that you could also install it from Gnome Software since you have configured the remote, and you would be correct but take note of the source listed on its install icon, it is the remote you just configured. As no doubt. some of the clever monkeys out there have likely noted when they did a remote-ls command on their configured flathub remote, there are more things listed than the app's. There are runtimes, and sdk's as well as app's since Flathub.org is a place to distribute such things.
uk: Слід зауважити, що ви можете налаштувати для вашої системи інші віддалені сховища, якщо вам потрібні додаткові програми. Якщо вам потрібен Firefox у форматі пакунка flatpak, замість версії, яка постачається як частина Ostree Silverblue, ви можете налаштувати віддалене сховище щоденних версій firefox (https://dl.flathub.org/repo/) за допомогою такої команди: `flatpak remote-add firefox-nightly <https://dl.flathub.org/repo/>`, а потім встановити щоденну збірку FireFox за допомогою команди `flatpak install firefox-nightly org.mozilla.FirefoxNightly`. Ви вже могли дійти висновку, що ви також можете встановити пакунок з «Програмного забезпечення» Gnome, оскільки віддалене сховище вже налаштовано. Ви праві, але слід зважати на джерело на піктограмі встановлення — вам потрібне саме щойно налаштоване сховище. Без сумніву, найкмітливіші з вас вже зауважили, коли працювали із командою remote-ls для налаштованого сховища flathub, що у списку, окрім програм, є і інші речі. Там ви знайдете середовища виконання та sdk, оскільки Flathub.org є місцем для розповсюдження таких пакунків.

source: Using Package Layering
uk: Користування нашаровуванням пакунків

source: Enabling 3rd Party RPM Repos
uk: Вмикання сторонніх сховищ RPM

source: Command Line vs. Gnome Software
uk: Командний рядок і «Програмне забезпечення GNOME»

source: Using Containers
uk: Користування контейнерами

source: Using Podman to Run Containers
uk: Використання Podman для запуску контейнерів

source: Running Your First Container
uk: Запуск вашого першого контейнера

source: Writing Your First Dockerfile
uk: Написання вашого першого dockerfile

source: Using Buildah to Build Containers
uk: Використання buildah для побудови контейнерів
