Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/silverblue-guide.po
Languages: uk

source: Sharing Data Between Container + Host ?
uk: Спільне використання даних у контейнері і основній системі?

source: Example Pet Container Usage
uk: Приклад використання контейнера-іграшки

source: On Fedora Silverblue, there is an out of the box solution provided for a Pet Container, fedora-toolbox. If it isn't already installed for you, you can do so with the following command `~[$ rpm-ostree install fedora-toolbox`, once it is installed, you'll have to reboot into the new image with `~[$ systemctl reboot`. When your image comes back you can begin with fedora-toolbox immediately by creating an image based upon your current system installation, including your home directory setup with dotfiles and all. To create an image this way type `~[$ fedora-toolbox create`, that will create a toolbox container for you, based upon an image of your current system setup. To use the container, you simply enter `~[$ fedora-toolbox enter` and you should now be at a prompt that looks like this in my case 🔹[user@toolbox ~]$ instead of my normal prompt in Fedora Silverblue which is this Lx  user@localhost  😈 ~ 
uk: У Fedora Silverblue є типове рішення для простих контейнерів — fedora-toolbox. Якщо цей пакунок ще не встановлено, ви можете його встановити такою командою: `~[$ rpm-ostree install fedora-toolbox`. Після встановлення вам слід перезавантажити систему до нового образу за допомогою команди `~[$ systemctl reboot`. Коли образ завантажиться, ви можете негайно розпочати роботу із fedora-toolbox створенням з образу на основі поточної встановленої системи, включно із налаштуваннями у вашій домашній теці, прихованими файлами та іншими даними. Щоб створити образ у цей спосіб, введіть таку команду: `~[$ fedora-toolbox create` У відповідь система створить для вас контейнер на основі образу поточної системи. Щоб скористатися контейнером, просто введіть команду `~[$ fedora-toolbox enter` У відповідь ви побачите подібне до такого запрошення: 🔹[user@toolbox ~]$ замість звичайного запрошення у Fedora Silverblue, яким є  user@localhost  😈 ~ 

source: The prompts as displayed, are normal for my system setup. They will very likely be different on your system.
uk: Показані запити є звичними у системі автора. У вашій системі вони можуть бути іншими.

source: Upgrades and Rollbacks
uk: Оновлення та повернення до попередніх версій

source: Upgrading the OS
uk: Оновлення операційної системи

source: Rolling Back the OS
uk: Повернення до попередньої версії операційної системи

source: Upgrading Flatpaks
uk: Оновлення пакунків Flatpak

source: Upgrading Containers
uk: Оновлення контейнерів

source: Miscellany ?
uk: Інше?

source: Generating SSH Keys ?
uk: Створення ключів SSH?

source: Enabling SSH Access ?
uk: Вмикання доступу за допомогою SSH?

source: Using VPN Connections ?
uk: Використання з'єднань VPN?

source: oc cluster up ?
uk: Запуск кластера?

source: Advanced Topics
uk: Додаткові теми

source: Creating a Custom Silverblue Compose
uk: Створення нетипової композиції Silverblue

source: Generating Your Own Silverblue ISO
uk: Створення власного образу ISO Silverblue

source: Known Problems
uk: Відомі проблеми

source: Lack of Support for DKMS/AKMOD (i.e. nVidia drivers)
uk: Нестача підтримки DKMS/AKMOD (тобто драйверів nVidia)
