Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/technical-information.po
Languages: pt_br, uk

source: Technical Information
pt_br: Informações técnicas
uk: Технічні відомості

source: This page provides some background technical information on Silverblue, including information on the core technologies used to build it, as well as the filesystem layout.
pt_br: Esta página fornece algumas informações técnicas básicas sobre o Silverblue, incluindo informações sobre as principais tecnologias usadas para criá-lo, bem como o layout do sistema de arquivos.
uk: На цій сторінці наведено деякі базові технічні відомості щодо Silverblue, зокрема відомості щодо базових технологій, які використано для збирання дистрибутива, а також щодо компонування його файлової системи.

source: Users should not need to know this information. It is provided here for those who are interested in the technical details or those who want to use Silverblue in a non-standard manner.
pt_br: Os usuários não precisam saber dessas informações. Elas são fornecidas aqui para aqueles que estão interessados nos detalhes técnicos ou para aqueles que desejam usar o Silverblue de uma maneira não padronizada.
uk: Ці відомості є непотрібними для кінцевих користувачів. Їх наведено тут для тих, хто цікавиться технічним боком справи, або тих, хто хоче скористатися Silverblue у якийсь нестандартний спосіб.

source: ostree and rpm-ostree
pt_br: ostree e rpm-ostree
uk: ostree та rpm-ostree

source: https://ostree.readthedocs.io/en/latest/[ostree] is the core technology that is used to compose, deploy and update Silverblue. ostree operates in a similar manner to a version control system, but it operates on entire filesystem trees. It is often described as “Git for operating system binaries”.
uk: https://ostree.readthedocs.io/en/latest/[ostree] — базова технологія, яка використовується для компонування, розгортання та оновлення Silverblue. ostree працює подібно до системи керування версіями, але використовує для роботи усі ієрархії файлових систем. Часто ostree описують як «Git для бінарних файлів операційної системи».

source: For Silverblue installs, ostree is responsible for deploying and updating the OS image (including everything below `/` that is not symlinked into `/var`). It also updates `grub.cfg` entries to point to the current image.
pt_br: Para instalações do Silverblue, ostree é responsável por implantar e atualizar a imagem do sistema operacional (incluindo tudo abaixo de `/` que não está vinculado a `/var`). Ele também atualiza as entradas do `grub.cfg` para apontar para a imagem atual.
uk: У встановлених системах Silverblue ostree відповідає за розгортання і оновлення образу операційної системи (зокрема усього у `/`, які не пов'язано символічними посиланнями із `/var`). ostree також оновлює записи `grub.cfg` так, щоб вони вказували на поточний образ.

source: https://rpm-ostree.readthedocs.io/en/latest/[rpm-ostree] builds on top of ostree, and makes it possible to install RPMs as a “layer” on top of an ostree image. This makes it possible to install RPMs on Silverblue.
uk: https://rpm-ostree.readthedocs.io/en/latest/[rpm-ostree] збирається на основі ostree і робить можливим встановлення RPM як «шару» над образом ostree. Це уможливлює встановлення RPM у Silverblue.

source: When a package is installed with `rpm-ostree`, a new OS image is composed by adding the RPM payload to the existing OS image, and creating a new, combined image. To see the newly installed RPMs, the system needs to be rebooted with the new image. rpm-ostree also takes care of recreating the layered image whenever you update the base OS image.
pt_br: Quando um pacote é instalado com `rpm-ostree`, uma nova imagem do sistema operacional é composta adicionando a carga útil RPM à imagem do sistema operacional existente e criando uma nova imagem combinada. Para ver os RPMs recém-instalados, o sistema precisa ser reinicializado com a nova imagem. O rpm-ostree também se encarrega de recriar a imagem em camadas sempre que você atualiza a imagem do sistema operacional base.
uk: Коли встановлюється пакунок за допомогою `rpm-ostree`, створюється новий образ операційної системи шляхом додавання вмісту RPM до наявного образу операційної системи і створення нового комбінованого образу. Щоб переглянути нововстановлені RPM, систему слід перезавантажити з використанням нового образу. rpm-ostree також відповідає за повторне створення шаруватого образу кожного разу, коли ви оновлюєте базовий образ операційної системи.

source: Silverblue filesystem layout
pt_br: Layout do sistema de arquivos do Silverblue
uk: Компонування файлової системи Silverblue

source: On Silverblue, the root filesystem is immutable. This means that `/`, `/usr` and everything below it is read-only.
pt_br: No Silverblue, o sistema de arquivos raiz é imutável. Isso significa que `/`, `/usr` e tudo abaixo dele são somente leitura.
uk: У Silverblue коренева файлова система є незмінною. Це означає, що `/`, `/usr` і усі підлеглі щодо них каталоги є придатними лише для читання.

source: `/var` is where all of Silverblue's runtime state is stored. Symlinks are used to make traditional state-carrying directories available in their expected locations. This includes:
pt_br: `/var` é onde todo o estado de tempo de execução do Silverblue é armazenado. Links simbólicos são usados para disponibilizar diretórios tradicionais de controle de estado em seus locais esperados. Isso inclui:
uk: Усі динамічні частини Silverblue зберігаються у `/var`. Для створення традиційних каталогів у очікуваних місцях для збереження стану системи використовуються символічні посилання. Це, зокрема, стосується таких каталогів:

source: This means that separate home partitions should be mounted on `/var/home`.
pt_br: Isso significa que partições pessoais separadas devem ser montadas em `/var/home`.
uk: Це означає, що окремі домашні розділи слід монтувати до `/var/home`.

source: For a more detailed explanation of Silverblue's filesystem layout, refer to the excellent https://ostree.readthedocs.io/en/latest/manual/adapting-existing/[libostree documentation].
uk: Докладніший опис компонування файлової системи Silverblue можна знайти у чудовій https://ostree.readthedocs.io/en/latest/manual/adapting-existing/[документації із libostree].

source: https://coreos.github.io/rpm-ostree/[rpm-ostree] builds on top of ostree, and makes it possible to install RPMs as a “layer” on top of an ostree image. This makes it possible to install RPMs on Silverblue.
pt_br: https://coreos.github.io/rpm-ostree/[rpm-ostree] compila sobre a ostree e possibilita a instalação de RPMs como uma “camada” sobre a imagem da ostree. Isso torna possível instalar RPMs no Silverblue.

source: For a more detailed explanation of Silverblue's filesystem layout, refer to the excellent https://ostreedev.github.io/ostree/adapting-existing/[libostree documentation].
pt_br: Para uma explicação mais detalhada do layout do sistema de arquivos do Silverblue, consulte a excelente https://ostreedev.github.io/ostree/adapting-existing/[documentação do libostree].
