Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/tips-and-tricks.po
Languages: uk, zh_hans

source: Tips and Tricks
uk: Підказки і настанови
zh_hans: 提示和技巧

source: Hidding the default browser (Firefox)
uk: Приховування типової програми для перегляду інтернету (Firefox)

source: If you're using another browser than the one installed by default (Firefox) then you can hide the default one from the interface via the following commands:
uk: Якщо ви користуєтеся іншою програмою для перегляду інтернету, ніж типова (Firefox), ви можете приховати типову програму з інтерфейсу за допомогою таких команд:

source: Enabling RPM Fusion repos
uk: Вмикання сховищ RPM Fusion

source: This section discusses third-party software sources not officially affiliated with or endorsed by the Fedora Project. Use them at your own discretion. Fedora recommends the use of free and open source software and avoidance of software encumbered by patents.
uk: У цьому розділі наведено поради щодо сторонніх джерел програмного забезпечення, які офіційно не пов'язано із Проєктом Fedora і не схвалено його учасниками. Користуйтеся ними на свій розсуд. Fedora рекомендує користуватися вільним програмним забезпеченням із відкритим кодом і уникати програмного забезпечення, поширення якого обмежено патентами.

source: Users may want to take advantage of the non-free software that is made available via the https://rpmfusion.org/[RPM Fusion] repos in order to use the proprietary NVIDIA drivers, multimedia codecs, or other software not distributed as part of Fedora.
uk: У користувачів може виникнути потреба у використанні програмного забезпечення, яке не є вільним і яке доступне зі сховищ https://rpmfusion.org/[RPM Fusion], для користування закритими драйверами NVIDIA, мультимедійними кодеками або іншим програмним забезпеченням, яке не поширюється як частина Fedora.

source: The first time you install the RPM Fusion repos, you need to install the versioned RPMs:
uk: Під час початкового встановлення сховищ RPM Fusion вам слід встановити RPM відповідних версій:

source: Once you have rebooted into the new deployment, you can run the following command to remove the “lock” on the versioned packages that were installed previously. This will enable the RPM Fusion repos to be automatically updated and versioned correctly across major Fedora version rebases:
uk: Щойно ви завантажите нову рознорнуту систему, ви зможете віддати вказану нижче команду для вилучення «блокування» пакунків версій, які було встановлено раніше. Це увімкне сховища RPM Fusion для автоматичного оновлення і належного використання версій для основних переходів за версіями Fedora:

source: For more information, see https://discussion.fedoraproject.org/t/simplifying-updates-for-rpm-fusion-packages-and-other-packages-shipping-their-own-rpm-repos/30364[this thread] on the Fedora Discourse site.
uk: Щоб дізнатися більше, ознайомтеся із https://discussion.fedoraproject.org/t/simplifying-updates-for-rpm-fusion-packages-and-other-packages-shipping-their-own-rpm-repos/30364[цією гілкою обговорення] на сайті Fedora Discourse.

source: Working with Toolbx
uk: Робота з Toolbx
zh_hans: 使用 Toolbx

source: Finding out if you are currently in a Toolbx container
uk: Визначення того, чи перебуваєте ви у контейнері Toolbx
zh_hans: 检查你是否位于一个 Toolbx 容器中

source: If you frequently make use of Toolbx to perform various tasks and use multiple Toolbx containers it can be hard to keep track of whether you are currently executing commands on the host or in a Toolbx container. Furthermore, there is currently no command to tell you in which Toolbx container you are working.
uk: Якщо ви часто користуєтеся Toolbx для виконання різноманітних завдань і використовуєте декілька контейнерів Toolbx, стає важко стежити за тим, виконуєте ви команди в основній системі чи у контейнері Toolbx. Крім того, у поточній версії немає команди, яка б повідомила вам, у якому з контейнерів Toolbx ви працюєте.
zh_hans: 如果你经常使用 Toolbx 执行各种任务并使用多个 Toolbx 容器，有时可能会搞不清楚自己是在主机上还是在 Toolbx 容器中执行命令。毕竟目前没有任何命令告诉你正在哪个 Toolbx 容器中工作。

source: To alleviate this, you can add the following shell alias at the end of your `~/.bashrc`:
uk: Для полегшення виконання цього завдання ви можете додати таку альтернативу командної оболонки наприкінці вашого файла `~/.bashrc`:
zh_hans: 为了缓解这种情况，你可以在 `~/.bashrc` 末尾添加下面的 shell 别名：

source: When you open a new shell, you now have access to the new command `istoolbx`. This will behave as follows:
uk: Коли ви відкриєте нову командну оболонку, у вас буде доступ до нової команди — `istoolbx`. Ця команда поводитиметься так:
zh_hans: 当你打开一个新的 Shell 的时候，你就能使用一个新的命令 `istoolbx`：

source: When run from the host, returns an exit code of 1
uk: Якщо команду виконано з основної системи, вона поверне код виходу 1
zh_hans: 当你在主机执行这个命令，它会以返回值 1 退出

source: When run from a Toolbx container, returns an exit code of 0 and prints the current Toolbx containers name to the console
uk: Якщо команду запущено з контейнера Toolbx, буде повернуто код виходу 0 і виведено до консолі назву поточного контейнера Toolbx
zh_hans: 当你在 Toolbx 容器执行这个命令，它会以返回值 0 退出同时打印当前 Toolbx 的容器名称

source: If a more automated solution is your preference the following added to your `~/.bashrc` will change your bash prompt to include "[toolbox <name>]":
uk: Якщо вам подобається більш автоматизоване рішення, варто додати до вашого `~/.bashrc` вказаний вище фрагмент, який змінить ваш запит bash на такий, що міститиме рядок «[toolbox <назва>]»:
zh_hans: 当然你也可以在 `~/.bashrc` 添加下面的内容，这样子你的 Bash 提示符中就能直接包含 "[toolbox <name>]" 了：

source: Now you can include `is_toolbox` in your `PS1` variable and not need to execute any extra commands in order to know whether or not your are in a toolbox or host shell.
uk: Потім ви можете включити `is_toolbox` до вашої змінної `PS1`, і вам вже не потрібно буде виконувати жодних додаткових команд для того, щоб дізнатися, перебуваєте ви у toolbox чи у командній оболонці основної системи.
zh_hans: 现在你就可以将 `is_toolbox` 包含在 `PS1` 变量中而无需再手动执行别的命令来确认你是否在 toolbox 中了。

source: Example: ``` export PS1="\[\e[31m\]\`is_toolbox\`\]\e[m\]\[\e[32m\]\\$ \[\e[m\]\[\e[37m\]❱\[\e[m\] " ```
uk: Приклад: ``` export PS1="\[\e[31m\]\`is_toolbox\`\]\e[m\]\[\e[32m\]\\$ \[\e[m\]\[\e[37m\]❱\[\e[m\] " ```
zh_hans: 例如：``` export PS1="\[\e[31m\]\`is_toolbox\`\]\e[m\]\[\e[32m\]\\$ \[\e[m\]\[\e[37m\]❱\[\e[m\] " ```

source: This results in a prompt which appears as such when not in a toolbox: `$ ❱`
uk: Результатом буде запит, який виглядатиме так, якщо ви не у toolbox: `$ ❱`
zh_hans: 如果你不在 toolbox 中，它就会显示为 `$ ❱`

source: However, when running in a toolbox named "default" looks like: `[toolbox default]$ ❱`
uk: А у toolbox із назвою «default» ось так: `[toolbox default]$ ❱`
zh_hans: 如果你在一个名为 "default" 的 toolbox 它则会显示为 `[toolbox default]$ ❱`

source: Running applications from inside Toolbx on the host
uk: Запуск програм з Toolbx в основній системі
zh_hans: 在 Toolbx 里运行 Host 上的应用程序

source: This can be necessary if you want to interact with tools available from the host, for example `podman`, `nmcli` or `rpm-ostree` without leaving the Toolbx container in between. You can use `flatpak-spawn`, included in the base installation for this:
uk: Потреба у запуску може виникнути, якщо ви хочете взаємодіяти із програмними інструментами основної системи, наприклад `podman`, `nmcli` або `rpm-ostree`, не полишаючи контейнера Toolbx. Ви можете скористатися для виконання цього завдання програмою `flatpak-spawn`, яку включено до базового пакунка:
zh_hans: 当你希望在 Toolbx 中使用一些 host 上的工具如 `podman`, `nmcli` or `rpm-ostree`，你可以使用预置的 `flatpak-spawn` 命令：

source: If the application you want to call requires `sudo` access, the `-S` option must be supplied to `sudo` like below:
uk: Якщо програмі, яку ви хочете викликати, потрібен доступ `sudo`, слід додати параметр `-S` до команди `sudo`, ось так:
zh_hans: 如果你运行某个应用需要到 `sudo` 权限，你必须为 `sudo` 添加 `-S` 选项：

source: If you find yourself using commands like these frequently to access e.g. the flatpak command from inside the Toolbx container, you can create yourself a short custom wrapper script (*inside the Toolbx container*). To do this, perform the following steps:
uk: Якщо ви використовуєте команди, подібні до наведеної вище, часто для доступу, наприклад, до команди flatpak з контейнера Toolbx, ви можете створити самі короткий нетиповий скрипт-обгортку (*у контейнері Toolbx*). Для цього виконайте такі кроки:
zh_hans: 如果你发现自己经常遇到在 Toolbx 容器中运行 host 上工具的场景，你可以自己创建一个简短的预置脚本（*在 Toolbx 容器内*）：

source: Define the `istoolbx` alias (for convenience) by executing the command mentioned above in your terminal
uk: Визначте альтернативу `istoolbx` (для зручності) за допомогою згаданої вище команди у вашому терміналі
zh_hans: 在终端中执行上面的命令以定义 `istoolbx` 别称

source: Make sure you are in a Toolbx container. If the following command doesn't produce any output, you are likely still working on the host!
uk: Переконайтеся, що ви перебуваєте у контейнері Toolbx. Якщо наступна команда нічого не виводить, ймовірно, ви усе ще перебуваєте в основній системі!
zh_hans: 请确保你在一个 Toolbx 容器内，如果你在 host 上使用这个命令你可能得不到任何输出！

source: [toolbx]$ istoolbx <Toolbx container name here>
uk: [toolbx]$ istoolbx <Тут буде назва контейнера Toolbx>

source: Once you have made sure you're in a Toolbx container, execute the following command:
uk: Щойно ви опинитеся у контейнері Toolbx, віддайте таку команду:
zh_hans: 当你确定你在一个 Toolbx 容器时， 执行：

source: You now have a `flatpak` command available that allows you to interact with `flatpak` as if you were running the command on the host.
uk: Тепер вам доступна команда `flatpak`, за допомогою якої ви можете взаємодіяти з `flatpak` так, наче ви віддаєте команду в основній системі.
zh_hans: 你现在有一个可用的 `flatpak` 命令，它允许你与 `flatpak` 交互，就好像您在主机上运行该命令一样。

source: Working with `ostree`/`rpm-ostree`
uk: Робота з `ostree`/`rpm-ostree`
zh_hans: 使用 `ostree`/`rpm-ostree`

source: Tracking changes to the base OS
uk: Стеження за змінами у базовій операційній системі
zh_hans: 追踪基本系统上的变动

source: Some directories in `ostree`-based operating systems are writable by the user, like `/etc`. You can get a quick overview of the files changed under `/etc` using the following command:
uk: Деякі з каталогів операційних систем на основі `ostree` придатні до запису для звичайного користувача, зокрема `/etc`. Ви можете переглянути список файлів, які було змінено у `/etc`, за допомогою такої команди:
zh_hans: 基于 `ostree` 的操作系统中的某些目录是用户可写的，例如 `/etc`。 您可以使用以下命令快速了解在 `/etc` 下更改的文件：

source: To get a more elaborate diff, you can use something like this:
uk: Щоб отримати докладніший опис відмінностей, ви можете віддати таку команду:
zh_hans: 要获得更详细的差异，你可以使用：

source: This works because ostree keeps an unmodified copy of the `/etc` directory under `/usr/etc`. All of your changes go to `/etc` directly.
uk: Це працює, оскільки ostree зберігає незмінену копії каталогу `/etc` у `/usr/etc`. Усі внесені вами зміни записуються до `/etc` безпосередньо.
zh_hans: 这是因为 ostree 在 `/usr/etc` 下保留了 `/etc` 目录未经修改的副本。 您的所有更改都直接应用于 `/etc`。

source: Working with Flatpak applications
uk: Робота з програмами Flatpak
zh_hans: 使用 Flatpak 应用

source: Directly accessing Flatpak applications from the CLI
uk: Безпосередній доступ до програм Flatpak з інтерфейсу командного рядка
zh_hans: 从 CLI 直接访问 Flatpak 应用程序

source: The most noticable change when using Flatpak applications instead of conventional installations is that the applications cannot be directly called from the CLI any more, like so:
uk: Найпомітнішою відмінністю користування програмами Flatpak від користування звичайними програмами є те, що такі програми не можна безпосередньо викликати з інтерфейсу командного рядка, ось так:
zh_hans: 使用 Flatpak 应用程序而非传统方式安装的应用程序最显着的变化是不能再直接从 CLI 调用应用程序：

source: $ evince bash: command not found: evince
uk: $ evince bash: команду не знайдено: evince

source: Instead, one can call them like this:
uk: Замість цього, виклик можна здійснити так:
zh_hans: 你需要这样子调用它们：

source: In addition, most Flatpak applications export their internal binaries under an installation-dependent location:
uk: Крім того, більшість програм Flatpak експортують власні двійкові внутрішні файли каталозі, який залежить від каталогу встановлення:
zh_hans: 此外，大多数 Flatpak 应用程序将其内部二进制文件导出到一个与安装方式相关的位置：

source: For Flatpak applications installed from `system` remotes, these can be found under `/var/lib/flatpak/exports/bin/`
uk: Для програм Flatpak, які встановлено з віддалених сховищ `system`, ці каталоги можна знайти у `/var/lib/flatpak/exports/bin/`
zh_hans: 如果你的 Flatpak 应用是系统级别安装的，你可以在 `/var/lib/flatpak/exports/bin/` 找到它们

source: For Flatpak applications installed from `user` remotes, these can be found under `$HOME/.local/share/flatpak/exports/bin/`
uk: Для програм Flatpak, які встановлено з віддалених сховищ `user`, ці каталоги можна знайти у `$HOME/.local/share/flatpak/exports/bin/`
zh_hans: 如果你的 Flatpak 应用是用户级别安装的，你可以在 `$HOME/.local/share/flatpak/exports/bin/` 找到它们

source: If you're unsure to which installation a Flatpak application belongs, you can use this command to print it out:
uk: Якщо ви не певні, до якого встановлення належить програма Flatpak, ви можете скористатися такою командою для виведення потрібних даних:
zh_hans: 如果你不确定某个 Flatpak 应用是怎么安装的，你可以使用这个命令：

source: You can then either add these directories to your `$PATH`:
uk: Ви можете або додати ці каталоги до змінної `$PATH`:
zh_hans: 你可以将这些目录添加到 `$PATH`：

source: or setup shell `alias`es as needed to make them available to the CLI like so:
uk: або налаштувати `alias` командної оболонки так, щоб вони стали доступними інтерфейсу командного рядка, ось так:
zh_hans: 或者为你的 shell 设置别称是它们在 CLI 中可用：

source: $ alias evince="flatpak run org.gnome.Evince" # or alias evince="org.gnome.Evince" $ evince
uk: $ alias evince="flatpak run org.gnome.Evince" # або alias evince="org.gnome.Evince" $ evince
