Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/toolbox.po
Languages: pt_br, uk, zh_hans

source: As an immutable host, Silverblue is an excellent platform for container-based development and, for working with containers, https://buildah.io/[buildah] and https://podman.io/[podman] are recommended.
uk: Як незмінна система, Silverblue є ідеальною платформою для розробки програмного забезпечення на основі технологій контейнеризації. Для роботи з контейнерами рекомендуємо скористатися https://buildah.io/[buildah] і https://podman.io/[podman].
zh_hans: Silverblue 作为不可变操作系统，是非常适合用于进行容器相关的开发的。我们也非常欢迎你在 Silverblue 使用 https://buildah.io/[buildah] 和 https://podman.io/[podman] 完成容器相关的工作。

source: Silverblue also comes with the https://github.com/containers/toolbox[toolbox] utility, which uses containers to provide an environment where development tools and libraries can be installed and used.
uk: Крім того, до складу Silverblue включено допоміжний засіб https://github.com/containers/toolbox[toolbox], який використовує контейнери для забезпечення роботи середовища, у якому можна встановити засоби для розробки і бібліотеки і скористатися ними.
zh_hans: Silverblue 也提供了 https://github.com/containers/toolbox[Toolbox] ，利用容器提供了一个开发工具和程序库部署与使用的解决方案。

source: Why use toolbox?
pt_br: Por que usar o toolbox?
uk: Чому слід користуватися toolbox?
zh_hans: 为什么使用 Toolbox？

source: Toolbox makes it easy to use a containerized environment for everyday software development and debugging. On immutable operating systems, like https://silverblue.fedoraproject.org/[Fedora Silverblue], it provides a familiar package-based environment in which tools and libraries can be installed and used. However, toolbox can also be used on package-based systems.
uk: Toolbox спрощує використання контейнеризованих середовищ для регулярної розробки програмного забезпечення та діагностування. У незмінних операційних системах, зокрема https://silverblue.fedoraproject.org/[Fedora Silverblue], він надає доступ до знайомого середовища, яке засновано на пакунках, у якому можна встановлювати інструменти і бібліотеки. Втім, toolbox також можна використовувати і у заснованих на пакунках системах.
zh_hans: Toolbox 提供了专为应用程序开发和调试打造的容器化环境。在 https://silverblue.fedoraproject.org/[Fedora Silverblue] 这样的不可变操作系统上，Toolbox 提供了一种基于软件包的环境以方便用户安装工具和软件库。当然 Toolbox 也可被用于其它的基于软件包的系统。

source: Using Toolbox for running your workflows in a containerized manner brings you several advantages:
pt_br: Usar o Toolbox para executar seus fluxos de trabalho em contêineres traz várias vantagens:
uk: Використання Toolbox для робочих процесів із контейнеризацією надає вам декілька переваг:
zh_hans: 通过 toolbox 容器化你的工作流会给你带来以下好处：

source: It keeps the host OS clean and stable, and helps to avoid the clutter that can happen after installing lots of development tools and packages.
pt_br: Ele mantém o sistema operacional hospedeiro limpo e estável e ajuda a evitar a confusão que pode acontecer após a instalação de muitas ferramentas de desenvolvimento e pacotes.
uk: Таким чином можна зберігати базову операційну систему незмінною і стабільною, запобігти захаращенню системи, яке трапляється після встановлення значної кількості інструментів і пакунків для розробки.
zh_hans: 它使得宿主系统干净且稳定，也有效避免了安装大量开发工具和软件包之后可能发生的混乱。

source: You get access to different versions of supported distributions independent of the version you are running.
pt_br: Você obtém acesso a diferentes versões de distribuições com suporte, independentemente da versão em execução.
uk: Ви отримуєте доступ до різних версій підтримуваних дистрибутивів незалежно від версії, з якою ви працюєте.
zh_hans: 不管你运行的哪个版本的 Fedora，所有受支持的发行版都在 toolbox 中可用。

source: Containers are a good way to isolate and organise the dependencies needed for different projects.
pt_br: Os contêineres são uma boa maneira de isolar e organizar as dependências necessárias para diferentes projetos.
uk: Контейнери — якісний спосіб ізолювати і упорядкувати залежності, які потрібні для різних проєктів.
zh_hans: 容器是隔离和组织不同项目依赖的好方法。

source: Containers are a safe space to experiment: if things go wrong, it's easy to throw a toolbox away and start again.
pt_br: Os contêineres são um espaço seguro para experimentar: se algo der errado, é fácil jogar uma toolbox fora e começar de novo.
uk: Контейнери є безпечним майданчиком для експериментів: якщо щось піде не так, доволі просто викинути набір інструментів (toolbox) і розпочати все знову.
zh_hans: 容器是做实验的好地方：一旦出了问题，只需要删除容器重新开始就行了。

source: How it works
pt_br: Como funciona
uk: Як це працює
zh_hans: 工作原理

source: Toolbox takes the work out of using containers, by providing a small number of simple commands to create, enter, list and remove containers. It also integrates toolbox containers into your regular working environment, to make it easy for you to use them as an everyday development space.
uk: Toolbox працює на основі контейнерів, надаючи доступ до вузького набору команд для створення, входу, побудови списку та вилучення контейнерів. Він також інтегрує контейнери toolbox до вашого звичайного робочого середовища з метою спрощення користування ними як регулярним простором для розробки.
zh_hans: Toolbox 提供了创建、进入、列举和删除容器的实现。与此同时，Toolbox 将容器集成到了常规的工作环境中，以便日常开发使用。

source: Containers are created from images and those are usually a very stripped down version of distributions. In such images there are almost no tools and documentation available. The team behind Toolbox maintains a Fedora image where such tools and documentation are available, providing with a good out of the box experience.
uk: Контейнери створюються з образів. Вони є дуже спрощеними версіями дистрибутивів. У таких образах майже немає інструментів та документації. Команда, яка розробляє Toolbox, супроводжує образ Fedora, де такі інструменти і документація є доступними, надаючи чудові можливості одразу після запуску.
zh_hans: 容器是通过映像文件创建的，可以说映像文件就是精简过的原装发行版。Fedora 的映像文件目前由 Toolbox 团队维护，有着足够的实用工具和文档，相信能够为你带来开箱即用的体验。

source: Each toolbox container is an environment that you can enter from the command line. Inside each one, you will find:
uk: Кожен із контейнерів toolbox є середовищем, до якого ви можете увійти з командного рядка. Усередині кожного контейнера ви знайдете:
zh_hans: 所有 Toolbox 容器都可以通过命令行进入。每一个容器都提供了：

source: Your existing username and permissions
pt_br: Seu nome de usuário e permissões existentes
uk: Ваше поточне ім'я користувача і права доступу
zh_hans: 已有的账户及其权限

source: Access to your home directory and several other locations
pt_br: Acesso para seu diretório pessoal (home) e várias outros locais
uk: Доступ до вашого домашнього каталогу та декількох інших місць
zh_hans: 用户目录以及其他几个目录的访问能力

source: Access to both system and session D-Bus, system journal and Kerberos
pt_br: Acesso ao sistema e à sessão D-Bus, journal do sistema e Kerberos
uk: Доступ до D-Bus системи і сеансу, журналу системи і Kerberos
zh_hans: 对于系统以及会话的 D-Bus，系统日志以及 Kerberos 认证信息的访问权限

source: Common command lines tools, including a package manager (e.g., DNF on Fedora)
pt_br: Ferramentas de linha de comando comuns, incluindo um gerenciador de pacotes (por exemplo, DNF no Fedora)
uk: Типові засоби командного рядка, зокрема програму для керування пакунками (наприклад DNF у Fedora)
zh_hans: 常见命令行工具，包括软件包管理器（例如 Fedora 附带的 DNF）

source: In other words, toolbox containers look, feel and behave like a standard Linux command line environment. By connecting all this information, toolbox containers lose a certain amount of security gained by using the containers technology. Therefore, you should not treat toolbox containers as a sandbox where you can execute any script you would never run on any other system.
uk: Іншими словами, контейнери toolbox виглядають, працюють і поводяться подібно до стандартного середовища командного рядка Linux. Поєднуючи усі ці відомості, контейнери toolbox втрачають певну частину захисту, який набувається використанням технології контейнерів. Тому вам не слід вважати контейнери toolbox пісочницями, у яких ви можете виконувати будь-який скрипт, який би ви ніколи не запускали у будь-якій іншій системі.
zh_hans: 可以说 Toolbox 容器无论是在哪个角度看都和 Linux 命令行环境相差无几。但也是基于上面的几点，你不应将 Toolbox 容器视为可以执行未经试验脚本的沙箱。

source: In most cases, when a command is run inside a container, the program from inside the container is used. However, there are a few special cases where the program on the host is used instead (using `flatpak-spawn`). One example of this is the toolbox command itself; this makes it possible to use toolbox from inside toolbox containers.
uk: У більшості випадків, при запуску команди зсередини контейнера буде використано програму з контейнера. Втім, існує декілька спеціалізованих випадків, коли замість неї буде використано програму з основної системи (за допомогою `flatpak-spawn`). Одним з прикладів є сама команда `toolbox`; таким чином можна уможливити використання toolbox з контейнерів toolbox.
zh_hans: 在多数情况下，当你在容器中执行一条命令，容器内的应用程序会被使用。但有些时候使用的会是宿主系统的程序（利用 `flatpak-spawn`）。一个例子就是 toolbox 这个命令本身，它使得在 Toolbox 容器内使用 Toolbox 成为可能。

source: Installation
pt_br: Instalação
uk: Встановлення
zh_hans: 安装

source: Toolbox is preinstalled on Fedora Silverblue 30 or newer. On older versions, it can be installed with the following command:
uk: Toolbox вже встановлено у Fedora Silverblue 30 і новіших версіях. У старіших версіях встановити toolbox можна такою командою:
zh_hans: Fedora Silverblue 30 或更高版本已经预装了 Toolbox。在旧版系统上，你可以使用下面的命令安装 Toolbox：

source: This will install toolbox as a layered RPM.
pt_br: Isso vai instalar toolbox como um RPM em camada.
uk: У результаті буде встановлено toolbox як нашарований RPM.
zh_hans: 这会将 toolbox 作为一个堆叠的 RPM 被安装。

source: Toolbox can be installed on Fedora Workstation (or any package-based version of Fedora) with the following command:
pt_br: O toolbox pode ser instalado no Fedora Workstation (ou em qualquer versão baseada em pacote do Fedora) com o seguinte comando:
uk: Toolbox можна встановити на Fedora Workstation (або будь-яку засновану на пакунках версію Fedora) за допомогою такої команди:
zh_hans: 可以在 Fedora Workstation（或者 Fedora 的任意一个基于软件包的版本）可以使用下面的命令安装 Toolbox：

source: Your first toolbox
pt_br: Sua primeira toolbox
uk: Ваш перший toolbox
zh_hans: 创建第一个 Toolbox 实例

source: Once toolbox is installed, two simple commands are required to get started:
pt_br: Depois que o toolbox é instalado, dois comandos simples são necessários para começar:
uk: Після встановлення toolbox, щоб розпочати роботу, слід віддати дві прості команди:
zh_hans: 当 Toolbox 被安装后，执行下面的两个命令以开启你的 Toolbox 之旅：

source: This will download an OCI image and create a toolbox container from it. Once this is complete, run:
uk: У результаті буде отримано образ OCI і створити з нього контейнер toolbox. Щойно дані буде отримано, віддайте таку команду:
zh_hans: 这会下载 OCI 映像文件并利用它创建一个 Toolbox 容器。接下来我们执行：

source: Once inside the toolbox, you can access common command line tools, and install new ones using a package manager (e.g., DNF on Fedora).
pt_br: Uma vez dentro da toolbox, você pode acessar ferramentas de linha de comando comuns e instalar novas usando um gerenciador de pacotes (por exemplo, DNF no Fedora).
uk: Потрапивши до нутрощів toolbox, ви отримуєте доступ до типових інструментів командного рядка і доступ до встановлення нових інструментів за допомогою програми для керування пакунками (наприклад DNF у Fedora).
zh_hans: 在进入 Toolbox 容器后，你就可以访问常见的命令行工具，并使用软件包管理器（例如 Fedora 的 DNF）安装更多新的工具。

source: When the prompt is inside a toolbox, it is prepended with a diamond: this indicates that the prompt is inside a toolbox container. The diamond symbol may not be present if you use a custom shell theme.
uk: Якщо запит щодо команди надходить зсередини toolbox, перед ним буде показано ромб: так система вказує на те, що запит є запитом із середини контейнера toolbox. Символ ромба може бути також показано, якщо ви використовуєте нетипову тему командної оболонки.
zh_hans: 当你处于 Toolbox 环境时，你会发现命令提示符会有一个菱形标记作为前缀。如果你使用了自定义的 Shell 主题，这颗菱形就会消失。

source: Commands and usage
pt_br: Comandos e uso
uk: Команди і користування
zh_hans: 命令与用法

source: toolbox create [options] <name>
pt_br: toolbox create [opções] <nome>
uk: toolbox create [параметри] <назва>

source: Creates a toolbox container. This will download an OCI image if one isn't available (this is required to create the container). By default an image matching the version of the host is used. If the host system does not have a matching image, a Fedora image is used instead.
uk: Створює контейнер toolbox. У результаті буде отримано образ OCI, якщо він є недоступним (ця дія потрібна для створення контейнера). Типово, образ за версією збігається із версією основної системи. Якщо основна система не має відповідного образу, замість нього буде використано образ Fedora.
zh_hans: 创建一个 Toolbox 容器。如果没有 OCI 映像可用会先作下载，默认情况下下载的是与宿主环境对应的映像。如果找不到匹配的映像，则会默认下载 Fedora 映像。

source: Used without options, `toolbox create` will automatically name the container it creates. To create additional toolboxes, use the `<name>` argument.
uk: Якщо віддати команду без параметрів, `toolbox create` автоматично визначить назву створеного контейнера. Для створення додаткових toolbox скористайтеся аргументом `<назва>`.
zh_hans: 如果不添加任何参数， `toolbox create` 会自动为容器命名。如果需要创建多个容器，使用 `<name>` 参数为容器命名。

source: To use a specific version of the host system (e.g., Fedora 32 on Fedora 34), use the `--release <release> | -r <release>` option.
pt_br: Para usar uma versão específica do sistema host (por exemplo, Fedora 32 no Fedora 34), use a opção `--release <lançamento> | -r <lançamento>`.
uk: Щоб використатися вказану версію основної системи (наприклад, Fedora 32 у Fedora 34), скористайтеся параметром `--release <випуск> | -r <випуск>`.
zh_hans: 如果你希望指定映像搭载发行版的版本（例如你希望在 Fedora 34 上获取 Fedora 32 的映像），使用 `--release <release> | -r <release>` 选项。

source: To use a different distribution to create a toolbox container (e.g., RHEL on Fedora, use the `--distro <distro> | -d <distro>` option.
uk: Щоб скористатися іншим дистрибутивом для створення контейнера toolbox (наприклад, RHEL у Fedora), скористайтеся параметром `--distro <дистрибутив> | -d <дистрибутив>`.
zh_hans: 要想使用其他发行版的映像创建 Toolbox 容器（例如在 Fedora 上使用 RHEL 的映像），使用 `--distro <distro> | -d <distro>` 选项。

source: To use a different image, use the ``--image <name> | -i <name>`` option.
pt_br: Para usar uma imagem diferente, use a opção ``--image <nome> | -i <nome>``.
uk: Щоб використати інший образ, скористайтеся параметром `--image <назва> | -i <назва>`.
zh_hans: 要使用不同的映像文件，使用 ``--image <name> | -i <name>`` 选项。

source: toolbox enter [options] <name>
pt_br: toolbox enter [opções] <nome>
uk: toolbox enter [параметри] <назва>

source: Enters a toolbox for interactive use. Used without options, `toolbox enter` opens the default toolbox.
uk: Увійти до контейнера toolbox для інтерактивного користування. Якщо команду віддано без параметрів, `toolbox enter` відкриває типовий контейнер toolbox.
zh_hans: 进入容器以作交互使用。如果不添加任何参数， `toolbox enter` 会打开默认的 Toolbox 容器。

source: To enter a toolbox with specific name, use the `name` argument.
pt_br: Para inserir uma toolbox com um nome específico, use o argumento `nome`.
uk: Щоб вказати toolbox із певною назвою, скористайтеся аргументом `назва`.
zh_hans: 如果你有多个容器，可以使用 `name` 指定你需要进入的容器。

source: To enter a toolbox for a different distribution (e.g., Fedora on RHEL), use the `--distro <distro> |-d <distro>` option.
pt_br: Para inserir uma toolbox para uma distribuição diferente (por exemplo, Fedora no RHEL), use a opção `--distro <distro> | -d <distro>`.
uk: Щоб увійти до toolbox для іншого дистрибутива (наприклад, Fedora у RHEL), скористайтеся параметром `--distro <дистрибутив> |-d <дистрибутив>`.
zh_hans: 要想指定你要进入容器的发行版（例如在 RHEL 使用 Fedora 的 Toolbox），使用 `--distro <distro> |-d <distro>` 选项。

source: To enter a toolbox with specific version (e.g., RHEL 8.1 on RHEL 8.3), use the `--release <release> | -r <release>` option.
pt_br: Para entrar em uma toolbox com uma versão específica (por exemplo, RHEL 8.1 no RHEL 8.3), use o método `--release <lançamento> | opção -r <lançamento> `.
uk: Щоб увійти до toolbox із визначенням певної версії (наприклад, RHEL 8.1 у RHEL 8.3), скористайтеся параметром `--release <випуск> | -r <випуск>`.
zh_hans: 要想指定你要进入容器的版本（例如在 RHEL 8.3 使用 RHEL 8.1 的 Toolbox），使用 `--release <release> | -r <release>` 选项。

source: toolbox run [options] <cmd> <arg ...>
pt_br: toolbox run [opções] <cmd> <arg ...>
uk: toolbox run [параметри] <команда> <аргумент ...>

source: Runs a command in a toolbox without entering it. Used without options, `toolbox run` runs the command in the default toolbox.
uk: Виконує команду у toolbox, без входу до нього. Якщо команду віддано без параметрів, `toolbox run` запускає команду у типовому контейнері toolbox.
zh_hans: 在容器环境中执行特定命令，但不进入容器。如果不添加任何参数， `toolbox run` 会在默认的 Toolbox 容器执行你的命令。

source: To run a command in a toolbox with specific name, use the `--container <name> | -c <name>` option.
pt_br: Para executar um comando em uma toolbox com um nome específico, use o método `--container <nome> | opção -c <nome> `.
uk: Щоб запустити програму у toolbox із визначенням певної назви контейнера, скористайтеся параметром `--container <назва> | -c <назва>`.
zh_hans: 如果你有多个容器，可以使用 `--container <name> | -c <name>` 指定你需要使用的容器。

source: To run a command in a toolbox for a different distribution (e.g., Fedora on RHEL), use the `--distro <distro> |-d <distro>` option.
pt_br: Para executar um comando em uma toolbox para uma distribuição diferente (por exemplo, Fedora no RHEL), use a opção `--distro <distro> | -d <distro>`.
uk: Щоб запустити програму у toolbox для іншого дистрибутива (наприклад, Fedora у RHEL), скористайтеся параметром `--distro <дистрибутив> |-d <дистрибутив>`.
zh_hans: 要想指定执行命令所用容器的发行版（例如在 RHEL 使用 Fedora 的 Toolbox），使用 `--distro <distro> |-d <distro>` 选项。

source: To run a command in a toolbox with specific version (e.g., RHEL 8.1 on RHEL 8.3), use the `--release <release> | -r <release>` option.
pt_br: Para executar um comando em uma toolbox com versão específica (por exemplo, RHEL 8.1 no RHEL 8.3), use a opção `--release <lançamento> | -r <lançamento> `.
uk: Щоб запустити програму у toolbox із визначенням певної версії (наприклад, RHEL 8.1 у RHEL 8.3), скористайтеся параметром `--release <випуск> | -r <випуск>`.
zh_hans: 要想指定执行命令所用版本（例如在 RHEL 8.3 使用 RHEL 8.1 的 Toolbox），使用 `--release <release> | -r <release>` 选项。

source: toolbox list [options]
pt_br: toolbox list [opções]
uk: toolbox list [параметри]

source: Lists local toolbox images and containers.
pt_br: Lista contêineres e imagens de toolbox locais.
uk: Виводить список образів і контейнерів toolbox.
zh_hans: 列出本地可用的 Toolbox 容器和映像。

source: toolbox rm [options] <name ...>
pt_br: toolbox rm [opções] <nome ...>
uk: toolbox rm [параметри] <назва ...>

source: Removes one or more toolbox containers.
pt_br: Remove um ou mais contêineres de toolbox.
uk: Вилучає один або декілька контейнерів toolbox.
zh_hans: 移除一个或多个 Toolbox 容器。

source: The `--force | -f` option removes the marked containers even if they are running.
pt_br: A opção `--force | -f` remove os contêineres marcados mesmo se estiver em execução.
uk: Параметр `--force | -f` надає змогу вилучити позначені контейнери, навіть якщо їх запущено.
zh_hans: 使用 `--force | -f` 参数以强制删除正在运行的容器。

source: The `--all | -a` option removes all toolbox containers.
pt_br: A opção `--all | -a` remove todos os contêineres de toolbox.
uk: За допомогою параметра `--all | -a` можна вилучити усі контейнери toolbox.
zh_hans: `--all | -a` 选项将移除所有 Toolbox 容器。

source: toolbox rmi [options] <name ...>
pt_br: toolbox rmi [opções] <nome ...>
uk: toolbox rmi [параметри] <назва ...>

source: Removes one or more toolbox images.
pt_br: Remove uma ou mais imagens de toolbox.
uk: Вилучає один або декілька образів toolbox.
zh_hans: 移除一个或多个 Toolbox 映像。

source: The `--force | -f` option removes the marked images and all containers that have been created using the marked images.
pt_br: A opção `--force | -f` remove as imagens marcadas e todos os contêineres que foram criados usando as imagens marcadas.
uk: Параметр `--force | -f` надає змогу вилучити позначені образи і усі контейнери, які було створено з використанням позначених образів.
zh_hans: 如果需要移除指定映像的同时移除所有使用该映像创建的容器，使用 `--force | -f` 选项。

source: Shows Toolbox's manual page.
pt_br: Mostra a página de manual do Toolbox.
uk: Показує сторінку підручника з Toolbox.
zh_hans: 显示 Toolbox 帮助文档。

source: Exiting a toolbox
pt_br: Saindo de uma toolbox
uk: Вихід з toolbox
zh_hans: 离开 Toolbox 环境

source: To return to the host environment, either run `exit` or quit the current shell (typically Ctrl+D).
pt_br: Para retornar ao ambiente host, execute `exit` ou saia do shell atual (normalmente Ctrl+D).
uk: Щоб повернутися до середовища основної системи, або віддайте команду `exit`, або вийдіть з поточної оболонки (типово, Ctrl+D).
zh_hans: 要回到宿主环境，可以执行 `exit` 或者退出当前 Shell（也就是按下 Ctrl+D）。

source: Under the hood
pt_br: Debaixo do capô
uk: Під капотом
zh_hans: 背后实现

source: Toolbox uses the following technologies:
pt_br: O toolbox usa as seguintes tecnologias:
uk: У toolbox використано такі технології:
zh_hans: Toolbox 使用了下面的技术：

source: https://www.opencontainers.org/[OCI container images]
pt_br: https://www.opencontainers.org/[Imagens de contêiner OCI]
uk: https://www.opencontainers.org/[Образи контейнерів OCI]
zh_hans: https://www.opencontainers.org/[OCI 容器映像]

source: Contact and issues
pt_br: Contato e problemas
uk: Контакти і адреси для сповіщення про вади
zh_hans: 交流与沟通

source: To report issues, make suggestions, or contribute fixes, see https://github.com/containers/toolbox[toolbox's GitHub project].
pt_br: Para relatar problemas, fazer sugestões ou contribuir com correções, consulte https://github.com/containers/toolbox[projeto do toolbox no GitHub].
uk: Для повідомлень про вади, пропозицій та надсилання латок скористайтеся https://github.com/containers/toolbox[сторінкою проєкту toolbox на GitHub].
zh_hans: 要报告问题、提出建议、贡献代码修复，可以前往 https://github.com/containers/toolbox[Toolbox 在 GitHub 上的页面] 。

source: To get in touch with toolbox users and developers, use https://discussion.fedoraproject.org/[Fedora's Discourse instance], or join the #silverblue IRC channel on Freenode.
uk: Щоб зв'язатися із користувачами та розробниками toolbox, скористайтеся https://discussion.fedoraproject.org/[екземпляром Discourse Fedora] або каналом IRC #silverblue на сервері Freenode.
zh_hans: 要联系 Toolbox 用户和开发者，可以前往 https://discussion.fedoraproject.org/[Fedora 的 Discourse 论坛] ，或者加入 Freenode 的 #silverblue IRC 频道。

source: To only show containers, use the `--containers | -c` option.
pt_br: Para mostrar apenas contêineres, use o método `--containers | -c`.
zh_hans: 如果希望只列出容器，使用 `--containers | -c` 选项。

source: To only show images, use the `--images | -i` option.
pt_br: Para mostrar apenas imagens, use a opção `--images | -i`.
zh_hans: 如果希望只列出映像，使用 `--images | -i` 选项。

source: The `--all | -a` option removes all toolbox images.
pt_br: A opção `--all | -a` remove todas as imagens de toolbox.
zh_hans: `--all | -a` 选项将移除所有 Toolbox 映像。

source: To use a different distribution to create a toolbox container (e.g., RHEL on Fedora), use the `--distro <distro> | -d <distro>` option.
pt_br: Para usar uma distribuição diferente para criar um contêiner de toolbox (por exemplo, RHEL no Fedora), use a opção `--distro <distro> | -d <distro>`.

source: To get in touch with toolbox users and developers, use https://discussion.fedoraproject.org/[Fedora's Discourse instance], or join the #silverblue IRC channel on https://libera.chat/[Libera].
pt_br: Para entrar em contato com usuários e desenvolvedores do toolbox, use a https://discussion.fedoraproject.org/[instância do Discourse do Fedora], ou entre no canal IRC #silverblue no https://libera.chat/[Libera].
