Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/troubleshooting.po
Languages: pt_br, uk, zh_hans

source: https://github.com/containers/libpod/issues/3187[GitHub Issue]
pt_br: https://github.com/containers/libpod/issues/3187[Relatório no GitHub]
uk: https://github.com/containers/libpod/issues/3187[Запис вади на GitHub]

source: With certain versions of `podman`, trying to enter a toolbox will result in errors. You can fix this by resetting the permissions on the overlay-containers with the following command.
pt_br: Com certas versões do `podman`, tentar entrar em uma toolbox resultará em erros. Você pode corrigir isso redefinindo as permissões nos contêineres de sobreposição com o seguinte comando.
zh_hans: 在某些版本的 `podman` 下，尝试进入 Toolbox 容器时可能会报错。你可以使用下面的命令修正权限问题。

source: This will reset the permissions on your containers and allow you to enter them again.
pt_br: Isso redefinirá as permissões em seus contêineres e permitirá que você as insira novamente.
uk: Ця команда призведе до скидання прав доступу до ваших контейнерів і уможливлення входу до них.
zh_hans: 这会重置容器的权限设定以允许你重新进入容器。

source: Running `restorecon`
pt_br: Executando `restorecon`
uk: Віддайте команду `restorecon`
zh_hans: 执行 `restorecon`

source: You should never run `restorecon` on a Silverblue host. See the following bug for details - https://bugzilla.redhat.com/show_bug.cgi?id=1259018
pt_br: Você nunca deve executar `restorecon` em um host Silverblue. Veja o seguinte bug para detalhes - https://bugzilla.redhat.com/show_bug.cgi?id=1259018
zh_hans: 你不应该在 Silverblue 执行 `restorecon`。请查看相关问题报告了解详情 - https://bugzilla.redhat.com/show_bug.cgi?id=1259018

source: However, if you happened to do this, it is possible to recover.
pt_br: No entanto, se você fez isso, é possível se recuperar.
uk: Втім, якщо ви вже віддали цю команду, систему ще можна відновити.
zh_hans: 不过即使你不小心执行了这个，也是可以挽救的。

source: Boot with `enforcing=0` on the kernel command line
pt_br: Inicialize com `enforcing=0` na linha de comando do kernel
uk: Завантажте систему з `enforcing=0` у командному рядку ядра
zh_hans: 引导系统时使用 `enforcing=0` 参数

source: Create a new, "fixed" commit locally
pt_br: Crie um novo commit "fixo" localmente
uk: Створіть новий «виправний» внесок локально
zh_hans: 在本地创建一个新的修复好的提交

source: Deploy the new "fixed" commit
pt_br: Implante o novo commit "fixo"
uk: Розгорніть новий «виправлений» внесок
zh_hans: 部署这个提交

source: Run `restorecon`
pt_br: Execute `restorecon`
uk: Віддайте команду `restorecon`
zh_hans: 执行 `restorecon`

source: Reboot
pt_br: Reinicie
uk: Перезавантажте систему
zh_hans: 重启系统

source: Cleanup
pt_br: Faça uma limpeza
uk: Виконайте очищення системи
zh_hans: 执行清理工作

source: The caveat to this recovery is that your layered packages will be removed; you'll need to relayer them after the recovery.
pt_br: A advertência para essa recuperação é que seus pacotes em camadas serão removidos; você precisará retransmiti-los após a recuperação.
uk: Проблема такого способу відновлення полягає ту тому, що усі ваші нашаровані пакунки буде вилучено — вам доведеться знову нашарувати їх після відновлення.
zh_hans: 请注意在操作完成后，所有层叠的软件包会被删除；在恢复完成之后，你需要重新层叠它们。

source: See this upstream comment for additional details - https://github.com/ostreedev/ostree/issues/1265#issuecomment-484557615
pt_br: Veja este comentário upstream para detalhes adicionais - https://github.com/ostreedev/ostree/issues/1265#issuecomment-484557615
zh_hans: 查看上游的说明了解更多信息 - https://github.com/ostreedev/ostree/issues/1265#issuecomment-484557615

source: {variant-name} is a radically new way of deploying and managing your desktop operating system, so you may occasionally run into problems while going through your day to day. Below are some of the more common problems reported and any workarounds for those problems.
uk: {variant-name} є радикально новим способом розгортання вашої операційної системи для робочих станцій та керування нею. Через це у вас можуть виникати проблеми зі щоденним користуванням нею. Нижче наведено список найпоширеніших проблем та способів їхнього розв'язання.

source: "Forbidden base package replacements"
uk: "Пропущені замінники пакунків базової системи"
zh_hans: 软件包替换被禁止

source: Users have long wanted to use their Nvidia GPUs on their {variant-name} systems. Thankfully, recent changes to the `akmods` and `kmodtools` packages were made by https://twitter.com/gnomealex[Alex Larsson] to allow for normal installation of the Nvidia drivers.
uk: Користувачі вже давно прагнуть скористатися усіма можливостями графічних процесорів Nvidia у системах {variant-name}. На щастя, нещодавні зміни у пакунках `akmods` і `kmodtools`, які було внесено https://twitter.com/gnomealex[Alex Larsson], уможливлюють звичайне встановлення драйверів Nvidia.

source: As users work with {variant-name} day-to-day, it is possible that they have modified the default SELinux policy in an effort to workaround one or more problems related to SELinux. This is usually done when a user sees a SELinux denial in the journal. If this is the case and one wishes to revert back to the default SELinux policy, you can try these set of actions.
uk: Працюючи із {variant-name} щоденно, користувачі можуть внести зміни до типових правил SELinux з метою обійти якісь проблеми, які пов'язано із SELinux. Зазвичай, користувачі вдаються до змін, якщо бачать у журналі якусь відмову у доступі з боку SELinux. Якщо такі зміни було внесено, а треба повернутися до типових правил SELinux, можете скористатися наведеною нижче послідовністю дій.

source: This issue is most commonly seen when users have installed {variant-name} on Apple hardware. The `/boot/efi` partition on Apple hardware is formatted as HFS+ and is not always resilient to power failures or other kinds of hard power events.
uk: Ця проблема, здебільшого, виникає у користувачів, які встановлюють {variant-name} на апаратне забезпечення Apple. Розділ `/boot/efi` на обладнанні Apple форматовано як HFS+, і він не завжди стійкий до вимикання живлення та інших типів проблем із живленням.

source: Since {variant-name} now includes the `hfsplus-tools` package in the base compose, it has become relatively easy for users to workaround this kind of error.
uk: Оскільки до нової версії {variant-name} до базової композиції включено пакунок `hfsplus-tools`, користувачам тепер набагато простіше усувати проблеми такого типу.

source: Unable to install {variant-name} on EFI systems
uk: Не вдається встановити {variant-name} у системи з EFI

source: Users have reported that they cannot install {variant-name} on an EFI based system where they previously had another OS installed. The error that is often observed looks like:
uk: Користувачі повідомляли про неможливість встановити {variant-name} на засновані на EFI, де раніше було встановлено іншу операційну систему. Повідомлення про помилку, яке часто спостерігали, виглядало так:

source: Reformat the EFI partition on the host during the install process. This can be done by selecting "Custom Partitioning" and checking the `Reformat` box when creating the `/boot/efi` partition.
uk: Переформатуйте розділ EFI у основній системі під час процедури встановлення. Зробити це можна вибором варіанта «Нетиповий поділ на розділи» із наступним позначенням пункту «Переформатувати» при створенні розділу `/boot/efi`.

source: Choosing to reformat `/boot/efi` will likely result in the inability to boot any other operating systems that were previously installed. Be sure that you have backed up any important data before using this workaround.
uk: Вибір варіанта із переформатуванням `/boot/efi`, ймовірно, зробить неможливим завантаження будь-яких інших раніше встановлених операційних систем. Переконайтеся, що вами створено резервну копію будь-яких важливих даних, перш ніж користуватися цим варіантом.

source: As of `podman` version `1.4.0` this workaround is not necessary. Ensure `podman` is up to date by issuing `rpm-ostree upgrade` before attempting this workaround.
uk: З версії `podman` `1.4.0` потреби у цьому обхідному маневрі немає. Переконайтеся, що встановлено актуальну версію `podman`, віддавши команду `rpm-ostree upgrade`, перш ніж намагатися скористатися цим обхідним маневром.

source: The following workaround might be useful for other `toolbox` errors caused by `podman` versions greater than `1.2.0`. See https://github.com/debarshiray/toolbox/issues/169#issuecomment-495193902[Toolbox Github Repo]
uk: Наведений нижче варіант дій може бути корисним для інших помилок `toolbox`, які спричинено використанням версій `podman`, новіших за `1.2.0`. Див. https://github.com/debarshiray/toolbox/issues/169#issuecomment-495193902[сховища Toolbox на Github]

source: With certain versions of `podman`, trying to enter a toolbox will result in errors. You can fix this by resetting the permissions on the overlay-containers with the following command.
uk: У певних версіях `podman` спроба увійти до toolbox призводить до повідомлення про помилку. Виправити помилку можна скиданням прав доступу до накладених контейнерів за допомогою наведеної нижче команди.

source: You should never run `restorecon` on a {variant-name} host. See the following bug for details - https://bugzilla.redhat.com/show_bug.cgi?id=1259018
uk: Ніколи не запускайте `restorecon` у основній системі {variant-name}. Подробиці наведено у цьому звіті щодо вади: https://bugzilla.redhat.com/show_bug.cgi?id=1259018

source: See this upstream comment for additional details: https://github.com/ostreedev/ostree/issues/1265#issuecomment-484557615
uk: Подробиці можна знайти у описі цього внеску до сховища основного коду: https://github.com/ostreedev/ostree/issues/1265#issuecomment-484557615
