Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/troubleshooting.po
Languages: pt_br, uk, zh_hans

source: Troubleshooting
pt_br: Solução de problemas
uk: Усування проблем
zh_hans: 疑难解答

source: Silverblue is a radically new way of deploying and managing your desktop operating system, so you may occasionally run into problems while going through your day to day. Below are some of the more common problems reported and any workarounds for those problems.
pt_br: O Silverblue é uma forma radicalmente nova de implantar e gerenciar seu sistema operacional de desktop, então você pode ocasionalmente ter problemas ao passar por seu dia a dia. Abaixo estão alguns dos problemas mais comuns relatados e quaisquer soluções alternativas para esses problemas.
zh_hans: Silverblue 应用了全新的桌面操作系统部署与管理技术，所以在你日常使用时难免会遇到各种问题。我们在这里摘录了一部分问题列举如下。

source: https://github.com/projectatomic/rpm-ostree/issues/415[GitHub Issue]
pt_br: https://github.com/projectatomic/rpm-ostree/issues/415[Relatório no GitHub]
uk: https://github.com/projectatomic/rpm-ostree/issues/415[Запис вади на GitHub]

source: This can happen when a package that is being layered has a dependency on a package that is in the base OS. In the problematic case, the layered package requires a newer version of the dependent package which is not available in the base OS.
pt_br: Isso pode acontecer quando um pacote que está sendo colocado em camadas depende de um pacote que está no sistema operacional base. No caso problemático, o pacote em camadas requer uma versão mais recente do pacote dependente que não está disponível no sistema operacional base.
uk: Таке може трапитися, якщо нашарований пакунок має залежність від пакунка у базовій операційній системі. У проблемних випадках цей нашарований пакунок потребує новішої версії залежного пакунка, якої немає у базовій операційній системі.
zh_hans: 层叠软件包依赖于基本系统映像中的包时，有可能就会发生这种情况。层叠软件包需要更高版本的依赖软件包，基本系统映像中却无法提供。

source: In most cases, waiting for a newer OSTree compose will resolve this problem. The dependent package will be updated in the compose and the package that was going to be layered will be successful.
pt_br: Na maioria dos casos, esperar por uma composição de OSTree mais recente resolverá esse problema. O pacote dependente será atualizado na composição e o pacote que será colocado em camadas será bem-sucedido.
uk: У більшості випадків достатньо дочекатися новішої композиції OSTree для усування проблеми. Залежний пакунок буде оновлено у новій композиції, і нашарованим пакунком можна буде користуватися.
zh_hans: 大部分情况下，耐心等候新版本的 OSTree 构建就可以了，新的构建届时会提供正确版本的软件包，大多数情况下能解决问题。

source: However, if you continue to encounter this problem with a newer compose, you can try to cleanup the metadata with `rpm-ostree cleanup -m` and then retrying the `rpm-ostree install`.
pt_br: No entanto, se você continuar a encontrar esse problema com uma composição mais recente, pode tentar limpar os metadados com `rpm-ostree cleanup -m` e então tentar novamente a instalação do`rpm-ostree`.
uk: Втім, якщо проблема нікуди не зникне у новій композиції, ви можете спробувати вилучити усі метадані за допомогою команди `rpm-ostree cleanup -m`, а потім повторно спробувати виконати `rpm-ostree install`.
zh_hans: 如果你在更新到新版依然遇到相同的问题，你可以尝试使用 `rpm-ostree cleanup -m` 清理元数据信息然后重新 `rpm-ostree install`。

source: Alternatively, you can try rebasing to any `updates` ref, like `fedora/30/updates/x86_64` after the `cleanup` operation.
pt_br: Alternativamente, você pode tentar fazer o rebase para qualquer ref `updates`, como `fedora/30/updates/x86_64` após o `cleanup` operation.
uk: Крім того, ви можете спробувати перенести систему до будь-якого посилання `updates`, наприклад `fedora/30/updates/x86_64`, після дії `cleanup`.
zh_hans: 你也可以在 `cleanup` 操作后尝试变基到任意 `updates` 分支，例如 `fedora/30/updates/x86_64`。

source: Installing packages to `/opt` or `/usr/local`
pt_br: Instalando pacotes em `/opt` ou `/usr/local`
uk: Встановлення пакунків до `/opt` або `/usr/local`
zh_hans: 安装软件包到 `/opt` 或 `/usr/local`

source: https://github.com/projectatomic/rpm-ostree/issues/233[GitHub Issue]
pt_br: https://github.com/projectatomic/rpm-ostree/issues/233[Relatório no GitHub]
uk: https://github.com/projectatomic/rpm-ostree/issues/233[Запис вади на GitHub]

source: Installing into `/opt` was commonly raised as a problem when users where trying to install Google Chrome. A partial https://github.com/projectatomic/rpm-ostree/pull/1795[solution] has been implemented that allows users to layer Google Chrome, however it is not a complete solution for applications that write mutable data to `/opt`.
pt_br: A instalação em `/opt` costumava ser considerada um problema quando os usuários tentavam instalar o Google Chrome. Uma https://github.com/projectatomic/rpm-ostree/pull/1795[solução] parcial foi implementada que permite aos usuários colocar o Google Chrome em camadas, no entanto, não é uma solução completa para aplicativos que escrevem dados mutáveis em `/opt`.
uk: Встановлення до `/opt` є типовою проблемою, коли користувачі намагаються встановити Google Chrome. Було реалізовано часткове https://github.com/projectatomic/rpm-ostree/pull/1795[вирішення], яке уможливлює для користувачів нашаровування Google Chrome. Втім, це не може бути рішенням для програм, які записують придатні до зміни дані до `/opt`.
zh_hans: 在 `/opt` 安装软件包这个问题由一些尝试在 Silverblue 上安装 Google Chrome 的用户发起。尽管目前已经有了层叠 Google Chrome 的 https://github.com/projectatomic/rpm-ostree/pull/1795[临时解决方案]，然而在 `/opt` 写入可变数据依然是个大难题。

source: Using Nvidia drivers
pt_br: Usar drivers Nvidia
uk: Користування драйверами Nvidia
zh_hans: 使用 NVIDIA 驱动

source: https://github.com/projectatomic/rpm-ostree/issues/1091[GitHub Issue]
pt_br: https://github.com/projectatomic/rpm-ostree/issues/1091[Relatório no GitHub]
uk: https://github.com/projectatomic/rpm-ostree/issues/1091[Запис вади на GitHub]

source: Users have long wanted to use their Nvidia GPUs on their Silverblue systems. Thankfully, recent changes to the `akmods` and `kmodtools` packages were made by https://twitter.com/gnomealex[Alex Larsson] to allow for normal installation of the Nvidia drivers.
pt_br: Os usuários há muito tempo desejam usar suas placas de vídeo Nvidia em seus sistemas Silverblue. Felizmente, mudanças recentes nos pacotes `akmods` e `kmodtools` foram feitas por https://twitter.com/gnomealex[Alex Larsson] para permitir a instalação normal dos drivers da Nvidia.
zh_hans: 很多用户希望在 Silverblue 上使用他们的 NVIDIA GPU。值得庆幸的是，https://twitter.com/gnomealex[Alex Larsson] 已经对 `akmods` 和 `kmodtools` 软件包做出修改以允许用户安装 NVIDIA 驱动。

source: You can read more about the work that Alex did on his https://blogs.gnome.org/alexl/2019/03/06/nvidia-drivers-in-fedora-silverblue/[blog].
pt_br: Você pode ler mais sobre o trabalho que Alex fez em seu https://blogs.gnome.org/alexl/2019/03/06/nvidia-drivers-in-fedora-silverblue/[blog].
uk: Докладніше про виконану Алексом роботу можна дізнатися з його https://blogs.gnome.org/alexl/2019/03/06/nvidia-drivers-in-fedora-silverblue/[блогу].
zh_hans: 你可以在 Alex 的 https://blogs.gnome.org/alexl/2019/03/06/nvidia-drivers-in-fedora-silverblue/[博客] 了解更多相关信息。

source: SELinux problems
pt_br: Problemas com SELinux
uk: Проблеми із SELinux
zh_hans: SELinux 相关问题

source: As users work with Silverblue day-to-day, it is possible that they have modified the default SELinux policy in an effort to workaround one or more problems related to SELinux. This is usually done when a user sees a SELinux denial in the journal. If this is the case and one wishes to revert back to the default SELinux policy, you can try these set of actions.
pt_br: Como os usuários trabalham com o Silverblue no dia a dia, é possível que eles tenham modificado a política SELinux padrão em um esforço para contornar um ou mais problemas relacionados ao SELinux. Isso geralmente é feito quando um usuário vê uma negação do SELinux no diário. Se este for o caso e você desejar reverter para a política SELinux padrão, você pode tentar este conjunto de ações.
zh_hans: 有些 Silverblue 用户可能希望临时修改默认的 SELinux 策略，以解决与 SELinux 相关的问题。如果在修改后又希望恢复到默认的 SELinux 策略，则可以尝试下面的操作。

source: Check the state of the SELinux policy
pt_br: Verifique o estado da política SELinux
uk: Перевірте стан правил SELinux
zh_hans: 查看当前的 SELinux 策略

source: If anything is returned by this command, then your SELinux policy has been modified from the default.
pt_br: Se alguma coisa for retornada por este comando, então sua política SELinux foi modificada, estando diferente do padrão.
uk: Якщо унаслідок виконання цієї команди було виведено якісь повідомлення, ваші правила SELinux є відмінними від типових.
zh_hans: 如果执行这个命令有任何输出，那就意味着 SELinux 策略有被改动过。

source: Copy the default SELinux policy shipped in the OSTree compose
pt_br: Copie a política SELinux padrão enviada na composição OSTree
uk: Скопіюйте типові правила SELinux, які постачаються у композиції OSTree
zh_hans: 复制 OSTree 构建提供的 SELinux 默认策略

source: After doing this, the output from `ostree admin config-diff | grep policy` should no longer indicate the policy is modified.
pt_br: Depois de fazer isso, a saída de `ostree admin config-diff | grep policy` não deve mais indicar que a política foi modificada.
uk: Після виконання цієї дії у результаті команди `ostree admin config-diff | grep policy` не повинно лишитися нічого, що вказує на зміну правил.
zh_hans: 此时执行 `ostree admin config-diff | grep policy` 应该不会再有输出，也就意味着 SELinux 策略恢复成功。

source: If your policy still appears to be modified, you can try the following approach.
pt_br: Se sua política ainda parece ter sido modificada, você pode tentar a abordagem a seguir.
uk: Якщо команда повідомляє, що правила змінено, ви можете скористатися вказаним нижче підходом.
zh_hans: 如果恢复没有成功，还可以尝试下面的方法。

source: Remove the SELinux policy; copy in the default policy
pt_br: Remova a política SELinux; copie a política padrão
uk: Вилучіть правила SELinux; скопіюйте типові правила
zh_hans: 移除已有 SELinux 策略；添加默认策略

source: After this, the `ostree admin config-diff | grep policy` command should return no modifications.
pt_br: Depois disso, o comando `ostree admin config-diff | grep policy` não deve retornar modificações.
uk: Після цього команда `ostree admin config-diff | grep policy` має повідомити, що ніяких змін до правил внесено не було.
zh_hans: 此时执行 `ostree admin config-diff | grep policy` 应该不会再有输出。

source: Unable to add user to group
pt_br: Não é possível adicionar um usuário ao grupo
uk: Не вдається додати користувача до групи
zh_hans: 无法将用户添加到用户组

source: https://github.com/projectatomic/rpm-ostree/issues/29[GitHub Issue]
pt_br: https://github.com/projectatomic/rpm-ostree/issues/29[Relatório no GitHub]
uk: https://github.com/projectatomic/rpm-ostree/issues/29[Запис вади на GitHub]

source: https://github.com/projectatomic/rpm-ostree/issues/49[GitHub Issue]
pt_br: https://github.com/projectatomic/rpm-ostree/issues/49[Relatório no GitHub]
uk: https://github.com/projectatomic/rpm-ostree/issues/49[Запис вади на GitHub]

source: Due to how `rpm-ostree` handles user + group entries, it may not be possible to use `usermod -a -G` to add a user to a group successfully. Until the `rpm-ostree` moves to using `systemd sysusers`, users will have to populate the `/etc/group` file from the `/usr/lib/group` file before they can add themselves to the group. For example, if you wanted to add a user to the `libvirt` group:
pt_br: Devido à forma como `rpm-ostree` lida com entradas de usuário + grupo, pode não ser possível usar `usermod -a -G` para adicionar um usuário a um grupo com sucesso. Até que `rpm-ostree` passe a usar `systemd sysusers`, os usuários terão que preencher o arquivo `/etc/group` do arquivo `/usr/lib/group` antes de poderem se adicionar ao grupo. Por exemplo, se você quiser adicionar um usuário ao grupo `libvirt`:
uk: Через спосіб, у який `rpm-ostree` обробляє записи «користувач + група», успішне додавання користувача до групи за допомогою `usermod -a -G` може стати неможливим. Аж доки `rpm-ostree` не буде переведено на використання `systemd sysusers`, користувачам доведеться заповнювати файл `/etc/group` на основі файла `/usr/lib/group`, перш ніж вони зможуть додати себе до групи. Наприклад, якщо вам потрібно додати користувача до групи `libvirt`:
zh_hans: 由于 `rpm-ostree` 的原因，`usermod -a -G` 是无法将用户添加到用户组的。在 `rpm-ostree` 使用 `systemd sysusers` 之前，用户必须先按照 `/usr/lib/group` 填写 `/etc/group`，然后才能将自己添加到组中。现在假设要将用户添加到 `libvirt` 组：

source: # grep -E '^libvirt:' /usr/lib/group >> /etc/group # usermod -aG libvirt username
pt_br: # grep -E '^libvirt:' /usr/lib/group >> /etc/group # usermod -aG libvirt nome-de-usuário

source: You will need to log off and log back in to apply these changes.
pt_br: Você precisará fazer logoff e logon novamente para aplicar essas alterações.
uk: Для застосування цих змін вам доведеться вийти з облікового запису і увійти до нього знову.
zh_hans: 你需要注销并重新登录来应用这些更改。

source: `ostree fsck` reports file corruption
pt_br: `ostree fsck` relata arquivo corrompido
uk: `ostree fsck` повідомляє про пошкодження файла
zh_hans: `ostree fsck` 提示文件受损

source: It is possible to end up in a situation where one or more files on the disk have become corrupted or missing. In this case, `ostree fsck` will report errors in certain commits. The https://github.com/ostreedev/ostree/pull/345#issuecomment-262263824[workaround] in this case is to mark the entire OSTree commit as partially retrieved and then re-pull the commit.
pt_br: É possível acabar em uma situação em que um ou mais arquivos no disco foram corrompidos ou estão faltando. Neste caso, `ostree fsck` relatará erros em certos commits. A https://github.com/ostreedev/ostree/pull/345#issuecomment-262263824[solução alternativa] neste caso é marcar todo o commit OSTree como parcialmente recuperado e, em seguida, extrair novamente o commit.
uk: Може таке статися, що один або декілька файлів на диску буде пошкоджено або знищено. У такому випадку `ostree fsck` повідомлятиме про помилки у певних внесках. https://github.com/ostreedev/ostree/pull/345#issuecomment-262263824[Обхідним маневром] у цьому випадку є позначення усього внеску OSTree як частково отриманого і повторне отримання цього внеску.
zh_hans: 当磁盘上有一个或多个文件损坏或丢失时， `ostree fsck` 就会报告错误。https://github.com/ostreedev/ostree/pull/345#issuecomment-262263824[解决方法] 则是将有关的 OSTree 提交标记为部分检索，然后重新拉取提交。

source: Read-only `/boot/efi` prevents any upgrades
pt_br: `/boot/efi` somente leitura impede quaisquer atualizações
uk: Захист від запису `/boot/efi` заважає будь-якому оновленню
zh_hans: `/boot/efi` 只读导致所有更新被阻断

source: https://github.com/projectatomic/rpm-ostree/issues/1380[GitHub Issue]
pt_br: https://github.com/projectatomic/rpm-ostree/issues/1380[Relatório no GitHub]
uk: https://github.com/projectatomic/rpm-ostree/issues/1380[Запис вади на GitHub]

source: This issue is most commonly seen when users have installed Silverblue on Apple hardware. The `/boot/efi` partition on Apple hardware is formatted as HFS+ and is not always resilient to power failures or other kinds of hard power events.
pt_br: Esse problema é mais comumente visto quando os usuários instalam o Silverblue em hardware Apple. A partição `/boot/efi` no hardware da Apple é formatada como HFS+ e nem sempre é resiliente a falhas de energia ou outros tipos de eventos impactantes de energia.
zh_hans: 在苹果设备上 Silverblue 很有可能会出现这样的问题。苹果设备上的 `/boot/efi` 分区的文件系统是 HFS+，这一文件系统不一定能很好地处理各种电源事件。

source: Since Silverblue now includes the `hfsplus-tools` package in the base compose, it has become relatively easy for users to workaround this kind of error.
pt_br: Como o Silverblue agora inclui o pacote `hfsplus-tools` na composição base, tornou-se relativamente fácil para os usuários contornar esse tipo de erro.
zh_hans: Silverblue 映像中已经默认提供了 `hfsplus-tools` 软件包，所以处理起此类问题应该还是很容易的。

source: See the linked issue for additional details.
pt_br: Consulte o relatório no link para obter detalhes adicionais.
uk: Див. додаткові подробиці можна дізнатися за вказаним посиланням.
zh_hans: 你可以查看与本节相关联的 Issue 以了解更多信息。

source: Unable to install Silverblue on EFI systems
pt_br: Não é possível instalar Silverblue em sistemas EFI
zh_hans: 无法在 EFI 系统安装 Silverblue

source: https://bugzilla.redhat.com/show_bug.cgi?id=1575957[Bugzilla Issue]
pt_br: https://bugzilla.redhat.com/show_bug.cgi?id=1575957[Relatório no Bugzilla]
uk: https://bugzilla.redhat.com/show_bug.cgi?id=1575957[Запис вади у Bugzilla]

source: Users have reported that they cannot install Silverblue on an EFI based system where they previously had another OS installed. The error that is often observed looks like:
pt_br: Os usuários relataram que não conseguem instalar o Silverblue em um sistema baseado em EFI onde anteriormente tinham outro sistema operacional instalado. O erro que é frequentemente observado é o seguinte:
zh_hans: 当你的设备曾经安装过其它操作系统，在安装 Silverblue 的时候可能会得到下面的报错：

source: A couple of possible workarounds exist:
pt_br: Existem algumas soluções alternativas possíveis:
uk: Існує декілька можливих вирішень:
zh_hans: 解决方案有下面几个：

source: During the install process, select "Custom Partitioning" and create an additional EFI partition. Assign the newly created EFI partition to `/boot/efi`. You will then be able to boot the previous OS(s) alongside Fedora Silverblue. If this workaround is not successful follow the below step.
pt_br: Durante o processo de instalação, selecione "Particionamento personalizado" e crie uma partição EFI adicional. Atribua a partição EFI recém-criada a `/boot/efi`. Você poderá então inicializar o(s) sistema(s) operacional(is) anterior(es) junto com o Fedora Silverblue. Se esta solução alternativa não for bem-sucedida, siga a etapa abaixo.
zh_hans: 安装的时候选择手动分区并划分一个额外的 EFI 分区并挂载到`/boot/efi`。这样子就可以使 Fedora Silverblue 与你之前安装的操作系统共存。如果这样做不奏效，那么还有另一种方法。

source: Reformat the EFI partition on the host during the install process. This can be done by selecting "Custom Partitioning" and checking the `Reformat` box when creating the `/boot/efi` partition.
pt_br: Reformate a partição EFI no host durante o processo de instalação. Isso pode ser feito selecionando "Particionamento personalizado" e marcando a caixa `Reformatar` ao criar a partição`/boot/efi`.
zh_hans: 安装的时候选择手动分区，挂载 `/boot/efi` 分区的时候勾选格式化选项以格式化 EFI 分区。

source: Choosing to reformat `/boot/efi` will likely result in the inability to boot any other operating systems that were previously installed. Be sure that you have backed up any important data before using this workaround.
pt_br: A escolha de reformatar `/boot/efi` provavelmente resultará na incapacidade de inicializar qualquer outro sistema operacional que tenha sido instalado anteriormente. Certifique-se de ter feito backup de todos os dados importantes antes de usar esta solução alternativa.
zh_hans: 格式化 `/boot/efi` 可能会使以前安装的操作系统无法被引导。在使用此解决方法之前，请确认你已经备份一切重要数据。

source: As of `podman` version `1.4.0` this workaround is not necessary. Ensure `podman` is up to date by issuing `rpm-ostree upgrade` before attempting this workaround.
pt_br: A partir do `podman` versão `1.4.0`, esta solução alternativa não é necessária. Certifique-se de que o `podman` esteja atualizado emitindo`rpm-ostree upgrade` antes de tentar esta solução alternativa.
zh_hans: 如果 `podman` 版本大于或等于 `1.4.0`，下面的解决措施可能不是必要的。在尝试下面的方案前请通过 `rpm-ostree upgrade` 确认 `podman` 是最新的。

source: When issuing the `toolbox list` command, systems using `podman` versions newer than `1.2.0`, will generate the following error:
pt_br: Ao emitir o comando `toolbox list`, os sistemas que usam versões de `podman` mais recentes que `1.2.0`, irão gerar o seguinte erro:
uk: Якщо віддати команду `toolbox list`, системи, у яких встановлено `podman` версій, новіших за `1.2.0`, призведе до такого повідомлення про помилку:
zh_hans: 如果你的 `podman` 版本大于或等于 `1.2.0`，在执行 `toolbox list` 时可能会得到下面的报错：

source: The following workaround might be useful for other `toolbox` errors caused by `podman` versions greater than `1.2.0`. See https://github.com/debarshiray/toolbox/issues/169#issuecomment-495193902[Toolbox Github Repo]
pt_br: A seguinte solução alternativa pode ser útil para outros erros do `toolbox` causados por versões do `podman` superiores a `1.2.0`. Veja o https://github.com/debarshiray/toolbox/issues/169#issuecomment-495193902[repositório no GitHub do Toolbox]
zh_hans: 下面的解决措施可能也适用于其它因 `1.2.0` 或更高版本的 `toolbox` 导致的 `toolbox` 报错。详见 https://github.com/debarshiray/toolbox/issues/169#issuecomment-495193902[Toolbox Github 仓库]

source: As a workaround, it is possible to override `podman` packages newer than version `1.2.0` by issuing:
pt_br: Como solução alternativa, é possível substituir os pacotes `podman` mais recentes que a versão `1.2.0` emitindo:
uk: Обійти цю проблему можна заміною пакунків `podman`, які є новішими за версію `1.2.0`, за допомогою такої команди:
zh_hans: 作为一个解决措施，执行下面的命令替换 `podman` 软件包：

source: Reboot the system to apply the changes.
pt_br: Reinicialize o sistema para aplicar as alterações.
uk: Перезавантажте систему для застосування змін.
zh_hans: 重启系统使改动生效。

source: For reference, it is also possible to override the package by following these steps:
pt_br: Para referência, também é possível substituir o pacote seguindo estas etapas:
uk: Просто для довідки, замінити пакунок на якусь іншу версію можна за допомогою таких кроків:
zh_hans: 当然你可以遵循下面的步骤完成软件包的替换：

source: Download `podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm` from https://kojipkgs.fedoraproject.org//packages/podman/1.2.0/2.git3bd528e.fc30/x86_64/podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm[Koji]
pt_br: Baixe `podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm` do https://kojipkgs.fedoraproject.org//packages/podman/1.2.0/2.git3bd528e.fc30/x86_64/podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm[Koji]
uk: Отримайте `podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm` з https://kojipkgs.fedoraproject.org//packages/podman/1.2.0/2.git3bd528e.fc30/x86_64/podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm[Koji]
zh_hans: 从 https://kojipkgs.fedoraproject.org//packages/podman/1.2.0/2.git3bd528e.fc30/x86_64/podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm[Koji] 下载 `podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm`

source: Remove `podman-manpages` issuing: `rpm-ostree override remove podman-manpages`
pt_br: Remova `podman-manpages` executando: `rpm-ostree override remove podman-manpages`
uk: Вилучіть `podman-manpages` за допомогою такої команди: `rpm-ostree override remove podman-manpages`
zh_hans: 移除 `podman-manpages`：`rpm-ostree override remove podman-manpages`

source: Override the currently installed `podman` package (using the package you have downloaded on the first step) by: `rpm-ostree override replace podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm`
pt_br: Substitua o pacote `podman` atualmente instalado (usando o pacote que você baixou na primeira etapa) por: `rpm-ostree override replace podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm`
uk: Замінити поточну встановлену версію пакунка `podman` (на пакунок, який ви отримали на першому кроці) можна за допомогою такої команди: `rpm-ostree override replace podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm`
zh_hans: 使用第一步下载的包替换当前已安装的 `podman`：`rpm-ostree override replace podman-1.2.0-2.git3bd528e.fc30.x86_64.rpm`

source: You can now reboot the system for the change to take effect.
pt_br: Agora você pode reiniciar o sistema para que a alteração tenha efeito.
uk: Після цього систему можна перезавантажити, щоб зміни набули чинності.
zh_hans: 现在重启系统使改动生效。

source: To revert this workaround issue the following command:
pt_br: Para reverter esta solução alternativa, execute o seguinte comando:
uk: Щоб повернути усе до типового стану, віддайте таку команду:
zh_hans: 要撤销上面的改动，执行：

source: Unable to enter a toolbox due to permissions errors
pt_br: Não é possível entrar em uma toolbox devido a erros de permissão
uk: Не вдається увійти до toolbox через помилки із правами доступу
zh_hans: 因权限原因无法进入 Toolbox 容器
