Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/updates-upgrades-rollbacks.po
Languages: pt_br, uk, zh_hans

source: Updates, Upgrades & Rollbacks
pt_br: Atualizações & reversões
uk: Оновлення пакунків, оновлення системи та повернення до попередніх версій
zh_hans: 更新、升级与回滚

source: Installing updates with {variant-name} is easy and fast. It also has a special rollback feature, in case anything goes wrong. Additionally, you can choose to have multiple versions of your operating system installed at all times, and you can choose which one to boot into whenever you start up your system.
uk: Встановлення оновлень у {variant-name} є простим і швидким. Також передбачено особливу можливість повернення до попередніх версій, якщо щось піде не так. Крім того, ви можете мати одночасно встановленими декілька версій вашої операційної системи, і ви можете вибирати потрібну вам версію під час запуску системи.

source: Updating {variant-name}
uk: Оновлення {variant-name}

source: OS updates in {variant-name} are fully integrated into the desktop; you will be automatically notified when an update is available. The standard behavior is to automatically download the update (this can be changed from the update preferences in Software).
uk: Оновлення операційної системи у {variant-name} повністю інтегровано до стільничного середовища. Система автоматично повідомить вам про доступність оновлень. Стандартною поведінкою є автоматичне отримання оновлень (змінити цю поведінку можна у налаштуваннях оновлень у програмі «Програми»).

source: Once an update is ready, it is just a matter of rebooting to start using the new version. There is no waiting for the update to be installed during this reboot.
uk: Щойно встановлення оновлень буде завершено, достатньо буде перезавантажити систему, щоб почати користуватися новою версією. Потреби у очікуванні на оновлення під час перезавантаження немає.

source: If you'd prefer, it is also possible to update using the command line. To do this, run:
uk: Якщо ви хочете, оновлення можна ініціювати за допомогою командної оболонки. Для цього віддайте таку команду:

source: This will check for new updates and download and install them if they are available. Alternatively, to check for available updates without downloading them, run:
uk: У відповідь на цю команду система виконає пошук оновлень, отримає і встановить їх, якщо оновлення буде виявлено. Іншим варіантом є пошук доступних оновлень без їхнього отримання:

source: Upgrading between major versions
pt_br: Atualizando entre as versões principais
uk: Оновлення до новіших версій системи
zh_hans: 主要版本间升级

source: Upgrading between major versions (such as from Fedora 35 to Fedora 36) can be completed using the Software application. Alternatively, {variant-name} can be upgraded between major versions using the `ostree` command.
uk: Оновлення до новіших версій (наприклад, з Fedora 35 до Fedora 36) можна здійснити за допомогою програми «Програмне забезпечення». Крім того, оновити {variant-name} до нової основної версії можна за допомогою команди `ostree`.

source: Skipping major releases is currently untested and is thus not supported. You should update only one major release at a time, i.e. from Fedora 35 to 36, etc.
uk: Пропускання основних випусків у поточній версії не перевірялося, а отже, його підтримку не передбачено. Вам слід послідовно оновлюватися до кожного наступного випуску, тобто з Fedora 35 до 36 тощо.

source: First, make sure that you are running the latest update for the current version:
uk: По-перше, переконайтеся, що ви працюєте із найсвіжішим оновленням поточної версії:

source: Reboot your system if needed. Then, verify that the branch for the next major version is available. You can print all available branches for {variant-name} with this command:
uk: Перезавантажте систему, якщо це потрібно. Далі, перевірте доступність гілки наступної основної версії. Ви можете переглянути усі доступні гілки для {variant-name} за допомогою такої команди:

source: After you've verified the name of your branch, you are ready to proceed. For example, to upgrade to {variant-name} {version}, the command is:
uk: Після того, як ви перевірите назву вашої гілки, можна продовжувати встановлення. Наприклад, для оновлення до {variant-name} {version} слід скористатися такою командою:

source: Currently, the default remote for {variant-name} {version} is named `fedora`. If this is not the case for your system, you can find out the remote name by issuing: `ostree remote list`.
uk: У поточній версії віддалене сховище {variant-name} {version} має назву `fedora`. Якщо це не так у вашій системі, ви можете визначити назву віддаленого сховища за допомогою такої команди: `ostree remote list`.

source: The process is very similar to a system update: the new OS is downloaded and installed in the background, and you just boot into it when it is ready.
pt_br: O processo é muito semelhante a uma atualização do sistema: o novo sistema operacional é baixado e instalado em segundo plano, e você apenas inicializa quando estiver pronto.
uk: Процедура є дуже подібною до оновлення системи: нова операційна система отримується і встановлюється у фоновому режимі. Після встановлення вам треба просто завантажити нову систему.
zh_hans: 版本间的升级和普通的更新是非常相似的：新版系统被下载到后台，你只需重启系统就可以启动新系统。

source: Additionally, you can choose to rebase to a different immutable variant of Fedora, like for example Fedora Kinoite. Fedora Kinoite is similar to {variant-name}, except for the fact that it uses the KDE Plasma desktop environment instead of the default GNOME desktop environment.
uk: Ви також можете переходити до іншого незмінного варіанта Fedora, наприклад Fedora Kinoite. Kinoite є подібним до {variant-name}, але у ньому використано середовище Плазми KDE, а не типове стільничне середовище GNOME.

source: What this means is, you can rebase to Fedora Kinoite to try it out, without ever touching your current system. Because the two system images are isolated from eachother, the two desktop environments will never be installed at the same time. All of your flatpak apps and /home files will stay persistent between rebases. Same applies for testing out the bleeding-edge version of {variant-name}, which is Rawhide.
uk: Це означає, що ви можете перейти до Fedora Kinoite, щоб спробувати нову систему, не вносячи ніяких змін до вашої поточної системи. Оскільки два образи систем є ізольованими один від одного, два стільничних середовища ніколи не буде встановлено одночасно. Усі ваші програми flatpak і файли у /home лишатимуться незмінним між переходами. Те саме стосується тестування найновішої версії {variant-name}, якою є Rawhide.

source: If you decide to rebase, make sure to https://docs.fedoraproject.org/en-US/fedora-silverblue/faq/#_about_using_silverblue[pin] your current deployment, so you don't accidentaly lose it (by default, only the two most recent deployments are kept).
uk: Якщо ви захочете здійснити перехід, не забудьте https://docs.fedoraproject.org/uk/fedora-silverblue/faq/#_about_using_silverblue[пришпилити] вашу поточну розгорнуту систему, щоб не втратити її випадково (типово буде збережено лише два найсвіжіших розгортання).

source: Rolling back
pt_br: Revertendo
uk: Відновлення попередньої версії
zh_hans: 回滚

source: {variant-name} keeps a record of the previous OS version, which can be switched to instead of the latest version. While this shouldn't usually be necessary, it can be helpful if there is a problem with an update or an upgrade (rollbacks work the same way for both), as well as for development purposes.
uk: {variant-name} зберігає запис попередньої версії операційної системи, до якої можна повернутися замість останньої версії. Хоча потреби у таких діях, зазвичай, немає, повернення до попередньої версії може бути корисним, якщо виникають проблеми із оновленням частини або усієї системи (повернення до попередньої версії працює однаково для обох випадків), а також якщо виникає потреба, яку пов'язано із розробкою програмного забезпечення.

source: There are two ways to roll back to the previous version:
pt_br: Existem duas maneiras de reverter para a versão anterior:
uk: Існує два способи повернення до попередньої версії:
zh_hans: 回滚到旧版本有两种方法：

source: Temporary rollbacks: to temporarily roll back to a previous version, simply reboot and select the previous version from the boot menu (often known as the grub menu).
pt_br: Reversões temporárias: para reverter temporariamente para uma versão anterior, simplesmente reinicie e selecione a versão anterior no menu de inicialização (geralmente conhecido como menu grub).
uk: Тимчасове повернення до попередньої версії: щоб тимчасово повернутися до попередньої версії, просто перезавантажте систему і виберіть пункт попередньої версії у меню завантаження (яке часто називають меню grub).
zh_hans: 临时回滚：要临时地切换到上一版的系统，只需要重启并在启动选单（也就是 GRUB 引导菜单）中选择旧版系统就可以了。

source: Permanent rollbacks: to permanently switch back to the previous deployment, use the `rpm-ostree rollback` command.
pt_br: Reversões permanentes: para voltar permanentemente à implementação anterior, use o comando `rpm-ostree rollback`.
uk: Стале повернення до попередньої версії: щоб на тривалий час повернутися до попередньої встановленої версії, скористайтеся командою `rpm-ostree rollback`.
zh_hans: 永久回滚：要回滚到旧版本并希望回滚持续生效，你可以使用 `rpm-ostree rollback` 命令。

source: After rolling back, you will technically be on an old OS version, and may be prompted to update. Updating will undo the rollback, so should be avoided if you want the rollback to stay in effect.
uk: Після повернення до попередньої версії технічно ви матимете справу із застарілою версією операційної системи, яка може надсилати запити щодо свого оновлення. Оновлення призведе до скасовування повернення до попередньої версії, тому вам не слід ним користуватися, якщо ви хочете продовжувати працювати із застарілою версією.

source: Installing updates with Silverblue is easy and fast (much faster than other operating systems). It also has a special rollback feature, in case anything goes wrong.
pt_br: Instalar atualizações com o Silverblue é fácil e rápido (muito mais rápido do que outros sistemas operacionais). Ele também possui um recurso especial de reversão, caso algo dê errado.
zh_hans: 为 Silverblue 安装更新是既方便又快捷的。万一更新出现问题时，Silverblue 还有回滚功能。

source: Updating Silverblue
pt_br: Atualizando o Silverblue
zh_hans: 更新 Silverblue

source: OS updates in Silverblue are fully integrated into the desktop; you will be automatically notified when an update is available. The standard behavior is to automatically download the update (this can be changed from the update preferences in Software).
pt_br: As atualizações do sistema operacional no Silverblue são totalmente integradas ao ambiente; você será notificado automaticamente quando uma atualização estiver disponível. O comportamento padrão é baixar automaticamente a atualização (isso pode ser alterado nas preferências de atualização no Programas).
zh_hans: Silverblue 的更新已经集成到了桌面中；当更新可用你就会收到相关的通知。在默认设置下更新会被自动下载（在 GNOME 商店中可以修改这一设定）。

source: Once an update is ready, it is just a matter of rebooting to start using the new version. There is no waiting for the update to be installed during this reboot.
pt_br: Assim que uma atualização estiver pronta, basta reiniciar para começar a usar a nova versão. Não há espera para que a atualização seja instalada durante a reinicialização.
zh_hans: 当更新准备就绪，只需要重启系统就可以使用新版本。重启时不需要耗费额外的时间以应用更新。

source: If you'd prefer, it is also possible to update using the command line. To do this, run:
pt_br: Se preferir, também é possível atualizar usando a linha de comando. Para fazer isso, execute:
zh_hans: 当然，你也可以在命令行下执行更新：

source: This will check for new updates and download and install them if they are available. Alternatively, to check for available updates without downloading them, run:
pt_br: Isso irá verificar se há novas atualizações e fazer o download e instalá-las se estiverem disponíveis. Como alternativa, para verificar as atualizações disponíveis sem baixá-las, execute:
zh_hans: 这会检查更新并在更新可用时立刻获取它们。如果你只希望检查更新而不希望执行下载：

source: First, verify the branch is available. You can print all available branches with this command:
pt_br: Primeiro, verifique se o ramo está disponível. Você pode imprimir todos os ramos disponíveis com este comando:
zh_hans: 首先，确认你需要的分支是可用的。要列出所有可用的分支，执行：

source: After you verify the name of your branch, you are ready to proceed. For example, to upgrade to Silverblue 33, the command is:
zh_hans: 在确认分支的名称后，就可以继续了。假设你希望升级到 Silverblue 33，那么执行：

source: Silverblue keeps a record of the previous OS version, which can be switched to instead of the latest version. While this shouldn't usually be necessary, it can be helpful if there is a problem with an update or an upgrade (rollbacks work the same way for both), as well as for development purposes.
pt_br: Silverblue mantém um registro da versão anterior do sistema operacional, à qual pode ser alternada em vez da versão mais recente. Embora isso geralmente não seja necessário, pode ser útil se houver um problema com uma atualização de programa ou de versão principal (reversões funcionam da mesma maneira para ambos), bem como para fins de desenvolvimento.
zh_hans: Silverblue 保留了上一版系统的备份，你可以随时从新版系统切换回去。尽管通常情况我们用不上这一特性，但当更新或版本间升级出现问题，回滚功能就会派上用场。

source: After rolling back, you will technically be on an old OS version, and may be prompted to update. Updating will undo the rollback, so should be avoided if you want the rollback to stay in effect.
pt_br: Depois de reverter, você estará tecnicamente em uma versão antiga do sistema operacional e pode ser solicitado a atualizar. A atualização desfará a reversão, portanto, deve ser evitada se você quiser que a reversão permaneça em vigor.
zh_hans: 当回滚完成后，在技术角度你就回到了旧版的系统，这时候系统可能会提示你更新。更新会导致回滚操作被撤销，所以要使回滚操作持续生效就得避免更新。
