Repository: bobby285271/fedora-docs-l10n-fedora-silverblue
Catalog: po/*/master/pages/upgrades.po
Languages: uk

source: Upgrades and Rollbacks
uk: Оновлення та повернення до попередніх версій

source: [[upgrading-the-os]] Upgrading the OS
uk: [[upgrading-the-os]] Оновлення операційної системи

source: To get updates for the OS, you can run: `rpm-ostree upgrade`. Starting with Fedora 28, gnome-software will also offer OS updates on Silverblue systems. Note that due to the atomic nature of the OS, you will have to reboot into the new image to have the updates take effect.
uk: Для отримання оновлень до вашої операційної системи ви можете скористатися такою командою: `rpm-ostree upgrade`. Починаючи з Fedora 28, gnome-software також пропонує встановити оновлення операційної системи у системах Silverblue. Зауважте, що через атомарну природу операційної системи, вам доведеться перезавантажити образ, щоб оновлення набули чинності.

source: If you just want to check for available updates, this command will do so: `rpm-ostree upgrade --check`. Starting with Fedora 28, gnome-software will also notify you about OS updates, just like it does on the traditional workstation.
uk: Якщо вам потрібно лише перевірити наявність оновлень, скористайтеся такою командою: `rpm-ostree upgrade --check`. Починаючи з Fedora 28, gnome-software також може сповіщати вас про оновлення операційної системи, подібно до того, як ця програма робить це для звичайних операційних систем.

source: Rebasing across new major versions
uk: Перехід між новими основними версіями

source: There were a substantial number of changes in Silverblue 29; see https://discussion.fedoraproject.org/t/changes-in-fedora-silverblue-29[this forum thread]. The high level is that the operating system was slimmed down significantly, dropping many applications as well as libvirt and docker.
uk: У Silverblue 29 було впроваджено суттєву кількість змін; див. https://discussion.fedoraproject.org/t/changes-in-fedora-silverblue-29[це обговорення на форумі]. На верхньому рівні, операційну систему було суттєво урізано, зокрема, було викинуто багато програм, а також libvirt та docker.

source: For desktop applications, it's recommended to use Flatpak; but you may also layer them back via `rpm-ostree install`.
uk: Для програм для робочих станцій рекомендовано використовувати Flatpak; але ви також можете встановлювати їх за допомогою `rpm-ostree install`.

source: If for example you want to continue using Docker instead of podman, you can run:
uk: Якщо, наприклад, ви хочете продовжувати користуватися Docker замість podman, ви можете віддати таку команду:

source: Similarly if you want to continue using libvirt, do the same with `libvirt`.
uk: Так само, якщо ви хочете надалі користуватися libvirt, зробіть те саме із `libvirt`.

source: To upgrade from Fedora Atomic Workstation 28 to Silverblue 29:
uk: Щоб оновити Fedora Atomic Workstation 28 до Silverblue 29, віддайте такі команди:

source: To upgrade from Fedora Silverblue 29 to Silverblue 30:
uk: Щоб оновити Fedora Silverblue 29 до Silverblue 30, достатньо таких команд:

source: The process is very similar to a system update: the new OS is downloaded and installed in the background, and you just boot into it when it is ready.
uk: Процедура є дуже подібною до оновлення системи: нова операційна система отримується і встановлюється у фоновому режимі. Після встановлення вам треба просто завантажити нову систему.

source: Just like system updates, rebases can be reversed: the previous deployment is still available, and you can boot back into it if there are any problems with the new OS.
uk: Так само, як і оновлення системи, переходи до іншої версії можна скасовувати: попередня розгорнута версія системи лишається доступною — ви можете завантажити її, якщо із новою версією системи виникають якісь проблеми.

source: We plan to have gnome-software offer the same functionality in Fedora 29 as well.
uk: Програма gnome-software пропонує ті самі функціональні можливості у Fedora 29.

source: Rolling Back the OS
uk: Повернення до попередньої версії операційної системи

source: rpm-ostree keeps two deployments around, which both have an entry in the grub menu. When you boot, you can choose the other entry to boot into the previous deployment.
uk: rpm-ostree зберігає одночасно дві розгорнуті версії системи, обидві з яких матимуть власні записи у меню grub. Під час завантаження ви можете вибрати інший пункт, щоб завантажити попередню версію системи.

source: To permanently switch back to the previous deployment, use the `rpm-ostree rollback` command.
uk: Щоб остаточно повернутися до попередньої версії системи, скористайтеся командою `rpm-ostree rollback`.

source: Update applications
uk: Оновлення програм

source: To update your Flatpak applications, you can run: `flatpak update`. gnome-software will also offer Flatpak application updates. Note that Flatpaks are independent of the base system, so you can install updates without a reboot, and just restart affected applications afterwards to get the new version.
uk: Щоб оновити ваші програми Flatpak, ви можете скористатися такою командою: `flatpak update`. gnome-software також пропонує оновлення програм з Flatpak. Зауважте, що програми з Flatpak є незалежними від базової системи, отже ви можете встановлювати їх без перезавантаження системи — достатньо перезапустити відповідні програми, щоб почати користуватися їхніми новими версіями.

source: This command will let you check if application updates are available: `flatpak remote-ls --updates`. If you add the `-d` option, it will generate detailed information about the available updates:
uk: Для перевірки оновлень програм можна скористатися такою командою: `flatpak remote-ls --updates`. Якщо ви додасте до неї параметр `-d`, буде виведено докладні відомості щодо доступних оновлень:

source: gnome-software will also notify you about application updates, just like it does on the normal workstation.
uk: gnome-software також сповіщатиме вас про оновлення програм у той самий спосіб, у який ця програма сповіщає про оновлення у звичайній системі для робочих станцій.
